[
    {
        "id": 4,
        "title": "Toggle Clamp Analizi",
        "date": "2025-12-04",
        "category": "Projects",
        "desc": "",
        "image": "/static/uploads/Projects/2025/toggle-clamp-analizi/gorsel_2026-01-31_210422167.png",
        "link": "article.html?id=4",
        "content": "# Giriş\r\n\r\n## Mekanizmanın Tanımı ve Çalışma Prensibi\r\n\r\n![alet, ev alet ve edevatı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/65a40100439db2c34c0b01740094c75c.jpeg)\r\n\r\nFigure 1 Toggle Clamp\r\n\r\nModern imalat süreçlerinde, iş parçalarının operasyon (delme, kaynak, frezeleme vb.) sırasında sabit ve güvenli bir şekilde pozisyonlanması hem üretim kalitesi hem de verimlilik açısından kritik bir öneme sahiptir. Bu görevi yerine getiren, **Hızlı Sıkma Mekanizması (Toggle Clamp)** olarak bilinen bağlantı elemanları, benzersiz bir kinematik prensibe dayanarak çalışır.\r\n\r\nBu mekanizma, temel olarak, tek bir serbestlik derecesine ($$D o F = 1$$) sahip modifiye edilmiş bir **dört çubuk mekanizmasıdır**. Sistem; bir **sabit uzuv**, bir **giriş kolu**, bir **bağlantı kolu** ve bir **sıkma kolundan** oluşur. Operatör, giriş koluna (genellikle ergonomik bir tutamağa sahip olan kol) bir giriş kuvveti ($$F_{i n p u t}$$) uygular. Bu hareket, kinematik zincir vasıtasıyla sıkma koluna iletilir ve bu kolun ucundaki baskı vidası (clamping screw) aracılığıyla iş parçasına bir çıkış kuvveti ($$F_{o u t p u t}$$) uygulanır.\r\n\r\nBir Toggle Clamp'ın kinematik temelini oluşturan dört çubuk mekanizması aşağıdaki görselde genel bir konfigürasyonda gösterilmiştir. Görselde, L1bağlantı kolu, L2 giriş kolunu, L3 çıkış kolunu ve L4 ise sabit uzvu temsil etmektedir.\r\n\r\n![çizgi, öykü gelişim çizgisi; kumpas; grafiğini çıkarma, paralel, diyagram içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/80685efa742f87a78d078d1fb1f16d7b.png)\r\n\r\nFigure 2 Toggle clamp mechanical model.\r\n\r\nGörseldeki \"Ölü Nokta Çizgisi\" ve \"Kendinden Kilitlenme Bölgesi\" ibareleri, bu mekanizmanın en temel teknik özelliği olan **\"makaslama\" veya \"kilitlenme\"** prensibini açıkça göstermektedir. Kinematik olarak bu durum, sistemin bağlantı kollarının (genellikle giriş kolu L2 ve bağlantı kolu L1 gibi) **aynı hizaya** geldiği veya bu hizayı çok az geçtiği \"ölü nokta\" civarında meydana gelir. Bu özel geometri, mekanizmanın yüksek performansını sağlayan temel faktördür. Gruebler kriterine göre, tek bir serbestlik derecesine ($$D o F = 1$$) sahip olan bu sistemde, tüm uzuvların konumu tek bir giriş değişkeni (örn: giriş kolunun açısı) ile tamamen tanımlanabilir.\r\n\r\n## Teknik Avantaj: Mekanik Kazanç ve Kendinden Kilitlenme\r\n\r\nToggle Clamp mekanizmasının mühendislik açısından değeri, bu \"ölü nokta\" geometrisinden kaynaklanır:\r\n\r\n1.  **Yüksek Mekanik Kazanç:** Mekanizma ölü noktaya yaklaştıkça, giriş kuvveti ile çıkış kuvveti arasındaki oran ($$M A = F_{o u t p u t} / F_{i n p u t}$$) hızla artar ve teorik olarak (sürtünmesiz ortamda) sonsuza yaklaşır. Bu sayede, operatörün uyguladığı **düşük bir el kuvveti**, iş parçasını sabitlemek için gereken **çok yüksek bir sıkma kuvvetine** dönüştürülür.\r\n2.  **Kendinden Kilitlenme:** Sistem, ölü noktayı (genellikle 1-2 derece) bir miktar geçtiğinde **\"merkez üstü\"** bir konuma kilitlenir. Bu pozisyonda, iş parçasından gelen tepki kuvvetinin ($$F_{w o r k p i e c e}$$) kolları geriye doğru açmaya çalışan bileşeni, mafsallardaki **sürtünme kuvvetlerinden** daha düşük kalır. Sonuç olarak, operatör giriş kolu üzerindeki kuvveti kaldırsa bile mekanizma kilitli pozisyonunu korur (tersinmezlik). Görseldeki \"Kendinden Kilitlenme Bölgesi\", bu sürtünme faktörünün kilitlenme üzerindeki etkisini ifade eder ve bu \"tersinmezlik\" özelliği, mekanizmanın en büyük avantajıdır.\r\n\r\n# Kabuller\r\n\r\n-   Kullanılan malzeme AISI 304, analizler için analizdeki tüm parçalara uygulanmış, homojen ve izotropik kabul edilmiştir.\r\n-   Pim bağlantılarındaki sürtünme katsayıları, statik analizde ihmal edilmiş olup, mekanizmanın en kritik yükleme durumu olan 'Kilitli Pozisyon' incelenecektir.\r\n-   Bazı kenarlardaki radyuslar analizlerin daha kısa sürmesi için kaldırılmıştır.\r\n\r\n# Hesaplama Modellerinin Tanımı\r\n\r\n## Malzeme Tanımları (AISI 304)\r\n\r\n### AISI 304 İçin Genel Malzeme Değerleri\r\n\r\nAISI 304 paslanmaz çelik için tanımlanan ve Tablo 31'de sunulan malzeme özellikleri, gerçekleştirilecek olan nümerik simülasyonların doğruluğu için temel teşkil etmektedir. Bu parametrelerin her biri, Sonlu Elemanlar Yöntemi (FEM) bünye denklemlerinde spesifik bir rol oynamaktadır:\r\n\r\n1.  **Elastikiyet Modülü (**$$\\mathbf{E}$$**)**\r\n-   **Değer:** $$1 9 0 , 0 0 0 / N m m^{2}$$\r\n-   **Teknik Anlam ve Analizdeki Rolü:** Malzemenin lineer elastik bölgedeki rijitliğini ifade eder. Hooke Yasası'nın $$\\sigma = E \\times \\in$$ temel katsayısıdır.\r\n-   **Simülasyon İçin Önemi:** Analiz yazılımı, **Global Rijitlik Matrisini (**$$\\mathbf{\\{ K \\}}$$**)** oluştururken bu değeri kullanır. Uygulanan kuvvetler altında mekanizmanın ne kadar elastik deformasyona uğrayacağı (yer değiştirme miktarı) doğrudan bu değere bağlıdır. Toggle Clamp mekanizmasındaki kolların yük altında ne kadar esneyeceği bu parametre ile belirlenir.\r\n2.  **Poisson Oranı (**$$\\mathbf{\\nu}$$**)**\r\n-   **Değer:** 0,29\r\n-   **Teknik Anlam ve Analizdeki Rolü:** Malzemenin eksenel yükleme altında, enine (yanal) birim şekil değiştirme miktarının boyuna birim şekil değiştirmeye oranıdır ($$\\nu = - \\epsilon_{t r a n s} / \\epsilon_{a x i a l}$$).\r\n-   **Simülasyon İçin Önemi:** Çok eksenli gerilme durumlarında ve **Von Mises** eşdeğer gerilmesinin hesaplanmasında kritiktir. 3 boyutlu gerilme analizinde, malzemenin hacimsel değişim direncini etkiler. Özellikle pim bağlantı noktalarındaki kompleks gerilme dağılımları hesaplanırken bu oran devreye girer.\r\n3.  **Kayma Modülü (**$$\\mathbf{G}$$**)**\r\n-   **Değer:** $$7 5 , 0 0 0 N / m m^{2}$$ (Raporda \" Kayma Modülü\" olarak geçiyor, terminolojik olarak \"Kayma Modülü\" daha uygundur).\r\n-   **Teknik Anlam ve Analizdeki Rolü:** Malzemenin kesme kuvvetlerine karşı gösterdiği dirençtir. İzotropik malzemeler için $$G = E \\left\\lbrack 2 / ( 1 + \\nu ) \\right\\rbrack$$ ilişkisi ile türetilebilir.\r\n-   **Simülasyon İçin Önemi:** Mekanizmadaki pimler ve bağlantı noktaları, çalışma esnasında yoğun kesme (shear) yüklerine maruz kalır. Bu bölgelerdeki açısal deformasyonların doğru hesaplanması için gereklidir.\r\n4.  **Akma Mukavemeti (**$$\\mathbf{\\sigma}_{\\left( \\mathbf{y} \\right)}$$**)**\r\n-   **Değer:** $$2 0 6 , 8 0 7 / N m m^{2}$$\r\n-   **Teknik Anlam ve Analizdeki Rolü:** Malzemenin elastik davranıştan plastik davranışa geçtiği gerilme sınırıdır.\r\n-   **Simülasyon İçin Önemi:**\r\n    -   **Lineer Analiz İçin:** Hasar kriteri olarak kullanılır. Hesaplanan Von Mises gerilmesi bu değeri aşarsa, parça \"hasarlı\" veya kalıcı deformasyona uğramış kabul edilir. Güvenlik Faktörü (Factor of Safety - FoS) hesabında paydada yer alır $$F o S = \\sigma_{y} / \\sigma_{v m}$$.\r\n    -   **Non-Lineer Analiz İçin:** Malzeme modelinin doğrusallıktan saptığı noktayı tanımlar. Bu değer aşıldığında simülasyon, \"Gerçek Gerilme - Gerçek Gerinim\" (True Stress-Strain) eğrisini takip etmeye başlar.\r\n5.  **Gerilme Mukavemeti (**$$\\mathbf{\\sigma}_{\\mathbf{U T S}} \\mathbf{- U l t i m a t e \\, T e n s i l e \\, S t r e n g t h}$$**)**\r\n-   **Değer:** $$5 1 7 , 0 1 7 \\  N / m m^{2}$$\r\n-   **Teknik Anlam ve Analizdeki Rolü:** Malzemenin kopmadan önce dayanabileceği maksimum gerilme değeridir.\r\n-   **Simülasyon İçin Önemi:** Özellikle **Yorulma (Fatigue) Analizi** için hayati önem taşır. S-N (Wöhler) eğrilerinin tahmin edilmesinde ve malzemenin ömür hesaplamalarında üst sınır referansı olarak kullanılır.\r\n6.  **Kütle Yoğunluğu (**$$\\mathbf{\\rho}$$**)**\r\n-   **Değer:** $$8 , 0 0 0 \\  k / g m^{3}$$\r\n-   **Teknik Anlam ve Analizdeki Rolü:** Birim hacimdeki madde miktarıdır.\r\n-   **Simülasyon İçin Önemi:** Statik analizlerde yerçekimi ivmesi ($$g$$) tanımlandığında, parçaların kendi ağırlıklarından (self-weight) kaynaklanan kuvvetlerin hesaplanmasını sağlar. Bu mekanizmada parça ağırlıkları dış yüklere göre düşük olsa da doğru bir modelleme için matrise dahil edilmiştir.\r\n\r\n| Özellikler         | Değer   | Birimler |\r\n|--------------------|---------|----------|\r\n| Elastikiyet Modülü | 190000  | N/mm\\^2  |\r\n| Poisson Oranı      | 0,29    | -        |\r\n| Kayma Modülü       | 75000   | N/mm\\^2  |\r\n| Kütle Yoğunluğu    | 8000    | Kg/m\\^3  |\r\n| Gerilme Mukavemeti | 517,017 | N/mm\\^2  |\r\n| Akma Mukavemeti    | 206,807 | N/mm\\^2  |\r\n\r\nTablo 31 General Data for AISI 304 (The information was copied from the SolidWorks2025 program.)\r\n\r\n### Non-Lineer Analiz İçin Germek Gerilme ve Gerçek Gerinim Değerleri\r\n\r\nStatik analizlerde genellikle lineer elastik malzeme modeli kullanılır ve bu modelde malzeme davranışı tek bir sabitle (Elastikiyet Modülü, $$E$$) tanımlanır. Ancak, bu çalışmada gerçekleştirilecek olan Non-Lineer (Doğrusal Olmayan) Statik Analiz, malzemenin Akma Mukavemeti ($$\\sigma_{y}$$) sınırını aştığı durumları da kapsamaktadır. Bu bölgede malzemenin davranışı artık lineer değildir ve Hooke Yasası ($$\\sigma = E \\times \\in$$) geçerliliğini yitirir. Bu nedenle, çözücünün (solver) plastik bölgedeki davranışı hesaplayabilmesi için tek bir değer yerine, gerilme ve gerinim arasındaki ilişkiyi tanımlayan tam bir gerilme-gerinim eğrisine (stress-strain curve) ihtiyacı vardır.\r\n\r\n**Mühendislik Gerilmesi vs. Gerçek Gerilme**\r\n\r\nStandart çekme testlerinden elde edilen veriler genellikle \"Mühendislik Gerilmesi\" ve \"Mühendislik Gerinimi\" cinsindendir. Mühendislik gerilmesi, uygulanan kuvvetin numunenin ilk kesit alanına ($$A_{0}$$) bölünmesiyle hesaplanır.\r\n\r\nAncak, Toggle Clamp mekanizması gibi parçalar plastik deformasyona uğradığında, kesit alanlarında daralma (büzülme) meydana gelir. Poisson etkisiyle gerçekleşen bu kesit daralması, numunenin o anki gerçek kesit alanının ($$A_{a c t u a l}$$) ilk alandan daha küçük olmasına neden olur.\r\n\r\n-   Mühendislik Gerilmesi: $$\\sigma_{e n g} = F / A_{0}$$\r\n-   Gerçek Gerilme: $$\\sigma_{t r u e} = F / A_{a c t u a l}$$\r\n\r\nSonlu Elemanlar Analizi (FEA) yazılımları, deforme olmuş geometri üzerindeki kuvvet dengesini çözdüğü için, malzeme girdisi olarak fiziksel gerçeği yansıtan Gerçek Gerilme - Gerçek Gerinim verilerini talep eder.\r\n\r\nFigure 3 True Stress and True Strain for AISI 304 [1]\r\n\r\n### Yorulma Analizi İçin Kırılma Çevrim Sayısı ve Gerilme Değerleri\r\n\r\nMühendislik uygulamalarında mekanik parçaların hasarı, genellikle statik akma sınırının ($$\\sigma_{y}$$) altındaki gerilme değerlerinde meydana gelir. Toggle Clamp mekanizması, çalışma prensibi gereği binlerce kez açılıp kapanan (yüklenen ve boşalan) bir sistemdir. Bu tekrarlı yükleme koşulları altında malzemenin \"yorulma\" (fatigue) davranışı, statik dayanım kadar kritik bir tasarım kriteridir.\r\n\r\n**S-N Eğrisinin (Wöhler Eğrisi) Anlamı**\r\n\r\nBu bölümde sunulan ve Figure 4'de gösterilen grafik, AISI 304 malzemesinin yorulma karakteristiğini tanımlayan S-N Eğrisidir (Stress vs. Number of Cycles).\r\n\r\nDikey Eksen (Stress Amplitude): Malzemeye uygulanan değişken gerilme genliğini ($$S$$ veya $$\\sigma_{a}$$) ifade eder.\r\n\r\nYatay Eksen (Cycles to Failure): Malzemenin o gerilme değerinde kopmadan önce dayanabileceği yük tekrar sayısını ($$N$$) logaritmik ölçekte gösterir.\r\n\r\nGrafik (Figure 4), gerilme genliği azaldıkça malzemenin ömrünün (çevrim sayısının) arttığını göstermektedir. Bu eğri, analiz yazılımının (SolidWorks Simulation) statik analizden elde ettiği gerilme sonuçlarını, malzemenin ömür beklentisine dönüştürmek için kullandığı temel transfer fonksiyonudur.\r\n\r\nFigure 4 Stress Amplitude and Cycles to Failure [2]\r\n\r\n## Sınır Koşullarının Belirlenmesi\r\n\r\nSonlu Elemanlar Analizi (FEA) modelinin güvenilir sonuçlar üretebilmesi için, mekanizmanın gerçek çalışma ortamını ve yükleme senaryolarını simüle eden sınır koşullarının hassasiyetle tanımlanması esastır. Toggle Clamp mekanizmasının çalışmasında en kritik an, mekanik kazancın ve gerilmelerin maksimum olduğu **\"Kilitli Pozisyon\"** durumu olduğundan, analizler bu kinematik konfigürasyon temel alınarak gerçekleştirilmiştir.\r\n\r\n### Sabitlenmiş Geometri\r\n\r\nAnaliz modelindeki kısıtlamalar, mekanizmanın sabitliğini sağlayan uzvu temsil eder:\r\n\r\nTanım: Mekanizmanın sabit uzvu ($$L \\_ 4$$) olan taban plakası, iş tezgahına veya fikstüre sabitlenmiş olarak kabul edilmiştir. Bu, tüm kinematik hareketin referanslandığı temel elemandır.\r\n\r\nUygulama: Şekil 94'te gösterildiği gibi, taban plakasının alt yüzeyindeki tüm düğüm noktaları, uzaydaki altı serbestlik derecesinin tamamı ($$\\delta_{x} = \\delta_{y} = \\delta_{z} = 0$$) kısıtlanarak tamamen sabitlenmiştir . Bu kısıtlama, sistemin kararlılığını garanti altına alır.\r\n\r\n![](/static/uploads/Projects/2025/toggle-clamp-analizi/00cb6424ceda895416afc63e014a118f.png)\r\n\r\nFigure 5 Fixed geometry.\r\n\r\n## Yüklerin Belirlenmesi\r\n\r\nStatik analiz, mekanizmanın üzerine uygulanan harici yükler altında ne kadar dayanıklı olduğunu ölçer. Toggle Clamp'in işlevi gereği, burada uygulanan harici yük, sıkma kuvveti ($$F_{o u t p u t}$$) karşısında iş parçasından gelen **tepki kuvveti** olarak modellenmiştir.\r\n\r\n-   **Yükleme Senaryosu:** Analiz, kabul edilen en kritik yükleme durumu olan \"Kilitli Pozisyon\" için yapılmıştır. Bu pozisyonda, sıkma kolunun ucundaki baskı vidasına, mekanizmayı açmaya zorlayacak yönde, yani dikey eksende bir baskı kuvveti uygulanmıştır.\r\n-   **Analiz Edilen Yük Değerleri:** Mekanizmanın farklı çalışma koşullarındaki davranışını ve malzeme limitlerini kapsamlı bir şekilde değerlendirebilmek için analizler farklı kuvvet seviyelerinde tekrarlanmıştır:\r\n-   **Lineer ve Non-Lineer Statik Analizler:** Mekanizmanın hem elastik bölgedeki nominal davranışını hem de plastik deformasyon riski taşıyan sınır durumlarını gözlemlemek amacıyla; $$F = 5 0 \\  v e \\  F = 5 5 0$$ olmak üzere iki farklı yük altında koşturulmuştur.\r\n-   **Yorulma (Fatigue) Analizi:** Tekrarlı yüklemeler sonucu oluşabilecek hasar çevrimini hesaplamak için, mekanizma $$F = 5 5 0$$ büyüklüğünde çevrimsel bir yüke maruz bırakılmıştır.\r\n\r\nBu kuvvet değerleri, sistemin Yüksek Mekanik Kazanç özelliği sayesinde operatörün uyguladığı giriş kuvvetinden ($$F_{i n p u t}$$) çok daha büyük olan, iş parçası üzerindeki ($$F_{o u t p u t}$$) değerlerini temsil etmektedir.\r\n\r\n![ekran görüntüsü, multimedya yazılımı, 3B modelleme, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/3d052e9b59da3d9c7ccf0d3f7ea8b7d1.png)\r\n\r\nFigure 6 Applied load\r\n\r\n## Mesh Oluşturma\r\n\r\nFEA'nın çözüm hassasiyeti, geometrinin ayrıştırıldığı ağ yapısına doğrudan bağlıdır:\r\n\r\n**Metot:** Analizde, Dört Yüzlü Katı Elemanlar kullanılarak tüm geometri çözüme uygun hale getirilmiştir.\r\n\r\n![ekran görüntüsü, metin, silah, 3B modelleme içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/b07911552e54edb0e602f36bfcbca227.png)\r\n\r\nFigure 7 Mesh Generation\r\n\r\n# Sayısal Hesaplama Sonuçları\r\n\r\nBu bölümde, Toggle Clamp mekanizması üzerinde gerçekleştirilen Lineer (Doğrusal), Non-Lineer (Doğrusal Olmayan) ve Yorulma analizlerin sonuçları karşılaştırmalı olarak değerlendirilmiştir. Analizlerin temel amacı, bu analizlerin ne işe yaradığını ve aralarındaki farkın ne olduğunu açıklamaktır.\r\n\r\n## Lineer Statik Analiz\r\n\r\nLineer statik analiz, yapısal analizlerin en temel yöntemidir ve malzemenin yükleme boyunca Hooke Yasası'na ($$\\sigma = E \\times \\in$$) tam uyum sağladığını varsayar. Bu yaklaşımda, malzeme özellikleri (Elastikiyet Modülü, Poisson Oranı) sabit kabul edilir ve gerilme ile gerinim arasında doğrusal bir ilişki olduğu varsayılır.\r\n\r\n### Lineer Statik Analiz Uygulama\r\n\r\nBu çalışmada, mekanizmanın elastik davranışını gözlemlemek amacıyla iki farklı yükleme senaryosu uygulanmıştır:\r\n\r\n**Deneme 1 (550 N):** Mekanizmaya uygulanan 550 N'luk yük altında yapılan analiz sonucunda, parçada oluşan maksimum Von Mises gerilmesi 501 MPa olarak hesaplanmıştır.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/a8cf55df216693b8605dc7fd2c239244.png)\r\n\r\nFigure 8 Linear analysis case 1\r\n\r\n**Deneme 2 (50 N)**: 50 N'luk düşük yük altında yapılan analizde ise maksimum gerilme değeri 45 MPa olarak elde edilmiştir.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/a2cd091bd8e4bc30802043bc85483ba7.png)\r\n\r\nFigure 9 Linear analysis case 2\r\n\r\nElde edilen bu değerler, malzemenin sadece elastik bölgedeki rijitliği ($$E$$) dikkate alınarak hesaplanmıştır.\r\n\r\nDeneme 3 (): Non-linear analiz için maksimum gerilme hesaplanmıştır.\r\n\r\n## Non-Lineer Statik Analiz\r\n\r\nNon-lineer (doğrusal olmayan) statik analiz, malzemenin akma sınırını aştığı ve kalıcı şekil değiştirmelerin (plastisite) başladığı durumları simüle etmek için kullanılır. Lineer analizin aksine, bu analizde gerilme ve gerinim arasındaki ilişki sabit değildir; malzeme kütüphanesine tanımlanan \"Gerçek Gerilme - Gerçek Gerinim\" (True Stress-Strain) eğrisini takip eder.\r\n\r\n### Non-Lineer Analiz Uygulama\r\n\r\nMekanizmanın plastik bölgedeki ve geometrik değişimler altındaki gerçek davranışını belirlemek için analizler tekrarlanmıştır:\r\n\r\n**Deneme 1 (550 N):** Malzemenin plastik deformasyon davranışı hesaba katıldığında, 550 N yük altında oluşan maksimum Von Mises gerilmesi 395 MPa olarak hesaplanmıştır.\r\n\r\n![metin, ekran görüntüsü, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/7b2c98768bd6801a37011d94a2ee2b66.png)\r\n\r\nFigure 10 Non-Linear analysis case 1\r\n\r\n**Deneme 2 (50 N):** 50 N yük altında ise maksimum gerilme 62 MPa olarak bulunmuştur.\r\n\r\n![metin, ekran görüntüsü, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/18ea751a44eafb91061fda4b76f9e18f.png)\r\n\r\nFigure 11 Non-Linear analysis case 2\r\n\r\nBu analiz, özellikle yüksek yükler altında gerilme yığılmalarının plastik şekil değiştirme ile nasıl sönümlendiğini göstermesi açısından kritik öneme sahiptir.\r\n\r\n### En Yüksek Gerilme\r\n\r\nLineer analizde en yüksek gerilmeyi bulmak söz konusu olamaz çünkü program mantığına göre Hooke yasası sonsuza kadar gidiyor ancak Non-Lineer gerilmede en yüksek gerilme bulunabilir. Figure 3’deki grafiğe göre en yüksek gerilme 1189,81 MPa’dır. SolidWorks programı içerisinde de bu değere ulaşılmaya çalışılmıştır. 1850N yük altında 1011MPa değerine ulaşılarak maksimum gerilme kabul edilmiştir.\r\n\r\n![ekran görüntüsü, multimedya yazılımı, yazılım, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/be6f13ef263b7b557f3753bdcc9c7dc3.png)\r\n\r\nFigure 12 Maximum Stress Trial\r\n\r\n## Yorulma Analizi\r\n\r\nMekanik parçaların hasarı, genellikle statik akma sınırının altındaki gerilme değerlerinde, tekrarlı yüklemeler sonucu meydana gelir. Toggle Clamp mekanizması da operasyonel ömrü boyunca binlerce kez açılıp kapanma döngüsüne maruz kaldığından, yapısal bütünlüğünün **Yorulma** kriterlerine göre değerlendirilmesi elzemdir.\r\n\r\n### Analiz Metodolojisi ve Ön Koşul\r\n\r\nSolidWorks Simulation altyapısında yorulma analizi gerçekleştirebilmek için, öncelikle sistemin gerilme durumunu tanımlayan bir **Lineer Statik Analiz** çalışmasının tamamlanması gerekmektedir1. Bu statik analiz, yorulma etüdü için referans yükleme verisi olarak kullanılır ve burada elde edilen gerilme değerleri, tanımlanan yük döngüsüne göre ölçeklendirilir.\r\n\r\n### Yorulma Analizi Veri Girişi\r\n\r\nSolidworks uygulamasında yorulma analiz yapabilmek için uygulamanın hazır olarak verdiği verileri kullanmak yetersizdir. Bundan dolayı bölüm 3.1.3’de verilen Figure 4’deki değerleri SolidWorks programına girilmesi gerekmektedir.\r\n\r\n![metin, yazılım, bilgisayar, ekran görüntüsü içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/e5664cb38417353657c3e6f2fe03f478.png)\r\n\r\nFigure 13 Fatigue analysis data entry\r\n\r\nVerileri girmek için SolidWorks programında stres-gerilim eğrisi olduğu yer açılır ve belirlenen değerler tabloya girilir.\r\n\r\n### Yükleme Stratejisi ve S-N Eğrisi Uyumu\r\n\r\nYorulma analizinde anlamlı ve gözlemlenebilir sonuçlar elde edebilmek (sonlu ömür hesabı yapabilmek) için, malzemede oluşan gerilme değerlerinin, malzeme kütüphanesine tanımlanan S-N Eğrisi (Gerilme - Çevrim Sayısı) sınırları içerisinde kalması gerekmektedir.\r\n\r\n**Hedeflenen Gerilme Aralığı:** AISI 304 malzemesi için tanımlanan yorulma verileri, yaklaşık 150MPa (Sonsuz ömür sınırı/Yorulma limiti) ile 360MPa (Düşük çevrimli yorulma sınırı) aralığındadır.\r\n\r\n**Uygulanan Yük:** Statik analizde uygulanan yük, bu hedef aralığın ortasında, belirgin bir yorulma ömrü gözlemleyebilmek amacıyla optimize edilmiştir. Yaklaşık 500N seviyesinde bir yük uygulanarak, malzeme üzerinde 230 MPa seviyesinde bir maksimum Von Mises gerilmesi hedeflenmiştir.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/98e21abe157435346b79ccecf2955789.png)\r\n\r\nFigure 14 Static analysis for fatigue analysis\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/d75d461caaa17ff9764d7aa4e0d9057c.png)\r\n\r\nFigure 15 Fatigue analysis\r\n\r\nBu strateji sayesinde, mekanizmanın ne sonsuz ömre sahip olduğu (\"hasar yok\" sonucu) ne de statik olarak anında hasar gördüğü; bunun yerine ölçülebilir bir \"çevrim ömrü\" sunduğu bölge analiz edilmiştir.\r\n\r\n### Model İyileştirmesi: Gerilme Yığılmalarının Giderilmesi\r\n\r\nAnaliz iterasyonları sırasında, hedeflenen gerilme değerlerine (230 MPa) ulaşılmasına rağmen, ilk sonuçlarda mekanizmanın tüm parçaları için teorik olarak **\"Sonsuz Ömür\"** hesaplandığı gözlemlenmiştir.\r\n\r\nYapılan detaylı incelemede, maksimum gerilme değerlerinin mekanizmanın ana kollarından ziyade, bağlantı elemanı olarak kullanılan somunların keskin köşelerinde ve diş diplerinde noktasal olarak toplandığı (gerilme yığılması) tespit edilmiştir. Bu durum, sayısal bir artefakt oluşturarak mekanizmanın kritik uzuvlarındaki gerçek yorulma hasarını maskelemiştir.\r\n\r\nBu yanıltıcı durumun önüne geçmek ve ana parçalar üzerindeki gerilme dağılımını daha doğru analiz edebilmek amacıyla;\r\n\r\n-   Analiz modelinde sadeleştirmeye gidilmiştir.\r\n-   Yük taşımada kritik rol oynamayan ancak gerilme tekilliğine sebep olan somunlar montajdan çıkarılmıştır.\r\n\r\nBu geometrik düzenleme sonrasında tekrarlanan analizlerde, gerilme dağılımının mekanizmanın kollarına doğru şekilde yayıldığı ve anlamlı bir ömür hesabı yapılabildiği doğrulanmıştır.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/7fd2c8b6a70a52dc54eeaf629a2fc2a5.png)\r\n\r\nFigure 16 Excessive load on nuts\r\n\r\n# Sonuçlar ve Değerlendirme\r\n\r\nBu çalışmada, AISI 304 paslanmaz çelik malzemeden imal edilmiş bir Hızlı Sıkma Mekanizmasının (Toggle Clamp) yapısal davranışı, Sonlu Elemanlar Yöntemi (FEM) kullanılarak kapsamlı bir şekilde incelenmiştir. Elde edilen bulgular üç ana başlık altında değerlendirilmiştir.\r\n\r\n## Lineer ve Non-Lineer Statik Analiz Sonuçlarının Karşılaştırılması\r\n\r\nAnalizler, mekanizmanın davranışını karakterize etmek için 50 N (Nominal Yük) ve 550 N (Aşırı Yük) olmak üzere iki farklı yükleme senaryosunda gerçekleştirilmiştir. Elde edilen Von Mises gerilme değerleri, malzemenin Akma Mukavemeti referans alınarak irdelenmiştir.\r\n\r\n### Durum 1: Elastik Bölge Davranışı (50 N Yükleme)\r\n\r\nMekanizmaya 50 N kuvvet uygulandığında, sistemde oluşan gerilmeler malzemenin elastik limitleri içerisinde kalmaktadır.\r\n\r\nLineer Analiz Sonucu: **45 MPa**.\r\n\r\nNon-Lineer Analiz Sonucu: **62 MPa**.\r\n\r\n### Durum 2: Plastik Bölge ve Hooke Yasası'ndan Sapma (550 N Yükleme)\r\n\r\nYükleme kuvveti 550 N değerine çıkarıldığında, analiz sonuçları arasında dramatik bir fark ortaya çıkmaktadır. Bu durum, malzemenin plastik bölgeye geçişi ile açıklanabilir.\r\n\r\nLineer Analiz Sonucu: **501 MPa**.\r\n\r\nNon-Lineer Analiz Sonucu: **395 MPa**.\r\n\r\n### Teknik Değerlendirme\r\n\r\nBölüm 3.1.2’de belirtildiği üzere, Lineer Statik Analiz, hesaplama boyunca parçanın **kesit alanının başlangıçtaki haliyle sabit kaldığını (**$$\\mathbf{A}_{\\mathbf{0}}$$**)** ve hiç değişmediğini varsayar. Bu sabit kesit kabulü, malzemenin fiziksel sınırlarının matematiksel olarak yok sayılmasına neden olur. Yani kesit alanı değişmediği için, uygulanan kuvvet ne olursa olsun **Hooke yasasındaki oran sonsuza kadar gidiyor varsayılır** ve hesaplama buna göre yapılır. Bu varsayım sayesinde analiz programı, karmaşık döngülere girmeden hesaplamayı tek bir matematiksel adımda ve oldukça hızlı bir şekilde sonuçlandırır.\r\n\r\nAncak Non-Lineer Statik Analiz, yükü tek seferde uygulamak yerine adım adım (kademeli olarak) uygular. Her yükleme adımında parçanın şekil değiştirmesiyle oluşan **yeni kesit alanını (**$$\\mathbf{A}_{\\mathbf{a c t u a l}}$$**)** ve Figure 3 True Stress and True Strain for AISI 304 [1]'teki eğriye göre güncel direncini kontrol eder. Eğer malzeme akma sınırını geçtiyse, program bu kesit değişimini fark eder ve hesabını ona göre günceller. Bu sürekli kontrol ve düzeltme döngüsü, analizin lineer analize göre daha uzun sürmesine neden olur ancak fiziksel gerçeği doğru yansıtır.\r\n\r\nBu çalışmada, 550 N yük altında Lineer Analiz ile hesaplanan **501 MPa** değeri, fiziksel olarak yanıltıcıdır. Çünkü lineer analiz, kesit alanı matematiksel olarak sabit tutulduğu için malzeme 206.8 MPa akma sınırını geçse bile, bu sınırı görmezden gelmiş ve gerilmeyi sanki malzeme hala elastikmiş (Hooke yasası sonsuzmuş) gibi doğrusal bir çizgi üzerinde artırmaya devam etmiştir.\r\n\r\nBuna karşın Non-Lineer analiz, değişen kesit alanı hesaba katıldığı için malzeme akma gerilmesine ulaştığında artık \"aktığını\" ve plastikleştiğini tespit etmiştir. Malzeme plastik bölgeye geçtiğinde, aşırı yük şekil değişimine harcanarak sönümlenir ve gerilme artışı yavaşlar. Sonuç olarak elde edilen **395 MPa** değeri, malzemenin akma davranışını da hesaba katan, gerçek hayatta karşılaşılacak olan doğru değerdir.\r\n\r\nBu karşılaştırma, malzemenin sınırlarının zorlandığı yüksek yükleme durumlarında, Lineer analizin verdiği sonuçların sanal birer matematiksel değerden ibaret olduğunu, güvenilir bir tasarım için Non-Lineer analizin şart olduğunu göstermektedir.\r\n\r\n![metin, yazı tipi, ekran görüntüsü, çizgi içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/8944ea8783095a2840a05b3df21971f7.png)\r\n\r\nFigure 18 The difference between linear and non-linear analysis is shown graphically.\r\n\r\n## Yorulma Ömrü ve Model İyileştirmesi\r\n\r\nMekanizmanın tekrarlı yükler altındaki davranışını belirlemek için yapılan yorulma analizlerinde, AISI 304 malzemesinin S-N (Wöhler) eğrisindeki karakteristik bölgeler hedeflenmiştir.\r\n\r\n-   **Analiz Stratejisi:** Statik analizde güvenli görünen gerilmeler, dinamik yüklemelerde hasara yol açabileceğinden, analizler S-N eğrisinin \"sonlu ömür\" bölgesine denk gelen 500 N yük altında gerçekleştirilmiştir.\r\n-   **Geometrik Düzenleme:** İlk analizlerde, yük taşıyıcı olmayan somunların keskin köşelerinde meydana gelen gerilme tekillikleri, tüm sistemin ömrünü hatalı bir şekilde domine etmiştir. Analizin doğruluğunu artırmak amacıyla bu elemanlar modelden çıkarılarak tekrarlanan simülasyonda, gerilmenin mekanizma kollarına gerçekçi bir şekilde dağıldığı gözlemlenmiştir.\r\n-   **Ömür Tahmini:** İyileştirilmiş model üzerinde yapılan analiz sonucunda, mekanizmanın kritik bağlantı noktalarında belirli bir çevrim sayısından sonra yorulma hasarının başlayabileceği öngörülmüştür. Bu veri, periyodik bakım aralıklarının belirlenmesinde referans teşkil etmektedir.\r\n\r\n## Genel Sonuç\r\n\r\nBu raporda kullanılan Toggle Clamp mekanizması, analiz işlemlerinin daha hızlı ve sorunsuz yapılabilmesi için yeniden çizilmiş ve geometrik olarak basitleştirilmiştir. Model üzerindeki bazı detayların (radyuslar, somunlar vb.) kaldırılmış olması nedeniyle, elde edilen analiz sonuçları gerçek hayattaki ürünün davranışını birebir yansıtmayabilir.\r\n\r\nAncak bu çalışmanın asıl amacı, kusursuz bir ürün simülasyonu yapmak değil; mühendislik analiz yöntemlerini öğrenmek ve karşılaştırmaktır.\r\n\r\nBu çalışma sayesinde şu temel çıktılar elde edilmiştir:\r\n\r\n-   **Lineer ve Non-Lineer Analiz Farkı:** Elastik bölgede her iki yöntemin de benzer çalıştığı, ancak malzemenin akma sınırını geçtiği durumlarda (plastik bölge) Lineer analizin yetersiz kaldığı görülmüştür.\r\n-   **Yorulma Analizinin Önemi:** Statik olarak sağlam görünen bir parçanın, tekrarlı yükler altında nasıl ömür hesabı yapılması gerektiği kavranmıştır.\r\n\r\nÖzetle; bu rapor ile Lineer, Non-Lineer ve Yorulma analizlerinin çalışma mantığı ve aralarındaki temel farklar başarılı bir şekilde ortaya konmuştur.\r\n\r\n# References\r\n\r\n| [1]  | 2. &. Y. X. &. A. A. E.-A. &. S.-H. Z. &. K. B. N. &. J.-M. L. Liang-Liang Xia1, «Deformation characteristics in hydro-mechanical forming process of thin-walled hollow component with large deformation: experimentation and finite element modeling,» p. 4708, 22 March 2019.  |\r\n|------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\r\n| [2]  | Q. P. N. T. a. L. L. F. Cui, «Enhanced high-cycle fatigue resistance of 304 austenitic stainless steel with nanotwinned grains,» p. 4, 2021.                                                                                                                                     |\r\n",
        "tr": {
            "title": "Toggle Clamp Analizi",
            "desc": "",
            "content": "# Giriş\r\n\r\n## Mekanizmanın Tanımı ve Çalışma Prensibi\r\n\r\n![alet, ev alet ve edevatı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/65a40100439db2c34c0b01740094c75c.jpeg)\r\n\r\nFigure 1 Toggle Clamp\r\n\r\nModern imalat süreçlerinde, iş parçalarının operasyon (delme, kaynak, frezeleme vb.) sırasında sabit ve güvenli bir şekilde pozisyonlanması hem üretim kalitesi hem de verimlilik açısından kritik bir öneme sahiptir. Bu görevi yerine getiren, **Hızlı Sıkma Mekanizması (Toggle Clamp)** olarak bilinen bağlantı elemanları, benzersiz bir kinematik prensibe dayanarak çalışır.\r\n\r\nBu mekanizma, temel olarak, tek bir serbestlik derecesine ($$D o F = 1$$) sahip modifiye edilmiş bir **dört çubuk mekanizmasıdır**. Sistem; bir **sabit uzuv**, bir **giriş kolu**, bir **bağlantı kolu** ve bir **sıkma kolundan** oluşur. Operatör, giriş koluna (genellikle ergonomik bir tutamağa sahip olan kol) bir giriş kuvveti ($$F_{i n p u t}$$) uygular. Bu hareket, kinematik zincir vasıtasıyla sıkma koluna iletilir ve bu kolun ucundaki baskı vidası (clamping screw) aracılığıyla iş parçasına bir çıkış kuvveti ($$F_{o u t p u t}$$) uygulanır.\r\n\r\nBir Toggle Clamp'ın kinematik temelini oluşturan dört çubuk mekanizması aşağıdaki görselde genel bir konfigürasyonda gösterilmiştir. Görselde, L1bağlantı kolu, L2 giriş kolunu, L3 çıkış kolunu ve L4 ise sabit uzvu temsil etmektedir.\r\n\r\n![çizgi, öykü gelişim çizgisi; kumpas; grafiğini çıkarma, paralel, diyagram içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/80685efa742f87a78d078d1fb1f16d7b.png)\r\n\r\nFigure 2 Toggle clamp mechanical model.\r\n\r\nGörseldeki \"Ölü Nokta Çizgisi\" ve \"Kendinden Kilitlenme Bölgesi\" ibareleri, bu mekanizmanın en temel teknik özelliği olan **\"makaslama\" veya \"kilitlenme\"** prensibini açıkça göstermektedir. Kinematik olarak bu durum, sistemin bağlantı kollarının (genellikle giriş kolu L2 ve bağlantı kolu L1 gibi) **aynı hizaya** geldiği veya bu hizayı çok az geçtiği \"ölü nokta\" civarında meydana gelir. Bu özel geometri, mekanizmanın yüksek performansını sağlayan temel faktördür. Gruebler kriterine göre, tek bir serbestlik derecesine ($$D o F = 1$$) sahip olan bu sistemde, tüm uzuvların konumu tek bir giriş değişkeni (örn: giriş kolunun açısı) ile tamamen tanımlanabilir.\r\n\r\n## Teknik Avantaj: Mekanik Kazanç ve Kendinden Kilitlenme\r\n\r\nToggle Clamp mekanizmasının mühendislik açısından değeri, bu \"ölü nokta\" geometrisinden kaynaklanır:\r\n\r\n1.  **Yüksek Mekanik Kazanç:** Mekanizma ölü noktaya yaklaştıkça, giriş kuvveti ile çıkış kuvveti arasındaki oran ($$M A = F_{o u t p u t} / F_{i n p u t}$$) hızla artar ve teorik olarak (sürtünmesiz ortamda) sonsuza yaklaşır. Bu sayede, operatörün uyguladığı **düşük bir el kuvveti**, iş parçasını sabitlemek için gereken **çok yüksek bir sıkma kuvvetine** dönüştürülür.\r\n2.  **Kendinden Kilitlenme:** Sistem, ölü noktayı (genellikle 1-2 derece) bir miktar geçtiğinde **\"merkez üstü\"** bir konuma kilitlenir. Bu pozisyonda, iş parçasından gelen tepki kuvvetinin ($$F_{w o r k p i e c e}$$) kolları geriye doğru açmaya çalışan bileşeni, mafsallardaki **sürtünme kuvvetlerinden** daha düşük kalır. Sonuç olarak, operatör giriş kolu üzerindeki kuvveti kaldırsa bile mekanizma kilitli pozisyonunu korur (tersinmezlik). Görseldeki \"Kendinden Kilitlenme Bölgesi\", bu sürtünme faktörünün kilitlenme üzerindeki etkisini ifade eder ve bu \"tersinmezlik\" özelliği, mekanizmanın en büyük avantajıdır.\r\n\r\n# Kabuller\r\n\r\n-   Kullanılan malzeme AISI 304, analizler için analizdeki tüm parçalara uygulanmış, homojen ve izotropik kabul edilmiştir.\r\n-   Pim bağlantılarındaki sürtünme katsayıları, statik analizde ihmal edilmiş olup, mekanizmanın en kritik yükleme durumu olan 'Kilitli Pozisyon' incelenecektir.\r\n-   Bazı kenarlardaki radyuslar analizlerin daha kısa sürmesi için kaldırılmıştır.\r\n\r\n# Hesaplama Modellerinin Tanımı\r\n\r\n## Malzeme Tanımları (AISI 304)\r\n\r\n### AISI 304 İçin Genel Malzeme Değerleri\r\n\r\nAISI 304 paslanmaz çelik için tanımlanan ve Tablo 31'de sunulan malzeme özellikleri, gerçekleştirilecek olan nümerik simülasyonların doğruluğu için temel teşkil etmektedir. Bu parametrelerin her biri, Sonlu Elemanlar Yöntemi (FEM) bünye denklemlerinde spesifik bir rol oynamaktadır:\r\n\r\n1.  **Elastikiyet Modülü (**$$\\mathbf{E}$$**)**\r\n-   **Değer:** $$1 9 0 , 0 0 0 / N m m^{2}$$\r\n-   **Teknik Anlam ve Analizdeki Rolü:** Malzemenin lineer elastik bölgedeki rijitliğini ifade eder. Hooke Yasası'nın $$\\sigma = E \\times \\in$$ temel katsayısıdır.\r\n-   **Simülasyon İçin Önemi:** Analiz yazılımı, **Global Rijitlik Matrisini (**$$\\mathbf{\\{ K \\}}$$**)** oluştururken bu değeri kullanır. Uygulanan kuvvetler altında mekanizmanın ne kadar elastik deformasyona uğrayacağı (yer değiştirme miktarı) doğrudan bu değere bağlıdır. Toggle Clamp mekanizmasındaki kolların yük altında ne kadar esneyeceği bu parametre ile belirlenir.\r\n2.  **Poisson Oranı (**$$\\mathbf{\\nu}$$**)**\r\n-   **Değer:** 0,29\r\n-   **Teknik Anlam ve Analizdeki Rolü:** Malzemenin eksenel yükleme altında, enine (yanal) birim şekil değiştirme miktarının boyuna birim şekil değiştirmeye oranıdır ($$\\nu = - \\epsilon_{t r a n s} / \\epsilon_{a x i a l}$$).\r\n-   **Simülasyon İçin Önemi:** Çok eksenli gerilme durumlarında ve **Von Mises** eşdeğer gerilmesinin hesaplanmasında kritiktir. 3 boyutlu gerilme analizinde, malzemenin hacimsel değişim direncini etkiler. Özellikle pim bağlantı noktalarındaki kompleks gerilme dağılımları hesaplanırken bu oran devreye girer.\r\n3.  **Kayma Modülü (**$$\\mathbf{G}$$**)**\r\n-   **Değer:** $$7 5 , 0 0 0 N / m m^{2}$$ (Raporda \" Kayma Modülü\" olarak geçiyor, terminolojik olarak \"Kayma Modülü\" daha uygundur).\r\n-   **Teknik Anlam ve Analizdeki Rolü:** Malzemenin kesme kuvvetlerine karşı gösterdiği dirençtir. İzotropik malzemeler için $$G = E \\left\\lbrack 2 / ( 1 + \\nu ) \\right\\rbrack$$ ilişkisi ile türetilebilir.\r\n-   **Simülasyon İçin Önemi:** Mekanizmadaki pimler ve bağlantı noktaları, çalışma esnasında yoğun kesme (shear) yüklerine maruz kalır. Bu bölgelerdeki açısal deformasyonların doğru hesaplanması için gereklidir.\r\n4.  **Akma Mukavemeti (**$$\\mathbf{\\sigma}_{\\left( \\mathbf{y} \\right)}$$**)**\r\n-   **Değer:** $$2 0 6 , 8 0 7 / N m m^{2}$$\r\n-   **Teknik Anlam ve Analizdeki Rolü:** Malzemenin elastik davranıştan plastik davranışa geçtiği gerilme sınırıdır.\r\n-   **Simülasyon İçin Önemi:**\r\n    -   **Lineer Analiz İçin:** Hasar kriteri olarak kullanılır. Hesaplanan Von Mises gerilmesi bu değeri aşarsa, parça \"hasarlı\" veya kalıcı deformasyona uğramış kabul edilir. Güvenlik Faktörü (Factor of Safety - FoS) hesabında paydada yer alır $$F o S = \\sigma_{y} / \\sigma_{v m}$$.\r\n    -   **Non-Lineer Analiz İçin:** Malzeme modelinin doğrusallıktan saptığı noktayı tanımlar. Bu değer aşıldığında simülasyon, \"Gerçek Gerilme - Gerçek Gerinim\" (True Stress-Strain) eğrisini takip etmeye başlar.\r\n5.  **Gerilme Mukavemeti (**$$\\mathbf{\\sigma}_{\\mathbf{U T S}} \\mathbf{- U l t i m a t e \\, T e n s i l e \\, S t r e n g t h}$$**)**\r\n-   **Değer:** $$5 1 7 , 0 1 7 \\  N / m m^{2}$$\r\n-   **Teknik Anlam ve Analizdeki Rolü:** Malzemenin kopmadan önce dayanabileceği maksimum gerilme değeridir.\r\n-   **Simülasyon İçin Önemi:** Özellikle **Yorulma (Fatigue) Analizi** için hayati önem taşır. S-N (Wöhler) eğrilerinin tahmin edilmesinde ve malzemenin ömür hesaplamalarında üst sınır referansı olarak kullanılır.\r\n6.  **Kütle Yoğunluğu (**$$\\mathbf{\\rho}$$**)**\r\n-   **Değer:** $$8 , 0 0 0 \\  k / g m^{3}$$\r\n-   **Teknik Anlam ve Analizdeki Rolü:** Birim hacimdeki madde miktarıdır.\r\n-   **Simülasyon İçin Önemi:** Statik analizlerde yerçekimi ivmesi ($$g$$) tanımlandığında, parçaların kendi ağırlıklarından (self-weight) kaynaklanan kuvvetlerin hesaplanmasını sağlar. Bu mekanizmada parça ağırlıkları dış yüklere göre düşük olsa da doğru bir modelleme için matrise dahil edilmiştir.\r\n\r\n| Özellikler         | Değer   | Birimler |\r\n|--------------------|---------|----------|\r\n| Elastikiyet Modülü | 190000  | N/mm\\^2  |\r\n| Poisson Oranı      | 0,29    | -        |\r\n| Kayma Modülü       | 75000   | N/mm\\^2  |\r\n| Kütle Yoğunluğu    | 8000    | Kg/m\\^3  |\r\n| Gerilme Mukavemeti | 517,017 | N/mm\\^2  |\r\n| Akma Mukavemeti    | 206,807 | N/mm\\^2  |\r\n\r\nTablo 31 General Data for AISI 304 (The information was copied from the SolidWorks2025 program.)\r\n\r\n### Non-Lineer Analiz İçin Germek Gerilme ve Gerçek Gerinim Değerleri\r\n\r\nStatik analizlerde genellikle lineer elastik malzeme modeli kullanılır ve bu modelde malzeme davranışı tek bir sabitle (Elastikiyet Modülü, $$E$$) tanımlanır. Ancak, bu çalışmada gerçekleştirilecek olan Non-Lineer (Doğrusal Olmayan) Statik Analiz, malzemenin Akma Mukavemeti ($$\\sigma_{y}$$) sınırını aştığı durumları da kapsamaktadır. Bu bölgede malzemenin davranışı artık lineer değildir ve Hooke Yasası ($$\\sigma = E \\times \\in$$) geçerliliğini yitirir. Bu nedenle, çözücünün (solver) plastik bölgedeki davranışı hesaplayabilmesi için tek bir değer yerine, gerilme ve gerinim arasındaki ilişkiyi tanımlayan tam bir gerilme-gerinim eğrisine (stress-strain curve) ihtiyacı vardır.\r\n\r\n**Mühendislik Gerilmesi vs. Gerçek Gerilme**\r\n\r\nStandart çekme testlerinden elde edilen veriler genellikle \"Mühendislik Gerilmesi\" ve \"Mühendislik Gerinimi\" cinsindendir. Mühendislik gerilmesi, uygulanan kuvvetin numunenin ilk kesit alanına ($$A_{0}$$) bölünmesiyle hesaplanır.\r\n\r\nAncak, Toggle Clamp mekanizması gibi parçalar plastik deformasyona uğradığında, kesit alanlarında daralma (büzülme) meydana gelir. Poisson etkisiyle gerçekleşen bu kesit daralması, numunenin o anki gerçek kesit alanının ($$A_{a c t u a l}$$) ilk alandan daha küçük olmasına neden olur.\r\n\r\n-   Mühendislik Gerilmesi: $$\\sigma_{e n g} = F / A_{0}$$\r\n-   Gerçek Gerilme: $$\\sigma_{t r u e} = F / A_{a c t u a l}$$\r\n\r\nSonlu Elemanlar Analizi (FEA) yazılımları, deforme olmuş geometri üzerindeki kuvvet dengesini çözdüğü için, malzeme girdisi olarak fiziksel gerçeği yansıtan Gerçek Gerilme - Gerçek Gerinim verilerini talep eder.\r\n\r\nFigure 3 True Stress and True Strain for AISI 304 [1]\r\n\r\n### Yorulma Analizi İçin Kırılma Çevrim Sayısı ve Gerilme Değerleri\r\n\r\nMühendislik uygulamalarında mekanik parçaların hasarı, genellikle statik akma sınırının ($$\\sigma_{y}$$) altındaki gerilme değerlerinde meydana gelir. Toggle Clamp mekanizması, çalışma prensibi gereği binlerce kez açılıp kapanan (yüklenen ve boşalan) bir sistemdir. Bu tekrarlı yükleme koşulları altında malzemenin \"yorulma\" (fatigue) davranışı, statik dayanım kadar kritik bir tasarım kriteridir.\r\n\r\n**S-N Eğrisinin (Wöhler Eğrisi) Anlamı**\r\n\r\nBu bölümde sunulan ve Figure 4'de gösterilen grafik, AISI 304 malzemesinin yorulma karakteristiğini tanımlayan S-N Eğrisidir (Stress vs. Number of Cycles).\r\n\r\nDikey Eksen (Stress Amplitude): Malzemeye uygulanan değişken gerilme genliğini ($$S$$ veya $$\\sigma_{a}$$) ifade eder.\r\n\r\nYatay Eksen (Cycles to Failure): Malzemenin o gerilme değerinde kopmadan önce dayanabileceği yük tekrar sayısını ($$N$$) logaritmik ölçekte gösterir.\r\n\r\nGrafik (Figure 4), gerilme genliği azaldıkça malzemenin ömrünün (çevrim sayısının) arttığını göstermektedir. Bu eğri, analiz yazılımının (SolidWorks Simulation) statik analizden elde ettiği gerilme sonuçlarını, malzemenin ömür beklentisine dönüştürmek için kullandığı temel transfer fonksiyonudur.\r\n\r\nFigure 4 Stress Amplitude and Cycles to Failure [2]\r\n\r\n## Sınır Koşullarının Belirlenmesi\r\n\r\nSonlu Elemanlar Analizi (FEA) modelinin güvenilir sonuçlar üretebilmesi için, mekanizmanın gerçek çalışma ortamını ve yükleme senaryolarını simüle eden sınır koşullarının hassasiyetle tanımlanması esastır. Toggle Clamp mekanizmasının çalışmasında en kritik an, mekanik kazancın ve gerilmelerin maksimum olduğu **\"Kilitli Pozisyon\"** durumu olduğundan, analizler bu kinematik konfigürasyon temel alınarak gerçekleştirilmiştir.\r\n\r\n### Sabitlenmiş Geometri\r\n\r\nAnaliz modelindeki kısıtlamalar, mekanizmanın sabitliğini sağlayan uzvu temsil eder:\r\n\r\nTanım: Mekanizmanın sabit uzvu ($$L \\_ 4$$) olan taban plakası, iş tezgahına veya fikstüre sabitlenmiş olarak kabul edilmiştir. Bu, tüm kinematik hareketin referanslandığı temel elemandır.\r\n\r\nUygulama: Şekil 94'te gösterildiği gibi, taban plakasının alt yüzeyindeki tüm düğüm noktaları, uzaydaki altı serbestlik derecesinin tamamı ($$\\delta_{x} = \\delta_{y} = \\delta_{z} = 0$$) kısıtlanarak tamamen sabitlenmiştir . Bu kısıtlama, sistemin kararlılığını garanti altına alır.\r\n\r\n![](/static/uploads/Projects/2025/toggle-clamp-analizi/00cb6424ceda895416afc63e014a118f.png)\r\n\r\nFigure 5 Fixed geometry.\r\n\r\n## Yüklerin Belirlenmesi\r\n\r\nStatik analiz, mekanizmanın üzerine uygulanan harici yükler altında ne kadar dayanıklı olduğunu ölçer. Toggle Clamp'in işlevi gereği, burada uygulanan harici yük, sıkma kuvveti ($$F_{o u t p u t}$$) karşısında iş parçasından gelen **tepki kuvveti** olarak modellenmiştir.\r\n\r\n-   **Yükleme Senaryosu:** Analiz, kabul edilen en kritik yükleme durumu olan \"Kilitli Pozisyon\" için yapılmıştır. Bu pozisyonda, sıkma kolunun ucundaki baskı vidasına, mekanizmayı açmaya zorlayacak yönde, yani dikey eksende bir baskı kuvveti uygulanmıştır.\r\n-   **Analiz Edilen Yük Değerleri:** Mekanizmanın farklı çalışma koşullarındaki davranışını ve malzeme limitlerini kapsamlı bir şekilde değerlendirebilmek için analizler farklı kuvvet seviyelerinde tekrarlanmıştır:\r\n-   **Lineer ve Non-Lineer Statik Analizler:** Mekanizmanın hem elastik bölgedeki nominal davranışını hem de plastik deformasyon riski taşıyan sınır durumlarını gözlemlemek amacıyla; $$F = 5 0 \\  v e \\  F = 5 5 0$$ olmak üzere iki farklı yük altında koşturulmuştur.\r\n-   **Yorulma (Fatigue) Analizi:** Tekrarlı yüklemeler sonucu oluşabilecek hasar çevrimini hesaplamak için, mekanizma $$F = 5 5 0$$ büyüklüğünde çevrimsel bir yüke maruz bırakılmıştır.\r\n\r\nBu kuvvet değerleri, sistemin Yüksek Mekanik Kazanç özelliği sayesinde operatörün uyguladığı giriş kuvvetinden ($$F_{i n p u t}$$) çok daha büyük olan, iş parçası üzerindeki ($$F_{o u t p u t}$$) değerlerini temsil etmektedir.\r\n\r\n![ekran görüntüsü, multimedya yazılımı, 3B modelleme, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/3d052e9b59da3d9c7ccf0d3f7ea8b7d1.png)\r\n\r\nFigure 6 Applied load\r\n\r\n## Mesh Oluşturma\r\n\r\nFEA'nın çözüm hassasiyeti, geometrinin ayrıştırıldığı ağ yapısına doğrudan bağlıdır:\r\n\r\n**Metot:** Analizde, Dört Yüzlü Katı Elemanlar kullanılarak tüm geometri çözüme uygun hale getirilmiştir.\r\n\r\n![ekran görüntüsü, metin, silah, 3B modelleme içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/b07911552e54edb0e602f36bfcbca227.png)\r\n\r\nFigure 7 Mesh Generation\r\n\r\n# Sayısal Hesaplama Sonuçları\r\n\r\nBu bölümde, Toggle Clamp mekanizması üzerinde gerçekleştirilen Lineer (Doğrusal), Non-Lineer (Doğrusal Olmayan) ve Yorulma analizlerin sonuçları karşılaştırmalı olarak değerlendirilmiştir. Analizlerin temel amacı, bu analizlerin ne işe yaradığını ve aralarındaki farkın ne olduğunu açıklamaktır.\r\n\r\n## Lineer Statik Analiz\r\n\r\nLineer statik analiz, yapısal analizlerin en temel yöntemidir ve malzemenin yükleme boyunca Hooke Yasası'na ($$\\sigma = E \\times \\in$$) tam uyum sağladığını varsayar. Bu yaklaşımda, malzeme özellikleri (Elastikiyet Modülü, Poisson Oranı) sabit kabul edilir ve gerilme ile gerinim arasında doğrusal bir ilişki olduğu varsayılır.\r\n\r\n### Lineer Statik Analiz Uygulama\r\n\r\nBu çalışmada, mekanizmanın elastik davranışını gözlemlemek amacıyla iki farklı yükleme senaryosu uygulanmıştır:\r\n\r\n**Deneme 1 (550 N):** Mekanizmaya uygulanan 550 N'luk yük altında yapılan analiz sonucunda, parçada oluşan maksimum Von Mises gerilmesi 501 MPa olarak hesaplanmıştır.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/a8cf55df216693b8605dc7fd2c239244.png)\r\n\r\nFigure 8 Linear analysis case 1\r\n\r\n**Deneme 2 (50 N)**: 50 N'luk düşük yük altında yapılan analizde ise maksimum gerilme değeri 45 MPa olarak elde edilmiştir.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/a2cd091bd8e4bc30802043bc85483ba7.png)\r\n\r\nFigure 9 Linear analysis case 2\r\n\r\nElde edilen bu değerler, malzemenin sadece elastik bölgedeki rijitliği ($$E$$) dikkate alınarak hesaplanmıştır.\r\n\r\nDeneme 3 (): Non-linear analiz için maksimum gerilme hesaplanmıştır.\r\n\r\n## Non-Lineer Statik Analiz\r\n\r\nNon-lineer (doğrusal olmayan) statik analiz, malzemenin akma sınırını aştığı ve kalıcı şekil değiştirmelerin (plastisite) başladığı durumları simüle etmek için kullanılır. Lineer analizin aksine, bu analizde gerilme ve gerinim arasındaki ilişki sabit değildir; malzeme kütüphanesine tanımlanan \"Gerçek Gerilme - Gerçek Gerinim\" (True Stress-Strain) eğrisini takip eder.\r\n\r\n### Non-Lineer Analiz Uygulama\r\n\r\nMekanizmanın plastik bölgedeki ve geometrik değişimler altındaki gerçek davranışını belirlemek için analizler tekrarlanmıştır:\r\n\r\n**Deneme 1 (550 N):** Malzemenin plastik deformasyon davranışı hesaba katıldığında, 550 N yük altında oluşan maksimum Von Mises gerilmesi 395 MPa olarak hesaplanmıştır.\r\n\r\n![metin, ekran görüntüsü, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/7b2c98768bd6801a37011d94a2ee2b66.png)\r\n\r\nFigure 10 Non-Linear analysis case 1\r\n\r\n**Deneme 2 (50 N):** 50 N yük altında ise maksimum gerilme 62 MPa olarak bulunmuştur.\r\n\r\n![metin, ekran görüntüsü, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/18ea751a44eafb91061fda4b76f9e18f.png)\r\n\r\nFigure 11 Non-Linear analysis case 2\r\n\r\nBu analiz, özellikle yüksek yükler altında gerilme yığılmalarının plastik şekil değiştirme ile nasıl sönümlendiğini göstermesi açısından kritik öneme sahiptir.\r\n\r\n### En Yüksek Gerilme\r\n\r\nLineer analizde en yüksek gerilmeyi bulmak söz konusu olamaz çünkü program mantığına göre Hooke yasası sonsuza kadar gidiyor ancak Non-Lineer gerilmede en yüksek gerilme bulunabilir. Figure 3’deki grafiğe göre en yüksek gerilme 1189,81 MPa’dır. SolidWorks programı içerisinde de bu değere ulaşılmaya çalışılmıştır. 1850N yük altında 1011MPa değerine ulaşılarak maksimum gerilme kabul edilmiştir.\r\n\r\n![ekran görüntüsü, multimedya yazılımı, yazılım, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/be6f13ef263b7b557f3753bdcc9c7dc3.png)\r\n\r\nFigure 12 Maximum Stress Trial\r\n\r\n## Yorulma Analizi\r\n\r\nMekanik parçaların hasarı, genellikle statik akma sınırının altındaki gerilme değerlerinde, tekrarlı yüklemeler sonucu meydana gelir. Toggle Clamp mekanizması da operasyonel ömrü boyunca binlerce kez açılıp kapanma döngüsüne maruz kaldığından, yapısal bütünlüğünün **Yorulma** kriterlerine göre değerlendirilmesi elzemdir.\r\n\r\n### Analiz Metodolojisi ve Ön Koşul\r\n\r\nSolidWorks Simulation altyapısında yorulma analizi gerçekleştirebilmek için, öncelikle sistemin gerilme durumunu tanımlayan bir **Lineer Statik Analiz** çalışmasının tamamlanması gerekmektedir1. Bu statik analiz, yorulma etüdü için referans yükleme verisi olarak kullanılır ve burada elde edilen gerilme değerleri, tanımlanan yük döngüsüne göre ölçeklendirilir.\r\n\r\n### Yorulma Analizi Veri Girişi\r\n\r\nSolidworks uygulamasında yorulma analiz yapabilmek için uygulamanın hazır olarak verdiği verileri kullanmak yetersizdir. Bundan dolayı bölüm 3.1.3’de verilen Figure 4’deki değerleri SolidWorks programına girilmesi gerekmektedir.\r\n\r\n![metin, yazılım, bilgisayar, ekran görüntüsü içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/e5664cb38417353657c3e6f2fe03f478.png)\r\n\r\nFigure 13 Fatigue analysis data entry\r\n\r\nVerileri girmek için SolidWorks programında stres-gerilim eğrisi olduğu yer açılır ve belirlenen değerler tabloya girilir.\r\n\r\n### Yükleme Stratejisi ve S-N Eğrisi Uyumu\r\n\r\nYorulma analizinde anlamlı ve gözlemlenebilir sonuçlar elde edebilmek (sonlu ömür hesabı yapabilmek) için, malzemede oluşan gerilme değerlerinin, malzeme kütüphanesine tanımlanan S-N Eğrisi (Gerilme - Çevrim Sayısı) sınırları içerisinde kalması gerekmektedir.\r\n\r\n**Hedeflenen Gerilme Aralığı:** AISI 304 malzemesi için tanımlanan yorulma verileri, yaklaşık 150MPa (Sonsuz ömür sınırı/Yorulma limiti) ile 360MPa (Düşük çevrimli yorulma sınırı) aralığındadır.\r\n\r\n**Uygulanan Yük:** Statik analizde uygulanan yük, bu hedef aralığın ortasında, belirgin bir yorulma ömrü gözlemleyebilmek amacıyla optimize edilmiştir. Yaklaşık 500N seviyesinde bir yük uygulanarak, malzeme üzerinde 230 MPa seviyesinde bir maksimum Von Mises gerilmesi hedeflenmiştir.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/98e21abe157435346b79ccecf2955789.png)\r\n\r\nFigure 14 Static analysis for fatigue analysis\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/d75d461caaa17ff9764d7aa4e0d9057c.png)\r\n\r\nFigure 15 Fatigue analysis\r\n\r\nBu strateji sayesinde, mekanizmanın ne sonsuz ömre sahip olduğu (\"hasar yok\" sonucu) ne de statik olarak anında hasar gördüğü; bunun yerine ölçülebilir bir \"çevrim ömrü\" sunduğu bölge analiz edilmiştir.\r\n\r\n### Model İyileştirmesi: Gerilme Yığılmalarının Giderilmesi\r\n\r\nAnaliz iterasyonları sırasında, hedeflenen gerilme değerlerine (230 MPa) ulaşılmasına rağmen, ilk sonuçlarda mekanizmanın tüm parçaları için teorik olarak **\"Sonsuz Ömür\"** hesaplandığı gözlemlenmiştir.\r\n\r\nYapılan detaylı incelemede, maksimum gerilme değerlerinin mekanizmanın ana kollarından ziyade, bağlantı elemanı olarak kullanılan somunların keskin köşelerinde ve diş diplerinde noktasal olarak toplandığı (gerilme yığılması) tespit edilmiştir. Bu durum, sayısal bir artefakt oluşturarak mekanizmanın kritik uzuvlarındaki gerçek yorulma hasarını maskelemiştir.\r\n\r\nBu yanıltıcı durumun önüne geçmek ve ana parçalar üzerindeki gerilme dağılımını daha doğru analiz edebilmek amacıyla;\r\n\r\n-   Analiz modelinde sadeleştirmeye gidilmiştir.\r\n-   Yük taşımada kritik rol oynamayan ancak gerilme tekilliğine sebep olan somunlar montajdan çıkarılmıştır.\r\n\r\nBu geometrik düzenleme sonrasında tekrarlanan analizlerde, gerilme dağılımının mekanizmanın kollarına doğru şekilde yayıldığı ve anlamlı bir ömür hesabı yapılabildiği doğrulanmıştır.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/7fd2c8b6a70a52dc54eeaf629a2fc2a5.png)\r\n\r\nFigure 16 Excessive load on nuts\r\n\r\n# Sonuçlar ve Değerlendirme\r\n\r\nBu çalışmada, AISI 304 paslanmaz çelik malzemeden imal edilmiş bir Hızlı Sıkma Mekanizmasının (Toggle Clamp) yapısal davranışı, Sonlu Elemanlar Yöntemi (FEM) kullanılarak kapsamlı bir şekilde incelenmiştir. Elde edilen bulgular üç ana başlık altında değerlendirilmiştir.\r\n\r\n## Lineer ve Non-Lineer Statik Analiz Sonuçlarının Karşılaştırılması\r\n\r\nAnalizler, mekanizmanın davranışını karakterize etmek için 50 N (Nominal Yük) ve 550 N (Aşırı Yük) olmak üzere iki farklı yükleme senaryosunda gerçekleştirilmiştir. Elde edilen Von Mises gerilme değerleri, malzemenin Akma Mukavemeti referans alınarak irdelenmiştir.\r\n\r\n### Durum 1: Elastik Bölge Davranışı (50 N Yükleme)\r\n\r\nMekanizmaya 50 N kuvvet uygulandığında, sistemde oluşan gerilmeler malzemenin elastik limitleri içerisinde kalmaktadır.\r\n\r\nLineer Analiz Sonucu: **45 MPa**.\r\n\r\nNon-Lineer Analiz Sonucu: **62 MPa**.\r\n\r\n### Durum 2: Plastik Bölge ve Hooke Yasası'ndan Sapma (550 N Yükleme)\r\n\r\nYükleme kuvveti 550 N değerine çıkarıldığında, analiz sonuçları arasında dramatik bir fark ortaya çıkmaktadır. Bu durum, malzemenin plastik bölgeye geçişi ile açıklanabilir.\r\n\r\nLineer Analiz Sonucu: **501 MPa**.\r\n\r\nNon-Lineer Analiz Sonucu: **395 MPa**.\r\n\r\n### Teknik Değerlendirme\r\n\r\nBölüm 3.1.2’de belirtildiği üzere, Lineer Statik Analiz, hesaplama boyunca parçanın **kesit alanının başlangıçtaki haliyle sabit kaldığını (**$$\\mathbf{A}_{\\mathbf{0}}$$**)** ve hiç değişmediğini varsayar. Bu sabit kesit kabulü, malzemenin fiziksel sınırlarının matematiksel olarak yok sayılmasına neden olur. Yani kesit alanı değişmediği için, uygulanan kuvvet ne olursa olsun **Hooke yasasındaki oran sonsuza kadar gidiyor varsayılır** ve hesaplama buna göre yapılır. Bu varsayım sayesinde analiz programı, karmaşık döngülere girmeden hesaplamayı tek bir matematiksel adımda ve oldukça hızlı bir şekilde sonuçlandırır.\r\n\r\nAncak Non-Lineer Statik Analiz, yükü tek seferde uygulamak yerine adım adım (kademeli olarak) uygular. Her yükleme adımında parçanın şekil değiştirmesiyle oluşan **yeni kesit alanını (**$$\\mathbf{A}_{\\mathbf{a c t u a l}}$$**)** ve Figure 3 True Stress and True Strain for AISI 304 [1]'teki eğriye göre güncel direncini kontrol eder. Eğer malzeme akma sınırını geçtiyse, program bu kesit değişimini fark eder ve hesabını ona göre günceller. Bu sürekli kontrol ve düzeltme döngüsü, analizin lineer analize göre daha uzun sürmesine neden olur ancak fiziksel gerçeği doğru yansıtır.\r\n\r\nBu çalışmada, 550 N yük altında Lineer Analiz ile hesaplanan **501 MPa** değeri, fiziksel olarak yanıltıcıdır. Çünkü lineer analiz, kesit alanı matematiksel olarak sabit tutulduğu için malzeme 206.8 MPa akma sınırını geçse bile, bu sınırı görmezden gelmiş ve gerilmeyi sanki malzeme hala elastikmiş (Hooke yasası sonsuzmuş) gibi doğrusal bir çizgi üzerinde artırmaya devam etmiştir.\r\n\r\nBuna karşın Non-Lineer analiz, değişen kesit alanı hesaba katıldığı için malzeme akma gerilmesine ulaştığında artık \"aktığını\" ve plastikleştiğini tespit etmiştir. Malzeme plastik bölgeye geçtiğinde, aşırı yük şekil değişimine harcanarak sönümlenir ve gerilme artışı yavaşlar. Sonuç olarak elde edilen **395 MPa** değeri, malzemenin akma davranışını da hesaba katan, gerçek hayatta karşılaşılacak olan doğru değerdir.\r\n\r\nBu karşılaştırma, malzemenin sınırlarının zorlandığı yüksek yükleme durumlarında, Lineer analizin verdiği sonuçların sanal birer matematiksel değerden ibaret olduğunu, güvenilir bir tasarım için Non-Lineer analizin şart olduğunu göstermektedir.\r\n\r\n![metin, yazı tipi, ekran görüntüsü, çizgi içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/8944ea8783095a2840a05b3df21971f7.png)\r\n\r\nFigure 18 The difference between linear and non-linear analysis is shown graphically.\r\n\r\n## Yorulma Ömrü ve Model İyileştirmesi\r\n\r\nMekanizmanın tekrarlı yükler altındaki davranışını belirlemek için yapılan yorulma analizlerinde, AISI 304 malzemesinin S-N (Wöhler) eğrisindeki karakteristik bölgeler hedeflenmiştir.\r\n\r\n-   **Analiz Stratejisi:** Statik analizde güvenli görünen gerilmeler, dinamik yüklemelerde hasara yol açabileceğinden, analizler S-N eğrisinin \"sonlu ömür\" bölgesine denk gelen 500 N yük altında gerçekleştirilmiştir.\r\n-   **Geometrik Düzenleme:** İlk analizlerde, yük taşıyıcı olmayan somunların keskin köşelerinde meydana gelen gerilme tekillikleri, tüm sistemin ömrünü hatalı bir şekilde domine etmiştir. Analizin doğruluğunu artırmak amacıyla bu elemanlar modelden çıkarılarak tekrarlanan simülasyonda, gerilmenin mekanizma kollarına gerçekçi bir şekilde dağıldığı gözlemlenmiştir.\r\n-   **Ömür Tahmini:** İyileştirilmiş model üzerinde yapılan analiz sonucunda, mekanizmanın kritik bağlantı noktalarında belirli bir çevrim sayısından sonra yorulma hasarının başlayabileceği öngörülmüştür. Bu veri, periyodik bakım aralıklarının belirlenmesinde referans teşkil etmektedir.\r\n\r\n## Genel Sonuç\r\n\r\nBu raporda kullanılan Toggle Clamp mekanizması, analiz işlemlerinin daha hızlı ve sorunsuz yapılabilmesi için yeniden çizilmiş ve geometrik olarak basitleştirilmiştir. Model üzerindeki bazı detayların (radyuslar, somunlar vb.) kaldırılmış olması nedeniyle, elde edilen analiz sonuçları gerçek hayattaki ürünün davranışını birebir yansıtmayabilir.\r\n\r\nAncak bu çalışmanın asıl amacı, kusursuz bir ürün simülasyonu yapmak değil; mühendislik analiz yöntemlerini öğrenmek ve karşılaştırmaktır.\r\n\r\nBu çalışma sayesinde şu temel çıktılar elde edilmiştir:\r\n\r\n-   **Lineer ve Non-Lineer Analiz Farkı:** Elastik bölgede her iki yöntemin de benzer çalıştığı, ancak malzemenin akma sınırını geçtiği durumlarda (plastik bölge) Lineer analizin yetersiz kaldığı görülmüştür.\r\n-   **Yorulma Analizinin Önemi:** Statik olarak sağlam görünen bir parçanın, tekrarlı yükler altında nasıl ömür hesabı yapılması gerektiği kavranmıştır.\r\n\r\nÖzetle; bu rapor ile Lineer, Non-Lineer ve Yorulma analizlerinin çalışma mantığı ve aralarındaki temel farklar başarılı bir şekilde ortaya konmuştur.\r\n\r\n# References\r\n\r\n| [1]  | 2. &. Y. X. &. A. A. E.-A. &. S.-H. Z. &. K. B. N. &. J.-M. L. Liang-Liang Xia1, «Deformation characteristics in hydro-mechanical forming process of thin-walled hollow component with large deformation: experimentation and finite element modeling,» p. 4708, 22 March 2019.  |\r\n|------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\r\n| [2]  | Q. P. N. T. a. L. L. F. Cui, «Enhanced high-cycle fatigue resistance of 304 austenitic stainless steel with nanotwinned grains,» p. 4, 2021.                                                                                                                                     |\r\n"
        },
        "en": {
            "title": "Toggle Clamp Analaysis",
            "desc": "",
            "content": "# Introduction\r\n\r\n## Description of the Mechanism and Working Principle\r\n\r\n![alet, ev alet ve edevatı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/65a40100439db2c34c0b01740094c75c.jpeg)\r\n\r\nFigure 1 Toggle Clamp\r\n\r\nIn modern manufacturing processes, the stable and secure positioning of workpieces during operations (drilling, welding, milling, etc.) is of critical importance for both production quality and efficiency1. The fastening elements known as **Toggle Clamps**, which fulfill this task, operate based on a unique kinematic principle.\r\n\r\nFundamentally this mechanism is a modified four-bar linkage possessing a single degree of freedom ($$D o F = 1$$). The system consists of a fixed link, an input link, a connecting link (coupler), and a clamping link. The operator applies an input force ($$F_{i n p u t}$$) to the input link (typically the arm equipped with an ergonomic handle). This motion is transmitted to the clamping link via the kinematic chain, and an output force ($$F_{o u t p u t}$$) is exerted on the workpiece through the clamping screw located at the tip of this link.\r\n\r\nThe four-bar linkage forming the kinematic foundation of a Toggle Clamp is illustrated in a general configuration in the figure below. In the figure, L1 represents the connecting link, L2 the input link, L3 the output link, and L4 the fixed link.\r\n\r\n![çizgi, öykü gelişim çizgisi; kumpas; grafiğini çıkarma, paralel, diyagram içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/80685efa742f87a78d078d1fb1f16d7b.png)\r\n\r\nFigure 2 Toggle clamp mechanical model.\r\n\r\n## Technical Advantage: Mechanical Advantage and Self-Locking\r\n\r\nThe engineering value of the Toggle Clamp mechanism stems from this \"dead-center\" geometry:\r\n\r\n-   **High Mechanical Advantage:** As the mechanism approaches the dead center, the ratio between the input force and the output force ($$M A = F_{o u t p u t} / F_{i n p u t}$$) increases rapidly and theoretically (in a frictionless environment) approaches infinity. Thereby, a low manual force applied by the operator is converted into the very high clamping force required to secure the workpiece.\r\n-   **Self-Locking:** When the system moves slightly past the dead center (usually 1-2 degrees), it locks into an \"**over-center**\" position5. In this position, the component of the reaction force from the workpiece ($$F_{w o r k p i e c e}$$) that attempts to open the arms backward remains lower than the friction forces at the joints. Consequently, the mechanism maintains its locked position even if the operator removes the force on the input handle (**irreversibility**). The \"Self-Locking Region\" in the visual indicates the effect of this friction factor on the locking, and this \"**irreversibility**\" feature is the mechanism's greatest advantage.\r\n\r\n# Assumptions\r\n\r\n-   The material used, AISI 304, was applied to all components in the analysis and assumed to be homogeneous and isotropic.\r\n-   Friction coefficients at the pin joints were neglected in the static analysis; the investigation focuses on the 'Locked Position,' which represents the mechanism's most critical loading case.\r\n-   Fillets on certain edges were removed (defeatured) to reduce computational time.\r\n\r\n# Calculation Model Definitions\r\n\r\n## Material Definitions (AISI 304)\r\n\r\n### General Material Values for AISI 304\r\n\r\nAISI 304 defined for stainless steel and Tablo 31 The material properties presented in the Specifier are the basis for the accuracy of the numerical simulations to be performed. Each of these parameters plays a specific role in the Finite Element Method (FEM) constitution equations:\r\n\r\n1.  **Modulus of Elasticity (**$$\\mathbf{E}$$**)**\r\n-   **Value:** $$1 9 0 , 0 0 0 / N m m^{2}$$\r\n-   **Technical Meaning and Role in Analysis:** It refers to the rigidity of the material in the linear elastic region. It is the basic coefficient of Hooke's Law ($$\\sigma = E \\times \\in$$).\r\n-   **Importance for Simulation:** Analysis software uses this value when creating **the Global Stiffness Matrix (**$$\\mathbf{\\{ K \\}}$$**).** How much elastic deformation the mechanism undergoes under applied forces (the amount of displacement) directly depends on this value. How much the arms in the Toggle Clamp mechanism will flex underload is determined by this parameter.\r\n2.  **Poisson's Ratio (**$$\\mathbf{\\nu}$$**)**\r\n-   **Value:** 0.29\r\n-   **Technical Meaning and Role in Analysis: It** is the ratio of the transverse (lateral) unit deformation amount of the material to the longitudinal unit deformation under axial loading (.$$\\nu = - \\epsilon_{t r a n s} / \\epsilon_{a x i a l}$$)\r\n-   **Importance for Simulation: Critical** in multiaxial stress situations and in calculating **the Von Mises** equivalent stress. In 3D stress analysis, it affects the volumetric change resistance of the material. This ratio comes into play, especially when calculating complex stress distributions at pin connection points.\r\n3.  **Shear Modulus (**$$\\mathbf{G}$$**)**\r\n-   **Value:** $$7 5 , 0 0 0 N / m m^{2}$$ (It is referred to as \"Shear Modulus\" in the report, terminologically \"Shear Modulus\" is more appropriate).\r\n-   **Technical Meaning and Role in Analysis:** It is the resistance of the material to shear forces. It can be derived by its relationship for isotropic materials. $$G = E \\left\\lbrack 2 / ( 1 + \\nu ) \\right\\rbrack$$\r\n-   **Importance for Simulation:** Pins and ports in the mechanism are subjected to intense shear loads during operation. It is necessary for the correct calculation of angular deformations in these regions.\r\n4.  **Yield Strength (**$$\\mathbf{\\sigma}_{\\left( \\mathbf{y} \\right)}$$**)**\r\n-   **Value:** $$2 0 6 , 8 0 7 / N m m^{2}$$\r\n-   **Technical Meaning and Role in Analysis:** It is the stress limit at which the material transitions from elastic to plastic behavior.\r\n-   **Importance for Simulation:**\r\n    -   **For Linear Analysis:** It is used as a damage criterion. If the calculated Von Mises stress exceeds this value, the part is considered \"damaged\" or has undergone permanent deformation. It is included in the denominator in the Factor of Safety (FoS) calculation.$$F o S = \\sigma_{y} / \\sigma_{v m}$$\r\n    -   **For Non-Linear Analysis:** Defines the point at which the material pattern deviates from linearity. When this value is exceeded, the simulation starts to follow the \"True Stress-Strain\" curve.\r\n5.  **Ultimate Tensile Strength (**$$\\mathbf{\\sigma}_{\\mathbf{U T S}}$$**)**\r\n-   **Value:** $$5 1 7 , 0 1 7 \\  N / m m^{2}$$\r\n-   **Technical Meaning and Role in Analysis:** It is the maximum stress value that the material can withstand before breaking.\r\n-   **Importance for Simulation:** It is especially vital for Fatigue Analysis. It is used as an upper limit reference in estimating S-N (Wöhler) curves and in material life calculations.\r\n6.  **Mass Density (**$$\\mathbf{\\rho}$$**)**\r\n-   **Value:** $$8 , 0 0 0 \\  k g / m^{3}$$\r\n-   **Technical Meaning and Role in Analysis:** It is the amount of substance per unit volume.\r\n-   **Importance for Simulation:** When gravitational acceleration ($$g$$) is defined in static analysis, it enables the calculation of forces arising from the self-weight of the parts. In this mechanism, although the part weights are low compared to external loads, they are included in the matrix for accurate modeling.\r\n\r\n| Properties                | Value   | Units   |\r\n|---------------------------|---------|---------|\r\n| Modulus of Elasticity     | 190000  | N/mm\\^2 |\r\n| Poisson's Ratio           | 0,29    | -       |\r\n| Shear Modulus             | 75000   | N/mm\\^2 |\r\n| Mass Density              | 8000    | Kg/m\\^3 |\r\n| Ultimate Tensile Strength | 517,017 | N/mm\\^2 |\r\n| Yield Strength            | 206,807 | N/mm\\^2 |\r\n\r\nTablo 31 General Data for AISI 304 (The information was copied from the SolidWorks2025 program.)\r\n\r\n### True Stress and True Strain Values for Non-Linear Analysis\r\n\r\nIn static analyses, a linear elastic material model is typically used, and in this model, material behavior is defined by a single constant (**Modulus of Elasticity,** $$\\mathbf{E}$$). However, the **Non-Linear Static Analysis** to be performed in this study also covers cases where the material exceeds its **Yield Strength (**$$\\mathbf{\\sigma}_{\\mathbf{y}}$$**)** limit.\r\n\r\nIn this region, the material behavior is no longer linear, and **Hooke's Law (**$$\\mathbf{\\sigma} \\mathbf{= \\  E \\ } \\mathbf{\\cdot \\epsilon}$$**)** loses its validity. Consequently, for the solver to calculate behavior in the plastic region, it requires a complete **stress-strain curve** defining the relationship between stress and strain, rather than a single value.\r\n\r\n**Engineering Stress vs. True Stress**\r\n\r\nData obtained from standard tensile tests are usually in terms of \"**Engineering Stress**\" and \"**Engineering Strain**\". Engineering stress is calculated by dividing the applied force by the specimen's **initial cross-sectional area (**$$\\mathbf{A}_{\\mathbf{0}}$$**)**.\r\n\r\nHowever, when components like the Toggle Clamp mechanism undergo plastic deformation, a **reduction (contraction)** occurs in their cross-sectional areas. This cross-sectional reduction, occurring due to the **Poisson effect**, causes the specimen's instantaneous actual cross-sectional area ($$A_{a c t u a l}$$) to be smaller than the initial area.\r\n\r\n-   **Engineering Stress:** $$\\sigma_{e n g} = F / A_{0}$$\r\n-   **True Stress:** $$\\sigma_{t r u e} = F / A_{a c t u a l}$$\r\n\r\nSince **Finite Element Analysis (FEA)** software solves for force equilibrium on the **deformed geometry**, it demands **True Stress - True Strain** data, which reflects physical reality, as material input.\r\n\r\nFigure 3 True Stress and True Strain for AISI 304 [1]\r\n\r\n### Cycles to Failure and Stress Values for Fatigue Analysis\r\n\r\nIn engineering applications, the failure of mechanical components often occurs at stress levels below the **static yield strength (**$$\\mathbf{\\sigma}_{\\mathbf{y}}$$**)**.\r\n\r\nDue to its working principle, the Toggle Clamp mechanism is a system subjected to thousands of opening and closing cycles (**loading and unloading**). Under these **cyclic loading** conditions, the \"fatigue\" behavior of the material is a design criterion as critical as its static strength.\r\n\r\n**Significance of the S-N Curve (Wöhler Curve)**\r\n\r\nThe graph presented in this section and shown in Figure 4 is the **S-N Curve** (Stress vs. Number of Cycles) defining the fatigue characteristics of the AISI 304 material.\r\n\r\n-   Vertical Axis (Stress Amplitude): Represents the variable stress amplitude ($$S$$ or $$\\sigma_{a}$$) applied to the material.\r\n-   Horizontal Axis (Cycles to Failure): Shows the number of load cycles ($$N$$) the material can withstand at that stress level before failure, displayed on a logarithmic scale.\r\n\r\nThe graph (Figure 4) indicates that as the stress amplitude decreases, the material's life (number of cycles) increases. This curve serves as the fundamental **transfer function** used by the analysis software (SolidWorks Simulation) to convert stress results obtained from static analysis into the material's **life expectancy**.\r\n\r\nFigure 4 Stress Amplitude and Cycles to Failure [2]\r\n\r\n## Determination of Boundary Conditions\r\n\r\nFor the **Finite Element Analysis (FEA)** model to produce reliable results, it is essential to precisely define the boundary conditions that simulate the mechanism's actual operating environment and loading scenarios.\r\n\r\nSince the most critical moment in the operation of the Toggle Clamp is the '**Locked Position**', where mechanical advantage and stresses are at their maximum, the analyses were carried out based on this kinematic configuration.\r\n\r\n### Fixed Geometry\r\n\r\nThe constraints in the analysis model represent the link responsible for the mechanism's stability:\r\n\r\nDefinition: The base plate, which is the fixed link ($$L_{4}$$) of the mechanism, is assumed to be rigidly fixed to the workbench or fixture. This is the fundamental element to which all kinematic motion is referenced.\r\n\r\nApplication: As shown in Figure 5 , all nodes on the bottom surface of the base plate are fully fixed by constraining all six degrees of freedom in space ($$\\delta x = \\delta y = \\delta z = 0$$). This constraint guarantees the stability of the system.\r\n\r\n![ekran görüntüsü, silah, multimedya yazılımı, metin içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/00cb6424ceda895416afc63e014a118f.png)\r\n\r\nFigure 5 Fixed geometry\r\n\r\n## Determination of Loads\r\n\r\nStatic analysis evaluates the **structural integrity** of the mechanism under applied external loads. In accordance with the function of the Toggle Clamp, the external load herein is modeled as the **reaction force** from the workpiece opposing the clamping force ($$F_{o u t p u t}$$).\r\n\r\n**Loading Scenario:** The analysis was conducted for the \"**Locked Position**,\" which is considered the most critical loading case. In this position, a compressive force was applied to the **clamping screw** at the tip of the clamping arm in the vertical axis, in a direction forcing the mechanism to unclamp (open).\r\n\r\n**Analyzed Load Values:** Analyses were repeated at different force levels to comprehensively evaluate the mechanism's behavior under various operating conditions and to assess material limits.\r\n\r\n**Linear and Non-Linear Static Analyses:** Two different load cases, $$F = 5 0 \\text{ N}$$ and $$F = 5 5 0 \\text{ N}$$, were simulated to observe both the nominal behavior in the elastic region and the limit states posing a risk of plastic deformation.\r\n\r\n**Fatigue Analysis:** To calculate the damage cycles resulting from repetitive loading, the mechanism was subjected to a **cyclic load** of magnitude $$F = 5 5 0 \\text{ N}$$.\r\n\r\nThese force values represent the values on the workpiece ($$F_{o u t p u t}$$), which are significantly larger than the input force ($$F_{i n p u t}$$) applied by the operator, due to the system's **High Mechanical Advantage** feature.\r\n\r\n![ekran görüntüsü, multimedya yazılımı, 3B modelleme, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/3d052e9b59da3d9c7ccf0d3f7ea8b7d1.png)\r\n\r\nFigure 6 Applied load\r\n\r\n## Mesh Generation\r\n\r\nThe solution accuracy of FEA is directly dependent on the mesh structure into which the geometry is discretized.\r\n\r\nMethod: In the analysis, the entire geometry was discretized (made suitable for solution) using Tetrahedral Solid Elements.\r\n\r\n![ekran görüntüsü, metin, silah, 3B modelleme içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/b07911552e54edb0e602f36bfcbca227.png)\r\n\r\nFigure 7 Mesh Generation\r\n\r\n# Numerical Calculation Results\r\n\r\nIn this section, the results of the **Linear**, **Non-Linear**, and **Fatigue** analyses performed on the Toggle Clamp mechanism are evaluated comparatively. The primary objective of the analysis is to explain the utility of these methods and the differences between them.\r\n\r\n## Linear Static Analysis\r\n\r\nLinear static analysis is the most fundamental method of structural analysis and assumes that the material fully complies with **Hooke's Law** ($$\\sigma = \\  E \\  \\cdot \\epsilon$$) throughout the loading process. In this approach, material properties (**Modulus of Elasticity**, **Poisson's Ratio**) are considered constant, and a linear relationship between stress and strain is assumed.\r\n\r\nIn this study, two different loading scenarios were applied to observe the elastic behavior of the mechanism:\r\n\r\n**Case 1 (550 N):** As a result of the analysis performed under a 550 N load applied to the mechanism, the maximum Von Mises stress occurring in the component was calculated as 501 MPa.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/a8cf55df216693b8605dc7fd2c239244.png)x”\r\n\r\nFigure 8 Linear analysis case 1\r\n\r\n**Case 2 (50 N):** In the analysis performed under a low load of 50 N, the maximum stress value was obtained as 45 MPa.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/a2cd091bd8e4bc30802043bc85483ba7.png)\r\n\r\nFigure 9 Linear analysis case 2\r\n\r\nThese values were calculated by considering only the **stiffness (**$$\\mathbf{E}$$**)** of the material in the elastic region.\r\n\r\n## Non-Linear Static Analysis\r\n\r\n**Non-linear static analysis** is used to simulate situations where the material exceeds its yield limit and permanent deformations (**plasticity**) begin. Unlike linear analysis, in this analysis, the relationship between stress and strain is not constant; it follows the \"**True Stress-Strain**\" curve defined in the material library.\r\n\r\n### Non-Linear Analysis Data Entry\r\n\r\nUsing the default data provided by SolidWorks is insufficient for performing non-linear analysis. Consequently, the values presented in Figure 3 (Section 3.1.2) must be input into the SolidWorks software manually.\r\n\r\n![metin, bilgisayar, ekran görüntüsü, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/fe14fdce2d164ab05d03fa8befe55103.png)\r\n\r\nFigure 10 Non-linear analysis data entry\r\n\r\nTo define this data, the stress-strain curve interface within SolidWorks must be accessed, and the specified values entered into the table.\r\n\r\n### Execution of Non-Linear Analysis\r\n\r\nAnalyses were repeated to determine the mechanism's true behavior in the plastic region and under geometric changes:\r\n\r\n**Case 1 (550 N):** When the material's plastic deformation behavior is taken into account, the maximum **Von Mises stress** occurring under a 550 N load was calculated as **395 MPa**.\r\n\r\n![metin, ekran görüntüsü, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/7b2c98768bd6801a37011d94a2ee2b66.png)\r\n\r\nFigure 11 Non-Linear analysis case 1\r\n\r\n**Case 2 (50 N):** Under a 50 N load, the maximum stress was found to be **62 MPa**.\r\n\r\n![metin, ekran görüntüsü, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/18ea751a44eafb91061fda4b76f9e18f.png)\r\n\r\nFigure 12 Non-Linear analysis case 2\r\n\r\nThis analysis is of critical importance in demonstrating how stress concentrations are alleviated (redistributed) through plastic deformation, especially under high loads.\r\n\r\n### Maximum Stress\r\n\r\nIn linear analysis, determining the actual maximum stress is not feasible because the software logic assumes Hooke's Law applies indefinitely. However, the true maximum stress can be determined through non-linear analysis. According to the graph in Figure 3, the maximum stress is 1189.81 MPa. This value was also attempted to be achieved within the SolidWorks program. Under a load of 1850N, a value of 1011MPa was reached and accepted as the maximum stress.\r\n\r\n![ekran görüntüsü, multimedya yazılımı, yazılım, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/be6f13ef263b7b557f3753bdcc9c7dc3.png)\r\n\r\nFigure 13 Maximum Stress Trial\r\n\r\n## Fatigue Analysis\r\n\r\nFailure of mechanical components often occurs at stress levels below the **static yield strength** because of **cyclic loading**. Since the Toggle Clamp mechanism is subjected to thousands of openings and closing cycles throughout its operational life, it is essential to evaluate its structural integrity according to **Fatigue** criteria.\r\n\r\n### Analysis Methodology and Prerequisites\r\n\r\nTo perform a fatigue analysis within the **SolidWorks Simulation** environment, a **Linear Static Analysis** study defining the stress state of the system must first be completed. This static analysis serves as reference loading data for the fatigue study, and the stress values obtained here are scaled according to the defined load cycle.\r\n\r\n### Fatigue Analysis Data Input\r\n\r\nUsing the default data provided by SolidWorks is insufficient for performing fatigue analysis. Consequently, the values presented in Figure 4 (Section 3.1.3) must be input into the SolidWorks software manually.\r\n\r\n![metin, yazılım, bilgisayar, ekran görüntüsü içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/e5664cb38417353657c3e6f2fe03f478.png)\r\n\r\nFigure 15 Fatigue analysis data entry\r\n\r\nTo define this data, the stress-strain curve interface within SolidWorks must be accessed, and the specified values entered into the table.\r\n\r\n### Loading Strategy and S-N Curve Compliance\r\n\r\nTo obtain meaningful and observable results (to perform a **finite life** calculation) in fatigue analysis, the stress values induced in the material must remain within the limits of the **S-N Curve** (Stress vs. Number of Cycles) defined in the material library.\r\n\r\n**Target Stress Range:** The fatigue data defined for AISI 304 material ranges between approximately **150 MPa** (Endurance limit / Infinite life limit) and **360 MPa** (Low-cycle fatigue limit).\r\n\r\n**Applied Load:** The load applied in the static analysis was optimized to fall in the middle of this target range to observe a distinct fatigue life. By applying a load of approximately **500 N**, a maximum **Von Mises stress** level of **\\~230 MPa** was targeted on the material.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/98e21abe157435346b79ccecf2955789.png)\r\n\r\nFigure 16 Static analysis for fatigue analysis\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/d75d461caaa17ff9764d7aa4e0d9057c.png)\r\n\r\nFigure 17 Fatigue analysis\r\n\r\nThanks to this strategy, the region analyzed is one where the mechanism possesses neither infinite life (\"no damage\" result) nor suffers immediate static failure; instead, it offers a measurable \"**cycle life**\".\r\n\r\n### Model Improvement: Elimination of Stress Concentrations\r\n\r\nDuring analysis iterations, although the targeted stress values (\\~230 MPa) were reached, it was observed that \"**Infinite Life**\" was theoretically calculated for all parts in the initial results.\r\n\r\nUpon detailed examination, it was determined that the maximum stress values were concentrated pointwise (**stress concentration**) at the sharp corners and thread roots of the nuts used as fasteners, rather than on the main arms of the mechanism. This situation created a **numerical artifact**, masking the true fatigue damage on the mechanism's critical links.\r\n\r\nTo prevent this misleading situation and to analyze the stress distribution on the main components more accurately:\r\n\r\n-   The analysis model was **simplified**.\r\n-   Nuts, which do not play a critical role in load-bearing but cause **stress singularities**, were removed from the assembly.\r\n\r\nFollowing this geometric modification, repeated analyses verified that the stress distribution spread correctly to the mechanism's arms and that a meaningful life calculation could be performed.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, grafik yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/7fd2c8b6a70a52dc54eeaf629a2fc2a5.png)\r\n\r\nFigure 18 Excessive load on nuts\r\n\r\n# Results and Evaluation\r\n\r\nIn this study, the structural behavior of a **Toggle Clamp** mechanism manufactured from **AISI 304** stainless steel was comprehensively investigated using the **Finite Element Method (FEM)**. The obtained findings are evaluated under three main headings.\r\n\r\n## Comparison of Linear and Non-Linear Static Analysis Results\r\n\r\nThe analyses were performed under two different loading scenarios: **50 N (Nominal Load)** and **550 N (Overload)** to characterize the mechanism's behavior. The obtained **Von Mises** stress values were examined with reference to the material's **Yield Strength**.\r\n\r\n### Case 1: Elastic Region Behavior (50 N Loading)\r\n\r\nWhen a 50 N force is applied to the mechanism, the stresses occurring in the system remain within the material's elastic limits.\r\n\r\n**Linear Analysis Result:** 45 MPa.\r\n\r\n**Non-Linear Analysis Result:** 62 MPa.\r\n\r\n### Case 2: Plastic Region and Deviation from Hooke's Law (550 N Loading)\r\n\r\nWhen the loading force is increased to 550 N, a dramatic difference emerges between the analysis results. This situation is explained by the material's transition into the **plastic region**.\r\n\r\n**Linear Analysis Result:** 501 MPa.\r\n\r\n**Non-Linear Analysis Result:** 395 MPa.\r\n\r\n### Technical Evaluation and Relationship with Hooke's Law\r\n\r\nAs outlined in Section 3.1.2, Linear Static Analysis assumes that the cross-sectional area of the component remains constant in its initial state ($$A = A_{0}$$) throughout the computation. This assumption of a constant cross-section results in the mathematical neglect of the material's physical limitations. Specifically, because the cross-sectional area is treated as invariant, the analysis presumes that the proportionality defined by Hooke’s Law extends infinitely, regardless of the magnitude of the applied force. By virtue of this assumption, the analysis software resolves the calculation in a single mathematical step without engaging in complex iterative cycles, thereby yielding results quite rapidly.\r\n\r\nIn contrast, Non-Linear Static Analysis applies the load incrementally rather than in a single instance. At each load increment, the software evaluates the new cross-sectional area ($$A_{i n s t}$$) resulting from the component’s deformation and updates its current resistance based on the curve presented in **Figure 3: True Stress and True Strain for AISI 304 [1]**. If the material exceeds its yield limit, the program detects this geometric change and updates the stiffness matrix accordingly. This continuous cycle of control and correction (iterations) causes the analysis to require more computational time than linear analysis, but it accurately reflects physical reality.\r\n\r\nIn this study, the value of **501 MPa** calculated under a **550 N** load via Linear Analysis is physically misleading. Since linear analysis mathematically holds the cross-sectional area constant, it ignored the fact that the material surpassed its **206.8 MPa** yield limit and continued to extrapolate the stress linearly as if the material remained infinitely elastic.\r\n\r\nConversely, Non-Linear analysis, by accounting for the changing cross-sectional area, detected that the material had reached its yield stress and subsequently underwent \"yielding\" and plasticization. Upon entering the plastic region, the excess load is dissipated through deformation, causing the rate of stress to decelerate. Consequently, the obtained value of **395 MPa** is the correct value that accounts for the material's yielding behavior and represents the reality encountered in physical applications.\r\n\r\nThis comparison demonstrates that in high-loading scenarios where material limits are challenged, the results provided by Linear analysis are merely virtual mathematical artifacts, and Non-Linear analysis is a prerequisite for a reliable design.\r\n\r\n![metin, yazı tipi, ekran görüntüsü, çizgi içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/toggle-clamp-analizi/8944ea8783095a2840a05b3df21971f7.png)\r\n\r\nFigure 19 The difference between linear and non-linear analysis is shown graphically.\r\n\r\n## Fatigue Life and Model Improvement\r\n\r\nIn the fatigue analyses conducted to determine the mechanism's behavior under repetitive loads, characteristic regions of the AISI 304 material's **S-N (Wöhler) curve** were targeted.\r\n\r\n-   **Analysis Strategy:** Since stresses that appear safe in static analysis can lead to failure under dynamic loading, the analyses were carried out under a 500 N load, corresponding to the \"**finite life**\" region of the S-N curve.\r\n-   **Geometric Modification (Defeaturing):** In the initial analyses, **stress singularities** occurring at the sharp corners of non-load-bearing nuts incorrectly dominated the life of the entire system. To improve the accuracy of the analysis, these elements were removed from the model, and in the repeated simulation, it was observed that the stress was distributed realistically to the mechanism's arms.\r\n-   **Life Prediction:** As a result of the analysis performed on the improved model, it was predicted that fatigue failure could initiate at the mechanism's critical connection points after a certain number of cycles. This data serves as a reference for determining **periodic maintenance intervals**.\r\n\r\n## General Conclusion\r\n\r\nThe Toggle Clamp mechanism used in this report was redrawn and **geometrically simplified** to ensure that analysis operations could be performed faster and more smoothly. Due to the removal of certain details (fillets, nuts, etc.) from the model, the obtained analysis results may not exactly reflect the behavior of the real-world product.\r\n\r\nHowever, the **primary objective** of this study is not to perform a flawless product simulation, but to learn and compare **engineering analysis methods**.\r\n\r\nThrough this study, the following **key findings** were obtained:\r\n\r\n-   **Difference Between Linear and Non-Linear Analysis:** It was observed that while both methods operate similarly in the **elastic region**, Linear analysis remains **insufficient** in cases where the material exceeds the yield limit (**plastic region**).\r\n-   **Importance of Fatigue Analysis:** The necessity of performing life calculations under **cyclic loads** for a component that appears structurally sound statically was understood.\r\n\r\nIn summary; with this report, the working logic of **Linear**, **Non-Linear**, and **Fatigue** analyses and the fundamental differences between them have been successfully demonstrated.\r\n\r\n# References\r\n\r\n| [1]  | 2. &. Y. X. &. A. A. E.-A. &. S.-H. Z. &. K. B. N. &. J.-M. L. Liang-Liang Xia1, \"Deformation characteristics in hydro-mechanical forming process of thin-walled hollow component with large deformation: experimentation and finite element modeling,\" p. 4708, 22 March 2019.  |\r\n|------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\r\n| [2]  | Q. P. N. T. a. L. L. F. Cui, \"Enhanced high-cycle fatigue resistance of 304 austenitic stainless steel with nanotwinned grains,\" p. 4, 2021.                                                                                                                                     |\r\n"
        }
    },
    {
        "id": 1,
        "title": "Millerin Teknik Resminin Hazırlanması",
        "date": "2025-09-26",
        "category": "Projects",
        "desc": "bla bla bla",
        "image": "/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/Gemini_Generated_Image_fab7c5fab7c5fab7.png",
        "link": "article.html?id=1",
        "content": "# Giriş ve Temel Kavramlar\r\n\r\n## Teknik Resmin Tanımı ve Önemi\r\n\r\nTeknik resim, bir makine parçasının, sistemin veya yapının tüm geometrik ve fonksiyonel özelliklerini, standartlaştırılmış kurallar, semboller ve gösterimler bütünü kullanarak iki boyutlu bir düzlemde ifade etme yöntemidir. Esasen, mühendisler, teknikerler ve imalatçılar arasında konuşulan evrensel ve hassas bir dildir. Bu dil, fikir ve tasarım aşamasındaki soyut bir konsepti, somut, üretilebilir ve denetlenebilir bir ürüne dönüştüren temel köprü görevini üstlenir.\r\n\r\n**Teknik resmin önemi şu temel fonksiyonlarda yatar:**\r\n\r\n**İletişim:** Tasarımcının zihnindeki tüm detayları (boyutlar, toleranslar, malzeme, yüzey kalitesi vb.) imalatı yapacak kişiye eksiksiz ve hatasız bir şekilde aktarır. Yorumlamaya ve belirsizliğe yer bırakmaz.\r\n\r\n**İmalat:** Üretim sürecinin yol haritasıdır. Parçanın hangi operasyonlardan (tornalama, frezeleme, taşlama, delme vb.) geçeceğini, hangi hassasiyette işleneceğini ve hangi ölçülere sahip olacağını tanımlar.\r\n\r\n**Kalite Kontrol ve Muayene:** Üretilen parçanın, tasarım gereksinimlerini karşılayıp karşılamadığını doğrulamak için kullanılan referans belgedir. Ölçüm ve kontrol operasyonları teknik resimdeki değerlere göre yapılır.\r\n\r\n**Standardizasyon ve Değiştirilebilirlik:** Teknik resim standartları (ISO, ANSI, DIN vb.) sayesinde, dünyanın farklı yerlerinde üretilen parçaların bile birbiriyle uyumlu bir şekilde montajlanabilmesi sağlanır.\r\n\r\n**Dokümantasyon:** Tasarımın kalıcı bir kaydıdır. Revizyon yönetimi, bakım ve gelecekteki tasarım iyileştirmeleri için temel bir arşiv belgesi niteliğindedir.\r\n\r\n## Miller İçin Teknik Resmin Özel Kuralları ve Önemi\r\n\r\nMiller, dönme hareketi yaparak güç ve moment ileten, üzerlerinde dişli, kasnak, yatak (rulman), kavrama gibi makine elemanlarını taşıyan temel makine elemanlarıdır. Bu fonksiyonel çeşitlilikleri, teknik resimlerinin hazırlanmasında genel makine parçalarından daha özel ve kritik kuralların uygulanmasını gerektirir. Üzerine montajlanacak her bir eleman için ayrı detaylar kurallar vardır ve bunların teknik resimlerde gösterilmesinin de ayrıca kuralları vardır. Bu sebeplerden dolayı bu raporda her bir eleman üzerinde durulacaktır. Ayrıca raporda mil resmi örneklerine yer verilecektir. Bu örnekler genellikle SolidWorks programı ile çizilmiştir. Solidworks programında bazı detayları verilecektir.\r\n\r\n# Genel Kurallar\r\n\r\nÖncelikle millerin teknik resmindeki temel kuralları ele alalım. Bazı önemli kuralların en başta belirtilmesi gerekiyor. Bu kurallar daha çok millere özel kurallardır.\r\n\r\n-   Miller, fonksiyonel ve imalat pozisyonları gereği, daima ana eksenleri çizim düzlemine paralel olacak şekilde tek bir ana görünüş (genellikle ön görünüş) ile ifade edilir. Bu görünüş, milin tüm boy ölçülerini ve kademe çaplarını göstermek için yeterlidir.\r\n\r\n    **Kesit Alma İstisnası:** Genel bir kural olarak, ISO standartlarına göre dolu ve dönel simetriye sahip parçalar (miller, pimler, cıvatalar vb.) montaj resimlerinde, eksenleri kesit düzlemine paralel olduğunda tam kesite alınmazlar. Bunun sebebi, tam kesitin parçanın geometrisi hakkında ek bir bilgi vermemesi ve resmi karmaşıklaştırmasıdır.\r\n\r\n    Ancak, milin kendi imalat resminde (detay resmi), iç detayların (kama kanalları, enine delikler, segman kanalları vb.) ölçülendirilmesi ve net bir şekilde gösterilmesi için kısmi kesit veya döndürülmüş kesit alınması yaygın ve doğru bir uygulamadır. Bu, \"görünmeyen kenarlara ölçü verilmez\" kuralına uymak için de bir gerekliliktir.\r\n\r\n    **Örnek:** Bir kama kanalının derinliğini ve formunu göstermek için sadece o bölgeye ait yerel bir kesit alınır.\r\n\r\n-   Milin tüm uzunluğu boyunca, parçanın geometrik merkezini ve dönme eksenini tanımlayan bir eksen çizgisi (ISO 128 - Çizgi Tipi E: İnce, uzun kesik noktalı çizgi) mutlaka çizilmelidir. Bu çizgi, parçanın her iki ucundan da bir miktar (genellikle 3-5 mm) taşmalıdır.\r\n\r\n    Mühendislik Gerekçesi: Eksen çizgisi sadece parçanın dairesel olduğunu belirtmekle kalmaz, aynı zamanda çok daha kritik bir rol oynar:\r\n\r\n    **Datum Referansı:** Bu eksen, milin birincil datumudur. Tüm geometrik toleranslar (GD&T) – özellikle salgı, eş merkezlilik ve silindiriklik – bu referans eksenine göre tanımlanır. Bu sayede, farklı kademelerin birbirine göre ne kadar hassas bir şekilde aynı eksende olması gerektiği garanti altına alınır.\r\n\r\n-   **Çapların ve Uzunlukların Ölçülendirilmesi:** Mil üzerindeki her bir silindirik kademenin çapı \"Ø\" sembolü kullanılarak ve boyu mutlaka ölçülendirilmelidir. Ayrıca, milin toplam boyu da referans veya bağlama ölçüsü olarak verilmelidir.\r\n\r\n    **Referans Yüzeyinden Ölçülendirme:** Fonksiyonel açıdan en kritik olan yüzey (örneğin bir rulmanın dayanacağı alın yüzeyi) referans (datum) olarak seçilmeli ve mümkün olduğunca çok boyutsal ölçü bu yüzeyden verilmelidir.\r\n\r\n    **Mühendislik Gerekçesi:** Zincirleme ölçülendirme (chain dimensioning), her ölçüdeki toleransın bir sonrakine eklenmesine neden olarak tolerans yığılmasına (tolerance accumulation) yol açar. Bu durum, kritik kademeler arasındaki mesafenin kabul edilebilir limitlerin dışına çıkmasına neden olabilir. Referans yüzeyinden ölçülendirme ise her kademenin pozisyonunu doğrudan ana referansa göre kontrol ederek bu hatayı minimize eder ve parçanın montajdaki uyumunu garanti eder.\r\n\r\n-   **Görünmeyen Kenarlara Ölçü Verilmemesi:** Standart teknik resim kuralları gereği, kesik çizgilerle (görünmeyen kenarlar) gösterilen unsurlara doğrudan ölçü verilmesinden kesinlikle kaçınılmalıdır. Bu, okuma hatalarına ve yanlış yorumlamalara yol açar. Bunun yerine, ilgili unsur kısmi kesit veya detay görünüş ile görünür hale getirilmeli ve ölçülendirme bu görünüş üzerinde yapılmalıdır.\r\n\r\n# Millere Montajlanan Parçalar ve Teknik Resimlerde Gösterilmesi\r\n\r\n## Kama Kanalı\r\n\r\n![Atalay Endüstriyel \\| Düz Kamalar DIN 6885 10x8](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/b9b0fcc5a584652bcef277daf0ae3df1.jpeg)\r\n\r\nBiçim 3.1 Prizmatik Kama resmi\r\n\r\n### Kamanın Tanımı ve İşlevi\r\n\r\nMakine elemanları arasında güç ve hareket iletiminde en temel ve yaygın olarak kullanılan parçalardan biri kamadır. Kama, dönme hareketi yapan bir mil ile bu milin üzerine takılan dişli, kasnak, volan veya kaplin gibi bir makine elemanı arasında tork (dönme momenti) aktarımını sağlamak amacıyla kullanılan bir sökülebilir bağlantı elemanıdır.\r\n\r\nKamalar, tasarımda keyfi ölçülere göre değil, belirli mühendislik standartlarına göre imal edilir ve seçilirler. Uluslararası alanda **DIN 6885** ve Türkiye'de **TS 147** serisi standartlar, kamaların boyutlarını, toleranslarını ve malzemelerini tanımlayan en temel standartlardır. Tasarım sürecinde, mil çapına bağlı olarak bu standart tablolardan uygun kama ölçüsü seçilir. Bu standardizasyon hem imalat kolaylığı hem de parçalar arasında değiştirilebilirlik ilkesini garanti altına alır.\r\n\r\nKamanın temel işlevi, mil ile göbeğin (örneğin dişlinin) birbirine göre izafi olarak dönmesini engelleyerek torku iletmektir. Bu bağlantıyı oluşturmak için iki ayrı parça üzerine, birbirinden bağımsız olarak iki adet kama kanalı işlenir:\r\n\r\n-   **Mil Kama Kanalı (Shaft Keyway/Keyseat):** Milin dış silindirik yüzeyi üzerine açılan yuvadır.\r\n-   **Göbek Kama Kanalı (Hub Keyway):** Dişli, kasnak gibi elemanların iç delik yüzeyine açılan yuvadır.\r\n\r\nKama, montaj sırasında bu iki ayrı kanala aynı anda oturarak mil ile göbeği birbirine kilitler. Tıpkı kamaların kendisi gibi, bu iki farklı kama kanalının da (hem mil hem de göbek için) genişlik, derinlik ve toleransları ilgili standartlar tarafından net bir şekilde belirlenmiştir. Dolayısıyla, standart bir kama seçildiğinde, ona karşılık gelen mil kama kanalı ve göbek kama kanalı ölçüleri de otomatik olarak standart tablolardan alınır. Tork, kamanın yan yüzeyleri aracılığıyla milden göbeğe (veya tersi yönde) iletilir.\r\n\r\n### Kama Çeşitleri\r\n\r\nKamalar, kullanım amaçlarına, montaj şekillerine ve taşıdıkları yükün karakteristiğine göre farklı geometrilerde tasarlanmıştır. Endüstride sıkça karşılaşılan temel kama tipleri şunlardır:\r\n\r\n-   **Prizmatik Kamalar (Parallel Keys / Feather Keys):** En yaygın kullanılan kama tipidir. Kesiti dikdörtgen veya kare şeklinde olup, üst ve alt yüzeyleri birbirine paraleldir. Torku yan yüzeyleriyle iletirler. Eksenel harekete izin veren kayıcı tipleri (Feather Key) de mevcuttur.\r\n-   **Eğik Kamalar (Tapered Keys):** Üst yüzeyinde belirli bir eğime (genellikle 1/100) sahip olan kamalardır. Bu eğim sayesinde montaj sırasında mile ve göbeğe sıkıca oturarak hem tork iletimi sağlarlar hem de eksenel yönde bir miktar sabitleme yaparlar.\r\n-   **Yarım Ay Kamalar (Woodruff Keys):** Yarım daire kesitli bu kamalar, kendi eksenleri etrafında bir miktar dönebildikleri için özellikle konik mil uçlarında hizalama kolaylığı sağlarlar. Montajları için mile derin bir yuva açılması gerektiğinden, milin mukavemetini prizmatik kamalara göre daha fazla düşürürler.\r\n-   **Teğetsel Kamalar (Tangential Keys):** Çok büyük ve darbeli torkların iletiminde kullanılan, iki adet eğik kamanın bir araya gelmesiyle oluşan özel bir kama türüdür.\r\n\r\nBu rapor kapsamında, en temel ve standart kama tipi olan prizmatik kamanın teknik resimdeki gösterimi ve ölçülendirme detayları üzerinde durulacaktır. Diğer kama tipleri, farklı montaj ve fonksiyonel gereksinimler için mevcut olsalar da bu çalışmanın odak noktası prizmatik kama kanalının teknik resminin incelenmesidir.\r\n\r\n### Prizmatik A Tipi Kama Kanalı Teknik Resmi\r\n\r\n![silindir, tasarım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/a0a6f52baeb79b0f61717c0ace6dbd6f.png)\r\n\r\nBiçim 3.2 Kama kanalı.\r\n\r\nBiçim 3.2’de mil üzerinde açılmış bir kama kanalı gösterilmiştir. Kama standartlara uygun olarak çap 18-22 mm arası olan ölçülerde seçilmiştir. Yani kamanın genişliği ve yüksekliği 6 mm uzunluğu ise 16 mm’dir.\r\n\r\n![metin, diyagram, teknik çizim, paralel içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/f8938c1e52381fffcfe9bbf4219c454e.png)\r\n\r\nBiçim 3.3 Mil kama kanalı teknik resmi.\r\n\r\nMil üzerinde kama kanalının teknik resmi Biçim 3.3’ de verilmiştir. Mil resmi üzerinden sadece uzunluk ölçüsü verilmiş ardından da kama kanalı üzerinden kesit görünümü alınmıştır. Yükseklik ve genişlik ölçüleri kama kesit görünüş üzerine verilmiştir. Yükseklik ve genişlik ölçülerinin toleransları kama kanalı standartlarına uygun olarak uzunluk ölçüsünün toleransı ise **DIN 6885** toleranslarına göre verilmiştir.\r\n\r\nKAMA KANALI UZUNLUK ÖLÇÜSÜ +0,1 -0\r\n\r\n![metin, diyagram, paralel, çizgi içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/5e92e6a88024cc6550c6b5544fa6f2d3.png)\r\n\r\nBiçim 3.4 Delik kama kanalı teknik resmi.\r\n\r\nDeliklerin kama kanalı teknik resmi de millerinkinden pek farklı değildir. Toleranslar aynı biçimde verilir. Duruma göre dikey kesit alınabilir.\r\n\r\n## Segman\r\n\r\n![daire içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/a3655a3590f68519439fdf32f9379469.jpeg)\r\n\r\nBiçim 3.5 Segman örneği.\r\n\r\n### Segmanın Tanımı, Standartları ve İşlevi\r\n\r\nSegman (İngilizce: Circlip veya Retaining Ring), makine elemanlarını (örneğin rulmanlar, dişliler, burçlar) bir mil üzerinde veya bir delik (yuva) içerisinde eksenel olarak, yani mil ekseni boyunca kaymalarını önleyerek konumlandırmak ve sabitlemek için kullanılan, yay çeliğinden imal edilmiş, yarım daire formunda bir tespit elemanıdır.\r\n\r\nSegmanların temel işlevi, üzerine takıldıkları parçalar için bir \"yapay omuz\" (artificial shoulder) oluşturmaktır. Bu sayede, mile veya yuvaya bir fatura (shoulder) işlenmesine gerek kalmadan, daha ekonomik ve basit bir tasarımla parçaların eksenel hareketi sınırlandırılmış olur.\r\n\r\nSegmanlar, tıpkı kamalar gibi, belirli uluslararası standartlara göre üretilir ve seçilir. En yaygın kullanılan segman standartları DIN 471 (dış segmanlar için) ve DIN 472 (iç segmanlar için) standartlarıdır. Bu standartlar, segmanın tüm geometrik ölçülerini, malzeme özelliklerini ve takılacağı kanalın (yuvanın) ölçülerini tanımlar. Tasarım yapılırken, mil çapına veya delik çapına göre bu standart tablolardan uygun segman ve segman kanalı ölçüleri seçilir. Bu standardizasyon, imalat ve montaj süreçlerini büyük ölçüde kolaylaştırır.\r\n\r\nSegman standartları ve toleransları için şu web sitesine bakılabilir:\r\n\r\n<http://erbekrulman.com.tr/segman_emniyet_sekmanlari_din_471-sayfa_id-333-id-54476>\r\n\r\n### Segman Çeşitleri\r\n\r\nSegmanlar, montaj edildikleri yere göre temel olarak iki ana tipe ayrılır:\r\n\r\n-   **Dış Segmanlar (External Circlips - DIN 471):** Millerin üzerine takılmak üzere tasarlanmışlardır. Bir milin dış çevresine açılan \"segman kanalı\" adı verilen sığ bir yuvaya yerleştirilirler. Montajları ve demontajları, uçlarındaki deliklere özel bir segman pensesi takılarak segmanın dışa doğru esnetilmesiyle (açılmasıyla) gerçekleştirilir. Mil üzerine takılan bir rulmanın dışarı doğru kaymasını önlemek, dış segman için tipik bir kullanım alanıdır.\r\n-   **İç Segmanlar (Internal Circlips - DIN 472):** Deliklerin veya yuvaların (örneğin bir makine gövdesi veya bir dişli göbeği) iç yüzeyine takılmak üzere tasarlanmışlardır. Deliğin iç çevresine açılan segman kanalına yerleştirilirler. Montaj ve demontaj işlemleri, özel bir segman pensesiyle uçlarındaki deliklerden içe doğru sıkıştırılarak (kapatılarak) yapılır. Bir yuvaya yerleştirilmiş rulmanın yerinden çıkmasını engellemek, iç segman için yaygın bir örnektir.\r\n\r\nHer iki segman tipi için de bağlantının güvenilir olması, segmanın oturduğu segman kanalının ölçülerinin ve toleranslarının standartlara tam olarak uygun olmasına bağlıdır. Kanal genişliğinin veya derinliğinin yanlış olması, segmanın görevini tam olarak yerine getirememesine veya çalışma sırasında yerinden çıkmasına neden olabilir. Bu nedenle, teknik resimde segman kanallarının standartlara uygun şekilde gösterilmesi ve ölçülendirilmesi kritik bir öneme sahiptir.\r\n\r\n### İç Segman Teknik Resmi\r\n\r\n![daire, gümüş, tasarım, tekerlek içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/7f750b7fdbf14066b466e7ba067bc4ac.png)\r\n\r\nBiçim 3.6 İç segman kanalı 3d örnek.\r\n\r\n![metin, diyagram, taslak, çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/d2a8024e271cec45fd33749e52fd2844.png)\r\n\r\nBiçim 3.7 İç segman kanalı teknik resim örnek.\r\n\r\nBiçim 3.7’de iç segman kanalının teknik resim örneği verilmiştir. Delik için segman kanalı ölçüsü gösterilirken kesit alınabilir. Segman kanalının çapı gösterilir. Burada en önemli nokta segman kanalının parçanın neresinde olduğunu göstermektir. Bu ölçü rastgele bir yerden verilemez. Segman ne için kullanılacaksa, segmanın sabit tutacağı parçanın diğer tarafından ölçü verilir. Bu ölçü verilirken de segman kanalının arada kalan parçaya göre dış kısımda kalan duvarından ölçü verilir. Burada tasarımda dikkat edilmesi gerekilen bir nokta vardır. Segman kanalının ölçüsü şu formül ile verilir:\r\n\r\n$$\r\nS e g m a n \\  K a n a l \\imath n \\imath n \\  U z u n l u k \\  Ö l ç ü s ü = S e g m a n \\imath n \\  s a b i t l e y e c e ğ i \\  p a r ç a n \\imath n \\  u z u n l u ğ u + s e g m a n \\  k a l \\imath n l \\imath ğ \\imath\r\n$$\r\n\r\nYani segmanın sabitleyeceği parçanın ölçüsünün 23 mm olduğunu varsayalım. Segman kanalı kalınlığı ise 40 için 1,85 mm’dir. Segman kalınlığı ise yine 40 için 1,75 mm’dir. Segman kanalının dışta kalan duvarından ölçü verirken segman kanalının kalınlığı kadar değil de segman kalınlığı kadar ölçü verilir. Yani toplam ölçü $$2 3 + 1 , 7 5 = 2 4 , 7 5$$ olur. Segmanın istenilen parçayı sıkıştırabilmesi için bu ölçü verilir. Bu ölçü doğru verilmediği taktirde arada kalan 0,1 mm sıkıştırılması istenen parçayı yeteri kadar sıkıştırmayabilir. Hem çap hem de kalınlık ölçüleri için standartlara uygun toleranslar verilir.\r\n\r\n### Dış Segman Teknik Resmi\r\n\r\n![silindir, tasarım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/9d3c83198765f55fdef2d4eeccacb64d.png)\r\n\r\nBiçim 3.8 Dış segman kanalı 3d örnek.\r\n\r\n![metin, diyagram, paralel, plan içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/283e295056ed258172bb564beb388112.png)\r\n\r\nBiçim 3.9 Dış segman kanalı teknik resim örnek.\r\n\r\nBiçim 3.9’ da Dış segman kanalı teknik resim örneği verilmiştir. İç segmandaki kurallar burada da geçerlidir. Dış çap ölçüsü verilir. Burada en önemli nokta aynı iç segman kanalında olduğu gibi segman kanalının parçanın neresinde olduğunu göstermektir. Bu ölçü rastgele bir yerden verilemez. Segman ne için kullanılacaksa, segmanın sabit tutacağı parçanın diğer tarafından ölçü verilir. Bu ölçü verilirken de segman kanalının arada kalan parçaya göre dış kısımda kalan duvarından ölçü verilir. Bu ölçünün hesaplanması İç Segman Teknik Resmi bölümünde anlatılmıştır. Hem çap hem de kalınlık ölçüleri için standartlara uygun toleranslar verilir.\r\n\r\n# Alından Cıvata\r\n\r\nBazı millerde montaj için alından cıvata deliği açmak gerekebilir. Böyle bir durumda da millerin teknik resimlerinde ayrıntılar vardır.\r\n\r\n![ekran görüntüsü, silindir, tasarım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/29d9c3650adaf82851b2e6b8b844dfc5.png)\r\n\r\nBiçim 4.1 Alından cıvata deliği 3d örnek.\r\n\r\n![metin, diyagram, ekran görüntüsü, paralel içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/a0f22ca4f81bd50302915eee0fef1120.png)\r\n\r\nBiçim 4.2 Alından cıvata deliği teknik resim örnek.\r\n\r\nAlından cıvata deliğini teknik resimde gösterebilmek için kısmi kesit alınmalıdır. Kısmi kesitin boyutu fazla büyütülmemeli sadece cıvata deliğini gösterecek kadar olmalıdır. Kısmi kesit aldıktan sonra cıvatanın metrik vs. ölçüsü, diş boyu ve toplam boyu gösterilmelidir.\r\n\r\nMil çapı ölçüsü için doğru cıvata deliği açmanın da kuralları vardır. Önce cıvata metrik kaç olacağı seçilir. Bunun için mukavemet hesabı yapmak gereklidir. Mile gelecek eksenel ya da radyal yükler hesaplanır. Metrik seçildikten sonra cıvata deliği boyu seçilmelidir. Cıvata deliği boyunun standartları vardır ancak bazı durumlarda delik boyu uzun gelirse uygun biçimde standartların dışına çıkılabilir.\r\n\r\nBazı durumlarda milin torna tezgahına bağlanabilmesi için punta deliği açmak gereklidir. Punta deliği de cıvata deliği gibi kısmi kesit alınarak gösterilir.\r\n\r\n# Diş açma\r\n\r\nMillerde yaygın uygulamalardan birisi diş açmadır. Milin dış yüzeyine diş çekilir ve bu sayede çeşitli montaj imkanları edinilmiş olunur. Cıvatalar da aslında dışlarına diş çelikmiş millerdir.\r\n\r\n![](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/b42be3ee0257cedf8f1dd2848b8bd07f.png)\r\n\r\nBiçim 5.1 M20 diş açma 3d şematik görünüm.\r\n\r\n![metin, diyagram, paralel, dikdörtgen içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/b01a18c3517d123784d9637081fe3de6.png)\r\n\r\nBiçim 5.2 M20 diş açma teknik resim görünüm.\r\n\r\nTeknik resimde diş açmayı göstermek için önden görünüş yeterlidir. Metrik kaç olduğu ve diş uzunluğu ölçüleri verilmesi yeterlidir.\r\n\r\n# Dip boşaltma\r\n\r\n## Tanım ve Terminoloji\r\n\r\nDip boşaltma, teknik literatürde rahatlatma kanalı, feder yatağı veya uluslararası terminolojide \"Relief Groove\" / \"Undercut\" olarak da bilinen, bir mil üzerinde farklı çaplara sahip iki silindirik yüzeyin birleştiği fatura dibine (kesit değişimi köşesine) hassas bir şekilde işlenen geometrik bir kanaldır. Bu kanal, basit bir oluktan ziyade, birden çok mühendislik amacına hizmet eden kritik bir tasarım unsurudur.\r\n\r\nBu kanalların form ve boyutları genellikle **DIN 509** ya da **ISO 18388** gibi uluslararası standartlar ile tanımlanır. Standartlar, kanalın derinliği, genişliği ve radyusu gibi kritik ölçüleri mil çapı ve fatura yüksekliğine bağlı olarak belirler.\r\n\r\n## Dip Boşaltma Kanallarının Mühendislik Amaçları\r\n\r\nDip boşaltma kanallarının tasarıma dahil edilmesinin üç temel mühendislik sebebi bulunmaktadır:\r\n\r\n### Montaj Hassasiyetinin ve Yüzey Temasının Sağlanması\r\n\r\nBir mil üzerine rulman, dişli, conta veya başka bir makine elemanı monte edildiğinde, bu elemanın mil üzerindeki faturanın dikey yüzeyine tam olarak yaslanması (oturması) istenir. Ancak, tornalama gibi talaşlı imalat operasyonları doğası gereği fatura dibinde belirli bir köşe radyusu (fillet radius) bırakır. Monte edilecek parçanın iç köşe geometrisi ise genellikle keskin veya çok daha küçük bir radyus sahiptir.\r\n\r\nBu durumda dip boşaltma kanalı, imalattan kaynaklanan bu köşe radyusunu ortadan kaldıracak bir boşluk oluşturur. Bu sayede, monte edilen parçanın köşesi bu kanala denk gelir ve parçanın düzlemsel yüzeyi, faturanın dikey yüzeyine tam ve boşluksuz bir temas sağlar. Bu tam temas;\r\n\r\n-   Yükün düzgün bir şekilde aktarılmasını,\r\n-   Eksenel hizalanmanın ve konumlandırmanın hassas bir şekilde yapılmasını,\r\n-   Bileşenlerin öngörülen çalışma pozisyonunda olmasını garanti eder.\r\n\r\n### İmalat Süreçlerinin Kolaylaştırılması (Taşlama Taşı Çıkış Boşluğu)\r\n\r\nMillerin yataklama veya sızdırmazlık bölgeleri gibi hassas yüzeyleri genellikle taşlama (grinding) operasyonu ile son ölçülerine ve yüzey pürüzlülüğü değerlerine getirilir. Taşlama taşlarının kenarları, kırılganlığı azaltmak için her zaman belirli bir radyüse sahiptir ve bu nedenle dik bir faturanın dibine kadar sıfır yanaşarak taşlama yapamazlar.\r\n\r\nDip boşaltma kanalı, bu durumda taşlama taşı için bir çıkış boşluğu (grinding runout) görevi görür. Taş, silindirik yüzeyin sonuna geldiğinde bu boşluğa dalarak operasyonu tamamlar. Bu işlem;\r\n\r\n-   Taşlama taşının faturaya çarpmasını ve hasar görmesini engeller.\r\n-   Mil yüzeyinin fatura dibine kadar tam ve homojen bir şekilde taşlanabilmesini mümkün kılar.\r\n-   İstenen çap ve yüzey kalitesinin milin tüm çalışma yüzeyi boyunca elde edilmesini sağlar.\r\n\r\n### Gerilim Yığılmasının Kontrol Altına Alınması (Stress Relief)\r\n\r\nMillerde çapların değiştiği fatura dipleri, ani kesit daralması nedeniyle gerilim yığılması (stress concentration) için en kritik bölgelerdir. Özellikle değişken ve döngüsel yüklere maruz kalan miller, bu bölgelerden başlayan yorulma çatlakları (fatigue cracks) nedeniyle hasara uğrayabilirler.\r\n\r\nStandart bir köşe radyüsü gerilim yığılmasını bir miktar azaltsa da, özel olarak tasarlanmış bir dip boşaltma kanalı, gerilim akış çizgileri için çok daha pürüzsüz bir geçiş yolu sunar. Kanalın optimize edilmiş geometrisi (özellikle daha geniş bir dip radyüsü), gerilim yığılma faktörünü (Kt) önemli ölçüde düşürür. Bu sayede, parçanın dinamik yüklere karşı dayanımı ve yorulma ömrü artırılır.\r\n\r\n## Sonuç\r\n\r\nSonuç olarak, miller üzerindeki dip boşaltma kanalları; montaj doğruluğunu garanti eden, imalat operasyonlarını (özellikle taşlamayı) mümkün kılan ve parçanın yorulma ömrünü artırarak mekanik güvenilirliği sağlayan çok fonksiyonlu ve kritik tasarım unsurlarıdır. Tasarım aşamasında bu kanalların boyutlarının ve formunun, parçanın maruz kalacağı yüklere ve montaj gereksinimlerine göre ilgili standartlar (örn. DIN 509) dikkate alınarak seçilmesi büyük önem arz etmektedir.\r\n\r\n## Teknik Resim Örnek\r\n\r\n![silindir, levye, tasarım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/b47509f1595d4bcd9b335a4da14ce043.png)\r\n\r\nBiçim 6.1 Dip boşaltma 3d örnek.\r\n\r\n![metin, diyagram, teknik çizim, plan içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/179330463329042731a0ceea0b8bb58e.png)\r\n\r\nBiçim 6.2 Dip boşaltma teknik resim örnek.\r\n\r\nBiçim 6.2’ de dip boşaltma teknik resim örneği verilmiştir. Dip boşaltma göstermek için ön görünüşten bakmak yeterlidir. Ancak dip boşaltma çoğu zaman çok küçük olduğu için parçanın normal boyutlarında göstermek zor olabilir. Bunun için örnekte de göründüğü gibi detay görünüm alınabilir.\r\n\r\n# Toleranslar\r\n\r\nNerede hangi tolerans kullanılmalı?\r\n\r\n![](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/15f9875817b8a8fd88453000fd48c390.png)\r\n\r\n# Örnekler\r\n\r\n![metin, diyagram, taslak, çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/5449db095f7c5379d0a8c11981cb3bed.jpeg)\r\n\r\nBiçim 8.1 Örnek1\r\n\r\n![metin, diyagram, plan, teknik çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/fdf285c19472e80042645884701aea88.jpeg)\r\n\r\nBiçim 8.2 Örnek 2\r\n\r\n![metin, diyagram, teknik çizim, plan içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/358d0a979c609cc78e377243cd842371.jpeg)\r\n\r\nBiçim 8.3 Örnek 3\r\n\r\n![taslak, diyagram, metin, teknik çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/61363d2337f8056fc37fa3ebe057e35e.jpeg)\r\n\r\nBiçim 8.4 Örnek 4\r\n\r\n![metin, diyagram, çizim, taslak içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/794eda96f15979d47f55da0a6d92ba13.jpeg)\r\n\r\nBiçim 8.5 Örnek 5\r\n\r\n![diyagram, metin, taslak, çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/e4f1383c38e5311810ecc4564a1dd450.jpeg)\r\n\r\nBiçim 8.6 Örnek 6\r\n\r\n![](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/2d2ec2aabe781355226c76edc1962a63.jpeg)\r\n\r\nBiçim 8.7 Örnek 7\r\n\r\n![diyagram, taslak, teknik çizim, plan içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/7789a41fb09e1d6ad1cd54f9b4662d82.png)\r\n\r\nBiçim 8.8 Örnek 8\r\n",
        "tr": {
            "title": "Millerin Teknik Resminin Hazırlanması",
            "desc": "bla bla bla",
            "content": "# Giriş ve Temel Kavramlar\r\n\r\n## Teknik Resmin Tanımı ve Önemi\r\n\r\nTeknik resim, bir makine parçasının, sistemin veya yapının tüm geometrik ve fonksiyonel özelliklerini, standartlaştırılmış kurallar, semboller ve gösterimler bütünü kullanarak iki boyutlu bir düzlemde ifade etme yöntemidir. Esasen, mühendisler, teknikerler ve imalatçılar arasında konuşulan evrensel ve hassas bir dildir. Bu dil, fikir ve tasarım aşamasındaki soyut bir konsepti, somut, üretilebilir ve denetlenebilir bir ürüne dönüştüren temel köprü görevini üstlenir.\r\n\r\n**Teknik resmin önemi şu temel fonksiyonlarda yatar:**\r\n\r\n**İletişim:** Tasarımcının zihnindeki tüm detayları (boyutlar, toleranslar, malzeme, yüzey kalitesi vb.) imalatı yapacak kişiye eksiksiz ve hatasız bir şekilde aktarır. Yorumlamaya ve belirsizliğe yer bırakmaz.\r\n\r\n**İmalat:** Üretim sürecinin yol haritasıdır. Parçanın hangi operasyonlardan (tornalama, frezeleme, taşlama, delme vb.) geçeceğini, hangi hassasiyette işleneceğini ve hangi ölçülere sahip olacağını tanımlar.\r\n\r\n**Kalite Kontrol ve Muayene:** Üretilen parçanın, tasarım gereksinimlerini karşılayıp karşılamadığını doğrulamak için kullanılan referans belgedir. Ölçüm ve kontrol operasyonları teknik resimdeki değerlere göre yapılır.\r\n\r\n**Standardizasyon ve Değiştirilebilirlik:** Teknik resim standartları (ISO, ANSI, DIN vb.) sayesinde, dünyanın farklı yerlerinde üretilen parçaların bile birbiriyle uyumlu bir şekilde montajlanabilmesi sağlanır.\r\n\r\n**Dokümantasyon:** Tasarımın kalıcı bir kaydıdır. Revizyon yönetimi, bakım ve gelecekteki tasarım iyileştirmeleri için temel bir arşiv belgesi niteliğindedir.\r\n\r\n## Miller İçin Teknik Resmin Özel Kuralları ve Önemi\r\n\r\nMiller, dönme hareketi yaparak güç ve moment ileten, üzerlerinde dişli, kasnak, yatak (rulman), kavrama gibi makine elemanlarını taşıyan temel makine elemanlarıdır. Bu fonksiyonel çeşitlilikleri, teknik resimlerinin hazırlanmasında genel makine parçalarından daha özel ve kritik kuralların uygulanmasını gerektirir. Üzerine montajlanacak her bir eleman için ayrı detaylar kurallar vardır ve bunların teknik resimlerde gösterilmesinin de ayrıca kuralları vardır. Bu sebeplerden dolayı bu raporda her bir eleman üzerinde durulacaktır. Ayrıca raporda mil resmi örneklerine yer verilecektir. Bu örnekler genellikle SolidWorks programı ile çizilmiştir. Solidworks programında bazı detayları verilecektir.\r\n\r\n# Genel Kurallar\r\n\r\nÖncelikle millerin teknik resmindeki temel kuralları ele alalım. Bazı önemli kuralların en başta belirtilmesi gerekiyor. Bu kurallar daha çok millere özel kurallardır.\r\n\r\n-   Miller, fonksiyonel ve imalat pozisyonları gereği, daima ana eksenleri çizim düzlemine paralel olacak şekilde tek bir ana görünüş (genellikle ön görünüş) ile ifade edilir. Bu görünüş, milin tüm boy ölçülerini ve kademe çaplarını göstermek için yeterlidir.\r\n\r\n    **Kesit Alma İstisnası:** Genel bir kural olarak, ISO standartlarına göre dolu ve dönel simetriye sahip parçalar (miller, pimler, cıvatalar vb.) montaj resimlerinde, eksenleri kesit düzlemine paralel olduğunda tam kesite alınmazlar. Bunun sebebi, tam kesitin parçanın geometrisi hakkında ek bir bilgi vermemesi ve resmi karmaşıklaştırmasıdır.\r\n\r\n    Ancak, milin kendi imalat resminde (detay resmi), iç detayların (kama kanalları, enine delikler, segman kanalları vb.) ölçülendirilmesi ve net bir şekilde gösterilmesi için kısmi kesit veya döndürülmüş kesit alınması yaygın ve doğru bir uygulamadır. Bu, \"görünmeyen kenarlara ölçü verilmez\" kuralına uymak için de bir gerekliliktir.\r\n\r\n    **Örnek:** Bir kama kanalının derinliğini ve formunu göstermek için sadece o bölgeye ait yerel bir kesit alınır.\r\n\r\n-   Milin tüm uzunluğu boyunca, parçanın geometrik merkezini ve dönme eksenini tanımlayan bir eksen çizgisi (ISO 128 - Çizgi Tipi E: İnce, uzun kesik noktalı çizgi) mutlaka çizilmelidir. Bu çizgi, parçanın her iki ucundan da bir miktar (genellikle 3-5 mm) taşmalıdır.\r\n\r\n    Mühendislik Gerekçesi: Eksen çizgisi sadece parçanın dairesel olduğunu belirtmekle kalmaz, aynı zamanda çok daha kritik bir rol oynar:\r\n\r\n    **Datum Referansı:** Bu eksen, milin birincil datumudur. Tüm geometrik toleranslar (GD&T) – özellikle salgı, eş merkezlilik ve silindiriklik – bu referans eksenine göre tanımlanır. Bu sayede, farklı kademelerin birbirine göre ne kadar hassas bir şekilde aynı eksende olması gerektiği garanti altına alınır.\r\n\r\n-   **Çapların ve Uzunlukların Ölçülendirilmesi:** Mil üzerindeki her bir silindirik kademenin çapı \"Ø\" sembolü kullanılarak ve boyu mutlaka ölçülendirilmelidir. Ayrıca, milin toplam boyu da referans veya bağlama ölçüsü olarak verilmelidir.\r\n\r\n    **Referans Yüzeyinden Ölçülendirme:** Fonksiyonel açıdan en kritik olan yüzey (örneğin bir rulmanın dayanacağı alın yüzeyi) referans (datum) olarak seçilmeli ve mümkün olduğunca çok boyutsal ölçü bu yüzeyden verilmelidir.\r\n\r\n    **Mühendislik Gerekçesi:** Zincirleme ölçülendirme (chain dimensioning), her ölçüdeki toleransın bir sonrakine eklenmesine neden olarak tolerans yığılmasına (tolerance accumulation) yol açar. Bu durum, kritik kademeler arasındaki mesafenin kabul edilebilir limitlerin dışına çıkmasına neden olabilir. Referans yüzeyinden ölçülendirme ise her kademenin pozisyonunu doğrudan ana referansa göre kontrol ederek bu hatayı minimize eder ve parçanın montajdaki uyumunu garanti eder.\r\n\r\n-   **Görünmeyen Kenarlara Ölçü Verilmemesi:** Standart teknik resim kuralları gereği, kesik çizgilerle (görünmeyen kenarlar) gösterilen unsurlara doğrudan ölçü verilmesinden kesinlikle kaçınılmalıdır. Bu, okuma hatalarına ve yanlış yorumlamalara yol açar. Bunun yerine, ilgili unsur kısmi kesit veya detay görünüş ile görünür hale getirilmeli ve ölçülendirme bu görünüş üzerinde yapılmalıdır.\r\n\r\n# Millere Montajlanan Parçalar ve Teknik Resimlerde Gösterilmesi\r\n\r\n## Kama Kanalı\r\n\r\n![Atalay Endüstriyel \\| Düz Kamalar DIN 6885 10x8](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/b9b0fcc5a584652bcef277daf0ae3df1.jpeg)\r\n\r\nBiçim 3.1 Prizmatik Kama resmi\r\n\r\n### Kamanın Tanımı ve İşlevi\r\n\r\nMakine elemanları arasında güç ve hareket iletiminde en temel ve yaygın olarak kullanılan parçalardan biri kamadır. Kama, dönme hareketi yapan bir mil ile bu milin üzerine takılan dişli, kasnak, volan veya kaplin gibi bir makine elemanı arasında tork (dönme momenti) aktarımını sağlamak amacıyla kullanılan bir sökülebilir bağlantı elemanıdır.\r\n\r\nKamalar, tasarımda keyfi ölçülere göre değil, belirli mühendislik standartlarına göre imal edilir ve seçilirler. Uluslararası alanda **DIN 6885** ve Türkiye'de **TS 147** serisi standartlar, kamaların boyutlarını, toleranslarını ve malzemelerini tanımlayan en temel standartlardır. Tasarım sürecinde, mil çapına bağlı olarak bu standart tablolardan uygun kama ölçüsü seçilir. Bu standardizasyon hem imalat kolaylığı hem de parçalar arasında değiştirilebilirlik ilkesini garanti altına alır.\r\n\r\nKamanın temel işlevi, mil ile göbeğin (örneğin dişlinin) birbirine göre izafi olarak dönmesini engelleyerek torku iletmektir. Bu bağlantıyı oluşturmak için iki ayrı parça üzerine, birbirinden bağımsız olarak iki adet kama kanalı işlenir:\r\n\r\n-   **Mil Kama Kanalı (Shaft Keyway/Keyseat):** Milin dış silindirik yüzeyi üzerine açılan yuvadır.\r\n-   **Göbek Kama Kanalı (Hub Keyway):** Dişli, kasnak gibi elemanların iç delik yüzeyine açılan yuvadır.\r\n\r\nKama, montaj sırasında bu iki ayrı kanala aynı anda oturarak mil ile göbeği birbirine kilitler. Tıpkı kamaların kendisi gibi, bu iki farklı kama kanalının da (hem mil hem de göbek için) genişlik, derinlik ve toleransları ilgili standartlar tarafından net bir şekilde belirlenmiştir. Dolayısıyla, standart bir kama seçildiğinde, ona karşılık gelen mil kama kanalı ve göbek kama kanalı ölçüleri de otomatik olarak standart tablolardan alınır. Tork, kamanın yan yüzeyleri aracılığıyla milden göbeğe (veya tersi yönde) iletilir.\r\n\r\n### Kama Çeşitleri\r\n\r\nKamalar, kullanım amaçlarına, montaj şekillerine ve taşıdıkları yükün karakteristiğine göre farklı geometrilerde tasarlanmıştır. Endüstride sıkça karşılaşılan temel kama tipleri şunlardır:\r\n\r\n-   **Prizmatik Kamalar (Parallel Keys / Feather Keys):** En yaygın kullanılan kama tipidir. Kesiti dikdörtgen veya kare şeklinde olup, üst ve alt yüzeyleri birbirine paraleldir. Torku yan yüzeyleriyle iletirler. Eksenel harekete izin veren kayıcı tipleri (Feather Key) de mevcuttur.\r\n-   **Eğik Kamalar (Tapered Keys):** Üst yüzeyinde belirli bir eğime (genellikle 1/100) sahip olan kamalardır. Bu eğim sayesinde montaj sırasında mile ve göbeğe sıkıca oturarak hem tork iletimi sağlarlar hem de eksenel yönde bir miktar sabitleme yaparlar.\r\n-   **Yarım Ay Kamalar (Woodruff Keys):** Yarım daire kesitli bu kamalar, kendi eksenleri etrafında bir miktar dönebildikleri için özellikle konik mil uçlarında hizalama kolaylığı sağlarlar. Montajları için mile derin bir yuva açılması gerektiğinden, milin mukavemetini prizmatik kamalara göre daha fazla düşürürler.\r\n-   **Teğetsel Kamalar (Tangential Keys):** Çok büyük ve darbeli torkların iletiminde kullanılan, iki adet eğik kamanın bir araya gelmesiyle oluşan özel bir kama türüdür.\r\n\r\nBu rapor kapsamında, en temel ve standart kama tipi olan prizmatik kamanın teknik resimdeki gösterimi ve ölçülendirme detayları üzerinde durulacaktır. Diğer kama tipleri, farklı montaj ve fonksiyonel gereksinimler için mevcut olsalar da bu çalışmanın odak noktası prizmatik kama kanalının teknik resminin incelenmesidir.\r\n\r\n### Prizmatik A Tipi Kama Kanalı Teknik Resmi\r\n\r\n![silindir, tasarım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/a0a6f52baeb79b0f61717c0ace6dbd6f.png)\r\n\r\nBiçim 3.2 Kama kanalı.\r\n\r\nBiçim 3.2’de mil üzerinde açılmış bir kama kanalı gösterilmiştir. Kama standartlara uygun olarak çap 18-22 mm arası olan ölçülerde seçilmiştir. Yani kamanın genişliği ve yüksekliği 6 mm uzunluğu ise 16 mm’dir.\r\n\r\n![metin, diyagram, teknik çizim, paralel içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/f8938c1e52381fffcfe9bbf4219c454e.png)\r\n\r\nBiçim 3.3 Mil kama kanalı teknik resmi.\r\n\r\nMil üzerinde kama kanalının teknik resmi Biçim 3.3’ de verilmiştir. Mil resmi üzerinden sadece uzunluk ölçüsü verilmiş ardından da kama kanalı üzerinden kesit görünümü alınmıştır. Yükseklik ve genişlik ölçüleri kama kesit görünüş üzerine verilmiştir. Yükseklik ve genişlik ölçülerinin toleransları kama kanalı standartlarına uygun olarak uzunluk ölçüsünün toleransı ise **DIN 6885** toleranslarına göre verilmiştir.\r\n\r\nKAMA KANALI UZUNLUK ÖLÇÜSÜ +0,1 -0\r\n\r\n![metin, diyagram, paralel, çizgi içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/5e92e6a88024cc6550c6b5544fa6f2d3.png)\r\n\r\nBiçim 3.4 Delik kama kanalı teknik resmi.\r\n\r\nDeliklerin kama kanalı teknik resmi de millerinkinden pek farklı değildir. Toleranslar aynı biçimde verilir. Duruma göre dikey kesit alınabilir.\r\n\r\n## Segman\r\n\r\n![daire içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/a3655a3590f68519439fdf32f9379469.jpeg)\r\n\r\nBiçim 3.5 Segman örneği.\r\n\r\n### Segmanın Tanımı, Standartları ve İşlevi\r\n\r\nSegman (İngilizce: Circlip veya Retaining Ring), makine elemanlarını (örneğin rulmanlar, dişliler, burçlar) bir mil üzerinde veya bir delik (yuva) içerisinde eksenel olarak, yani mil ekseni boyunca kaymalarını önleyerek konumlandırmak ve sabitlemek için kullanılan, yay çeliğinden imal edilmiş, yarım daire formunda bir tespit elemanıdır.\r\n\r\nSegmanların temel işlevi, üzerine takıldıkları parçalar için bir \"yapay omuz\" (artificial shoulder) oluşturmaktır. Bu sayede, mile veya yuvaya bir fatura (shoulder) işlenmesine gerek kalmadan, daha ekonomik ve basit bir tasarımla parçaların eksenel hareketi sınırlandırılmış olur.\r\n\r\nSegmanlar, tıpkı kamalar gibi, belirli uluslararası standartlara göre üretilir ve seçilir. En yaygın kullanılan segman standartları DIN 471 (dış segmanlar için) ve DIN 472 (iç segmanlar için) standartlarıdır. Bu standartlar, segmanın tüm geometrik ölçülerini, malzeme özelliklerini ve takılacağı kanalın (yuvanın) ölçülerini tanımlar. Tasarım yapılırken, mil çapına veya delik çapına göre bu standart tablolardan uygun segman ve segman kanalı ölçüleri seçilir. Bu standardizasyon, imalat ve montaj süreçlerini büyük ölçüde kolaylaştırır.\r\n\r\nSegman standartları ve toleransları için şu web sitesine bakılabilir:\r\n\r\n<http://erbekrulman.com.tr/segman_emniyet_sekmanlari_din_471-sayfa_id-333-id-54476>\r\n\r\n### Segman Çeşitleri\r\n\r\nSegmanlar, montaj edildikleri yere göre temel olarak iki ana tipe ayrılır:\r\n\r\n-   **Dış Segmanlar (External Circlips - DIN 471):** Millerin üzerine takılmak üzere tasarlanmışlardır. Bir milin dış çevresine açılan \"segman kanalı\" adı verilen sığ bir yuvaya yerleştirilirler. Montajları ve demontajları, uçlarındaki deliklere özel bir segman pensesi takılarak segmanın dışa doğru esnetilmesiyle (açılmasıyla) gerçekleştirilir. Mil üzerine takılan bir rulmanın dışarı doğru kaymasını önlemek, dış segman için tipik bir kullanım alanıdır.\r\n-   **İç Segmanlar (Internal Circlips - DIN 472):** Deliklerin veya yuvaların (örneğin bir makine gövdesi veya bir dişli göbeği) iç yüzeyine takılmak üzere tasarlanmışlardır. Deliğin iç çevresine açılan segman kanalına yerleştirilirler. Montaj ve demontaj işlemleri, özel bir segman pensesiyle uçlarındaki deliklerden içe doğru sıkıştırılarak (kapatılarak) yapılır. Bir yuvaya yerleştirilmiş rulmanın yerinden çıkmasını engellemek, iç segman için yaygın bir örnektir.\r\n\r\nHer iki segman tipi için de bağlantının güvenilir olması, segmanın oturduğu segman kanalının ölçülerinin ve toleranslarının standartlara tam olarak uygun olmasına bağlıdır. Kanal genişliğinin veya derinliğinin yanlış olması, segmanın görevini tam olarak yerine getirememesine veya çalışma sırasında yerinden çıkmasına neden olabilir. Bu nedenle, teknik resimde segman kanallarının standartlara uygun şekilde gösterilmesi ve ölçülendirilmesi kritik bir öneme sahiptir.\r\n\r\n### İç Segman Teknik Resmi\r\n\r\n![daire, gümüş, tasarım, tekerlek içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/7f750b7fdbf14066b466e7ba067bc4ac.png)\r\n\r\nBiçim 3.6 İç segman kanalı 3d örnek.\r\n\r\n![metin, diyagram, taslak, çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/d2a8024e271cec45fd33749e52fd2844.png)\r\n\r\nBiçim 3.7 İç segman kanalı teknik resim örnek.\r\n\r\nBiçim 3.7’de iç segman kanalının teknik resim örneği verilmiştir. Delik için segman kanalı ölçüsü gösterilirken kesit alınabilir. Segman kanalının çapı gösterilir. Burada en önemli nokta segman kanalının parçanın neresinde olduğunu göstermektir. Bu ölçü rastgele bir yerden verilemez. Segman ne için kullanılacaksa, segmanın sabit tutacağı parçanın diğer tarafından ölçü verilir. Bu ölçü verilirken de segman kanalının arada kalan parçaya göre dış kısımda kalan duvarından ölçü verilir. Burada tasarımda dikkat edilmesi gerekilen bir nokta vardır. Segman kanalının ölçüsü şu formül ile verilir:\r\n\r\n$$\r\nS e g m a n \\  K a n a l \\imath n \\imath n \\  U z u n l u k \\  Ö l ç ü s ü = S e g m a n \\imath n \\  s a b i t l e y e c e ğ i \\  p a r ç a n \\imath n \\  u z u n l u ğ u + s e g m a n \\  k a l \\imath n l \\imath ğ \\imath\r\n$$\r\n\r\nYani segmanın sabitleyeceği parçanın ölçüsünün 23 mm olduğunu varsayalım. Segman kanalı kalınlığı ise 40 için 1,85 mm’dir. Segman kalınlığı ise yine 40 için 1,75 mm’dir. Segman kanalının dışta kalan duvarından ölçü verirken segman kanalının kalınlığı kadar değil de segman kalınlığı kadar ölçü verilir. Yani toplam ölçü $$2 3 + 1 , 7 5 = 2 4 , 7 5$$ olur. Segmanın istenilen parçayı sıkıştırabilmesi için bu ölçü verilir. Bu ölçü doğru verilmediği taktirde arada kalan 0,1 mm sıkıştırılması istenen parçayı yeteri kadar sıkıştırmayabilir. Hem çap hem de kalınlık ölçüleri için standartlara uygun toleranslar verilir.\r\n\r\n### Dış Segman Teknik Resmi\r\n\r\n![silindir, tasarım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/9d3c83198765f55fdef2d4eeccacb64d.png)\r\n\r\nBiçim 3.8 Dış segman kanalı 3d örnek.\r\n\r\n![metin, diyagram, paralel, plan içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/283e295056ed258172bb564beb388112.png)\r\n\r\nBiçim 3.9 Dış segman kanalı teknik resim örnek.\r\n\r\nBiçim 3.9’ da Dış segman kanalı teknik resim örneği verilmiştir. İç segmandaki kurallar burada da geçerlidir. Dış çap ölçüsü verilir. Burada en önemli nokta aynı iç segman kanalında olduğu gibi segman kanalının parçanın neresinde olduğunu göstermektir. Bu ölçü rastgele bir yerden verilemez. Segman ne için kullanılacaksa, segmanın sabit tutacağı parçanın diğer tarafından ölçü verilir. Bu ölçü verilirken de segman kanalının arada kalan parçaya göre dış kısımda kalan duvarından ölçü verilir. Bu ölçünün hesaplanması İç Segman Teknik Resmi bölümünde anlatılmıştır. Hem çap hem de kalınlık ölçüleri için standartlara uygun toleranslar verilir.\r\n\r\n# Alından Cıvata\r\n\r\nBazı millerde montaj için alından cıvata deliği açmak gerekebilir. Böyle bir durumda da millerin teknik resimlerinde ayrıntılar vardır.\r\n\r\n![ekran görüntüsü, silindir, tasarım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/29d9c3650adaf82851b2e6b8b844dfc5.png)\r\n\r\nBiçim 4.1 Alından cıvata deliği 3d örnek.\r\n\r\n![metin, diyagram, ekran görüntüsü, paralel içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/a0f22ca4f81bd50302915eee0fef1120.png)\r\n\r\nBiçim 4.2 Alından cıvata deliği teknik resim örnek.\r\n\r\nAlından cıvata deliğini teknik resimde gösterebilmek için kısmi kesit alınmalıdır. Kısmi kesitin boyutu fazla büyütülmemeli sadece cıvata deliğini gösterecek kadar olmalıdır. Kısmi kesit aldıktan sonra cıvatanın metrik vs. ölçüsü, diş boyu ve toplam boyu gösterilmelidir.\r\n\r\nMil çapı ölçüsü için doğru cıvata deliği açmanın da kuralları vardır. Önce cıvata metrik kaç olacağı seçilir. Bunun için mukavemet hesabı yapmak gereklidir. Mile gelecek eksenel ya da radyal yükler hesaplanır. Metrik seçildikten sonra cıvata deliği boyu seçilmelidir. Cıvata deliği boyunun standartları vardır ancak bazı durumlarda delik boyu uzun gelirse uygun biçimde standartların dışına çıkılabilir.\r\n\r\nBazı durumlarda milin torna tezgahına bağlanabilmesi için punta deliği açmak gereklidir. Punta deliği de cıvata deliği gibi kısmi kesit alınarak gösterilir.\r\n\r\n# Diş açma\r\n\r\nMillerde yaygın uygulamalardan birisi diş açmadır. Milin dış yüzeyine diş çekilir ve bu sayede çeşitli montaj imkanları edinilmiş olunur. Cıvatalar da aslında dışlarına diş çelikmiş millerdir.\r\n\r\n![](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/b42be3ee0257cedf8f1dd2848b8bd07f.png)\r\n\r\nBiçim 5.1 M20 diş açma 3d şematik görünüm.\r\n\r\n![metin, diyagram, paralel, dikdörtgen içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/b01a18c3517d123784d9637081fe3de6.png)\r\n\r\nBiçim 5.2 M20 diş açma teknik resim görünüm.\r\n\r\nTeknik resimde diş açmayı göstermek için önden görünüş yeterlidir. Metrik kaç olduğu ve diş uzunluğu ölçüleri verilmesi yeterlidir.\r\n\r\n# Dip boşaltma\r\n\r\n## Tanım ve Terminoloji\r\n\r\nDip boşaltma, teknik literatürde rahatlatma kanalı, feder yatağı veya uluslararası terminolojide \"Relief Groove\" / \"Undercut\" olarak da bilinen, bir mil üzerinde farklı çaplara sahip iki silindirik yüzeyin birleştiği fatura dibine (kesit değişimi köşesine) hassas bir şekilde işlenen geometrik bir kanaldır. Bu kanal, basit bir oluktan ziyade, birden çok mühendislik amacına hizmet eden kritik bir tasarım unsurudur.\r\n\r\nBu kanalların form ve boyutları genellikle **DIN 509** ya da **ISO 18388** gibi uluslararası standartlar ile tanımlanır. Standartlar, kanalın derinliği, genişliği ve radyusu gibi kritik ölçüleri mil çapı ve fatura yüksekliğine bağlı olarak belirler.\r\n\r\n## Dip Boşaltma Kanallarının Mühendislik Amaçları\r\n\r\nDip boşaltma kanallarının tasarıma dahil edilmesinin üç temel mühendislik sebebi bulunmaktadır:\r\n\r\n### Montaj Hassasiyetinin ve Yüzey Temasının Sağlanması\r\n\r\nBir mil üzerine rulman, dişli, conta veya başka bir makine elemanı monte edildiğinde, bu elemanın mil üzerindeki faturanın dikey yüzeyine tam olarak yaslanması (oturması) istenir. Ancak, tornalama gibi talaşlı imalat operasyonları doğası gereği fatura dibinde belirli bir köşe radyusu (fillet radius) bırakır. Monte edilecek parçanın iç köşe geometrisi ise genellikle keskin veya çok daha küçük bir radyus sahiptir.\r\n\r\nBu durumda dip boşaltma kanalı, imalattan kaynaklanan bu köşe radyusunu ortadan kaldıracak bir boşluk oluşturur. Bu sayede, monte edilen parçanın köşesi bu kanala denk gelir ve parçanın düzlemsel yüzeyi, faturanın dikey yüzeyine tam ve boşluksuz bir temas sağlar. Bu tam temas;\r\n\r\n-   Yükün düzgün bir şekilde aktarılmasını,\r\n-   Eksenel hizalanmanın ve konumlandırmanın hassas bir şekilde yapılmasını,\r\n-   Bileşenlerin öngörülen çalışma pozisyonunda olmasını garanti eder.\r\n\r\n### İmalat Süreçlerinin Kolaylaştırılması (Taşlama Taşı Çıkış Boşluğu)\r\n\r\nMillerin yataklama veya sızdırmazlık bölgeleri gibi hassas yüzeyleri genellikle taşlama (grinding) operasyonu ile son ölçülerine ve yüzey pürüzlülüğü değerlerine getirilir. Taşlama taşlarının kenarları, kırılganlığı azaltmak için her zaman belirli bir radyüse sahiptir ve bu nedenle dik bir faturanın dibine kadar sıfır yanaşarak taşlama yapamazlar.\r\n\r\nDip boşaltma kanalı, bu durumda taşlama taşı için bir çıkış boşluğu (grinding runout) görevi görür. Taş, silindirik yüzeyin sonuna geldiğinde bu boşluğa dalarak operasyonu tamamlar. Bu işlem;\r\n\r\n-   Taşlama taşının faturaya çarpmasını ve hasar görmesini engeller.\r\n-   Mil yüzeyinin fatura dibine kadar tam ve homojen bir şekilde taşlanabilmesini mümkün kılar.\r\n-   İstenen çap ve yüzey kalitesinin milin tüm çalışma yüzeyi boyunca elde edilmesini sağlar.\r\n\r\n### Gerilim Yığılmasının Kontrol Altına Alınması (Stress Relief)\r\n\r\nMillerde çapların değiştiği fatura dipleri, ani kesit daralması nedeniyle gerilim yığılması (stress concentration) için en kritik bölgelerdir. Özellikle değişken ve döngüsel yüklere maruz kalan miller, bu bölgelerden başlayan yorulma çatlakları (fatigue cracks) nedeniyle hasara uğrayabilirler.\r\n\r\nStandart bir köşe radyüsü gerilim yığılmasını bir miktar azaltsa da, özel olarak tasarlanmış bir dip boşaltma kanalı, gerilim akış çizgileri için çok daha pürüzsüz bir geçiş yolu sunar. Kanalın optimize edilmiş geometrisi (özellikle daha geniş bir dip radyüsü), gerilim yığılma faktörünü (Kt) önemli ölçüde düşürür. Bu sayede, parçanın dinamik yüklere karşı dayanımı ve yorulma ömrü artırılır.\r\n\r\n## Sonuç\r\n\r\nSonuç olarak, miller üzerindeki dip boşaltma kanalları; montaj doğruluğunu garanti eden, imalat operasyonlarını (özellikle taşlamayı) mümkün kılan ve parçanın yorulma ömrünü artırarak mekanik güvenilirliği sağlayan çok fonksiyonlu ve kritik tasarım unsurlarıdır. Tasarım aşamasında bu kanalların boyutlarının ve formunun, parçanın maruz kalacağı yüklere ve montaj gereksinimlerine göre ilgili standartlar (örn. DIN 509) dikkate alınarak seçilmesi büyük önem arz etmektedir.\r\n\r\n## Teknik Resim Örnek\r\n\r\n![silindir, levye, tasarım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/b47509f1595d4bcd9b335a4da14ce043.png)\r\n\r\nBiçim 6.1 Dip boşaltma 3d örnek.\r\n\r\n![metin, diyagram, teknik çizim, plan içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/179330463329042731a0ceea0b8bb58e.png)\r\n\r\nBiçim 6.2 Dip boşaltma teknik resim örnek.\r\n\r\nBiçim 6.2’ de dip boşaltma teknik resim örneği verilmiştir. Dip boşaltma göstermek için ön görünüşten bakmak yeterlidir. Ancak dip boşaltma çoğu zaman çok küçük olduğu için parçanın normal boyutlarında göstermek zor olabilir. Bunun için örnekte de göründüğü gibi detay görünüm alınabilir.\r\n\r\n# Toleranslar\r\n\r\nNerede hangi tolerans kullanılmalı?\r\n\r\n![](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/15f9875817b8a8fd88453000fd48c390.png)\r\n\r\n# Örnekler\r\n\r\n![metin, diyagram, taslak, çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/5449db095f7c5379d0a8c11981cb3bed.jpeg)\r\n\r\nBiçim 8.1 Örnek1\r\n\r\n![metin, diyagram, plan, teknik çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/fdf285c19472e80042645884701aea88.jpeg)\r\n\r\nBiçim 8.2 Örnek 2\r\n\r\n![metin, diyagram, teknik çizim, plan içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/358d0a979c609cc78e377243cd842371.jpeg)\r\n\r\nBiçim 8.3 Örnek 3\r\n\r\n![taslak, diyagram, metin, teknik çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/61363d2337f8056fc37fa3ebe057e35e.jpeg)\r\n\r\nBiçim 8.4 Örnek 4\r\n\r\n![metin, diyagram, çizim, taslak içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/794eda96f15979d47f55da0a6d92ba13.jpeg)\r\n\r\nBiçim 8.5 Örnek 5\r\n\r\n![diyagram, metin, taslak, çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/e4f1383c38e5311810ecc4564a1dd450.jpeg)\r\n\r\nBiçim 8.6 Örnek 6\r\n\r\n![](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/2d2ec2aabe781355226c76edc1962a63.jpeg)\r\n\r\nBiçim 8.7 Örnek 7\r\n\r\n![diyagram, taslak, teknik çizim, plan içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/7789a41fb09e1d6ad1cd54f9b4662d82.png)\r\n\r\nBiçim 8.8 Örnek 8\r\n"
        },
        "en": {
            "title": "Preparation of Miller's Technical Drawing",
            "desc": "bla bla bla",
            "content": "# Giriş ve Temel Kavramlar\r\n\r\n## Teknik Resmin Tanımı ve Önemi\r\n\r\nTeknik resim, bir makine parçasının, sistemin veya yapının tüm geometrik ve fonksiyonel özelliklerini, standartlaştırılmış kurallar, semboller ve gösterimler bütünü kullanarak iki boyutlu bir düzlemde ifade etme yöntemidir. Esasen, mühendisler, teknikerler ve imalatçılar arasında konuşulan evrensel ve hassas bir dildir. Bu dil, fikir ve tasarım aşamasındaki soyut bir konsepti, somut, üretilebilir ve denetlenebilir bir ürüne dönüştüren temel köprü görevini üstlenir.\r\n\r\n**Teknik resmin önemi şu temel fonksiyonlarda yatar:**\r\n\r\n**İletişim:** Tasarımcının zihnindeki tüm detayları (boyutlar, toleranslar, malzeme, yüzey kalitesi vb.) imalatı yapacak kişiye eksiksiz ve hatasız bir şekilde aktarır. Yorumlamaya ve belirsizliğe yer bırakmaz.\r\n\r\n**İmalat:** Üretim sürecinin yol haritasıdır. Parçanın hangi operasyonlardan (tornalama, frezeleme, taşlama, delme vb.) geçeceğini, hangi hassasiyette işleneceğini ve hangi ölçülere sahip olacağını tanımlar.\r\n\r\n**Kalite Kontrol ve Muayene:** Üretilen parçanın, tasarım gereksinimlerini karşılayıp karşılamadığını doğrulamak için kullanılan referans belgedir. Ölçüm ve kontrol operasyonları teknik resimdeki değerlere göre yapılır.\r\n\r\n**Standardizasyon ve Değiştirilebilirlik:** Teknik resim standartları (ISO, ANSI, DIN vb.) sayesinde, dünyanın farklı yerlerinde üretilen parçaların bile birbiriyle uyumlu bir şekilde montajlanabilmesi sağlanır.\r\n\r\n**Dokümantasyon:** Tasarımın kalıcı bir kaydıdır. Revizyon yönetimi, bakım ve gelecekteki tasarım iyileştirmeleri için temel bir arşiv belgesi niteliğindedir.\r\n\r\n## Miller İçin Teknik Resmin Özel Kuralları ve Önemi\r\n\r\nMiller, dönme hareketi yaparak güç ve moment ileten, üzerlerinde dişli, kasnak, yatak (rulman), kavrama gibi makine elemanlarını taşıyan temel makine elemanlarıdır. Bu fonksiyonel çeşitlilikleri, teknik resimlerinin hazırlanmasında genel makine parçalarından daha özel ve kritik kuralların uygulanmasını gerektirir. Üzerine montajlanacak her bir eleman için ayrı detaylar kurallar vardır ve bunların teknik resimlerde gösterilmesinin de ayrıca kuralları vardır. Bu sebeplerden dolayı bu raporda her bir eleman üzerinde durulacaktır. Ayrıca raporda mil resmi örneklerine yer verilecektir. Bu örnekler genellikle SolidWorks programı ile çizilmiştir. Solidworks programında bazı detayları verilecektir.\r\n\r\n# Genel Kurallar\r\n\r\nÖncelikle millerin teknik resmindeki temel kuralları ele alalım. Bazı önemli kuralların en başta belirtilmesi gerekiyor. Bu kurallar daha çok millere özel kurallardır.\r\n\r\n-   Miller, fonksiyonel ve imalat pozisyonları gereği, daima ana eksenleri çizim düzlemine paralel olacak şekilde tek bir ana görünüş (genellikle ön görünüş) ile ifade edilir. Bu görünüş, milin tüm boy ölçülerini ve kademe çaplarını göstermek için yeterlidir.\r\n\r\n    **Kesit Alma İstisnası:** Genel bir kural olarak, ISO standartlarına göre dolu ve dönel simetriye sahip parçalar (miller, pimler, cıvatalar vb.) montaj resimlerinde, eksenleri kesit düzlemine paralel olduğunda tam kesite alınmazlar. Bunun sebebi, tam kesitin parçanın geometrisi hakkında ek bir bilgi vermemesi ve resmi karmaşıklaştırmasıdır.\r\n\r\n    Ancak, milin kendi imalat resminde (detay resmi), iç detayların (kama kanalları, enine delikler, segman kanalları vb.) ölçülendirilmesi ve net bir şekilde gösterilmesi için kısmi kesit veya döndürülmüş kesit alınması yaygın ve doğru bir uygulamadır. Bu, \"görünmeyen kenarlara ölçü verilmez\" kuralına uymak için de bir gerekliliktir.\r\n\r\n    **Örnek:** Bir kama kanalının derinliğini ve formunu göstermek için sadece o bölgeye ait yerel bir kesit alınır.\r\n\r\n-   Milin tüm uzunluğu boyunca, parçanın geometrik merkezini ve dönme eksenini tanımlayan bir eksen çizgisi (ISO 128 - Çizgi Tipi E: İnce, uzun kesik noktalı çizgi) mutlaka çizilmelidir. Bu çizgi, parçanın her iki ucundan da bir miktar (genellikle 3-5 mm) taşmalıdır.\r\n\r\n    Mühendislik Gerekçesi: Eksen çizgisi sadece parçanın dairesel olduğunu belirtmekle kalmaz, aynı zamanda çok daha kritik bir rol oynar:\r\n\r\n    **Datum Referansı:** Bu eksen, milin birincil datumudur. Tüm geometrik toleranslar (GD&T) – özellikle salgı, eş merkezlilik ve silindiriklik – bu referans eksenine göre tanımlanır. Bu sayede, farklı kademelerin birbirine göre ne kadar hassas bir şekilde aynı eksende olması gerektiği garanti altına alınır.\r\n\r\n-   **Çapların ve Uzunlukların Ölçülendirilmesi:** Mil üzerindeki her bir silindirik kademenin çapı \"Ø\" sembolü kullanılarak ve boyu mutlaka ölçülendirilmelidir. Ayrıca, milin toplam boyu da referans veya bağlama ölçüsü olarak verilmelidir.\r\n\r\n    **Referans Yüzeyinden Ölçülendirme:** Fonksiyonel açıdan en kritik olan yüzey (örneğin bir rulmanın dayanacağı alın yüzeyi) referans (datum) olarak seçilmeli ve mümkün olduğunca çok boyutsal ölçü bu yüzeyden verilmelidir.\r\n\r\n    **Mühendislik Gerekçesi:** Zincirleme ölçülendirme (chain dimensioning), her ölçüdeki toleransın bir sonrakine eklenmesine neden olarak tolerans yığılmasına (tolerance accumulation) yol açar. Bu durum, kritik kademeler arasındaki mesafenin kabul edilebilir limitlerin dışına çıkmasına neden olabilir. Referans yüzeyinden ölçülendirme ise her kademenin pozisyonunu doğrudan ana referansa göre kontrol ederek bu hatayı minimize eder ve parçanın montajdaki uyumunu garanti eder.\r\n\r\n-   **Görünmeyen Kenarlara Ölçü Verilmemesi:** Standart teknik resim kuralları gereği, kesik çizgilerle (görünmeyen kenarlar) gösterilen unsurlara doğrudan ölçü verilmesinden kesinlikle kaçınılmalıdır. Bu, okuma hatalarına ve yanlış yorumlamalara yol açar. Bunun yerine, ilgili unsur kısmi kesit veya detay görünüş ile görünür hale getirilmeli ve ölçülendirme bu görünüş üzerinde yapılmalıdır.\r\n\r\n# Millere Montajlanan Parçalar ve Teknik Resimlerde Gösterilmesi\r\n\r\n## Kama Kanalı\r\n\r\n![Atalay Endüstriyel \\| Düz Kamalar DIN 6885 10x8](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/b9b0fcc5a584652bcef277daf0ae3df1.jpeg)\r\n\r\nBiçim 3.1 Prizmatik Kama resmi\r\n\r\n### Kamanın Tanımı ve İşlevi\r\n\r\nMakine elemanları arasında güç ve hareket iletiminde en temel ve yaygın olarak kullanılan parçalardan biri kamadır. Kama, dönme hareketi yapan bir mil ile bu milin üzerine takılan dişli, kasnak, volan veya kaplin gibi bir makine elemanı arasında tork (dönme momenti) aktarımını sağlamak amacıyla kullanılan bir sökülebilir bağlantı elemanıdır.\r\n\r\nKamalar, tasarımda keyfi ölçülere göre değil, belirli mühendislik standartlarına göre imal edilir ve seçilirler. Uluslararası alanda **DIN 6885** ve Türkiye'de **TS 147** serisi standartlar, kamaların boyutlarını, toleranslarını ve malzemelerini tanımlayan en temel standartlardır. Tasarım sürecinde, mil çapına bağlı olarak bu standart tablolardan uygun kama ölçüsü seçilir. Bu standardizasyon hem imalat kolaylığı hem de parçalar arasında değiştirilebilirlik ilkesini garanti altına alır.\r\n\r\nKamanın temel işlevi, mil ile göbeğin (örneğin dişlinin) birbirine göre izafi olarak dönmesini engelleyerek torku iletmektir. Bu bağlantıyı oluşturmak için iki ayrı parça üzerine, birbirinden bağımsız olarak iki adet kama kanalı işlenir:\r\n\r\n-   **Mil Kama Kanalı (Shaft Keyway/Keyseat):** Milin dış silindirik yüzeyi üzerine açılan yuvadır.\r\n-   **Göbek Kama Kanalı (Hub Keyway):** Dişli, kasnak gibi elemanların iç delik yüzeyine açılan yuvadır.\r\n\r\nKama, montaj sırasında bu iki ayrı kanala aynı anda oturarak mil ile göbeği birbirine kilitler. Tıpkı kamaların kendisi gibi, bu iki farklı kama kanalının da (hem mil hem de göbek için) genişlik, derinlik ve toleransları ilgili standartlar tarafından net bir şekilde belirlenmiştir. Dolayısıyla, standart bir kama seçildiğinde, ona karşılık gelen mil kama kanalı ve göbek kama kanalı ölçüleri de otomatik olarak standart tablolardan alınır. Tork, kamanın yan yüzeyleri aracılığıyla milden göbeğe (veya tersi yönde) iletilir.\r\n\r\n### Kama Çeşitleri\r\n\r\nKamalar, kullanım amaçlarına, montaj şekillerine ve taşıdıkları yükün karakteristiğine göre farklı geometrilerde tasarlanmıştır. Endüstride sıkça karşılaşılan temel kama tipleri şunlardır:\r\n\r\n-   **Prizmatik Kamalar (Parallel Keys / Feather Keys):** En yaygın kullanılan kama tipidir. Kesiti dikdörtgen veya kare şeklinde olup, üst ve alt yüzeyleri birbirine paraleldir. Torku yan yüzeyleriyle iletirler. Eksenel harekete izin veren kayıcı tipleri (Feather Key) de mevcuttur.\r\n-   **Eğik Kamalar (Tapered Keys):** Üst yüzeyinde belirli bir eğime (genellikle 1/100) sahip olan kamalardır. Bu eğim sayesinde montaj sırasında mile ve göbeğe sıkıca oturarak hem tork iletimi sağlarlar hem de eksenel yönde bir miktar sabitleme yaparlar.\r\n-   **Yarım Ay Kamalar (Woodruff Keys):** Yarım daire kesitli bu kamalar, kendi eksenleri etrafında bir miktar dönebildikleri için özellikle konik mil uçlarında hizalama kolaylığı sağlarlar. Montajları için mile derin bir yuva açılması gerektiğinden, milin mukavemetini prizmatik kamalara göre daha fazla düşürürler.\r\n-   **Teğetsel Kamalar (Tangential Keys):** Çok büyük ve darbeli torkların iletiminde kullanılan, iki adet eğik kamanın bir araya gelmesiyle oluşan özel bir kama türüdür.\r\n\r\nBu rapor kapsamında, en temel ve standart kama tipi olan prizmatik kamanın teknik resimdeki gösterimi ve ölçülendirme detayları üzerinde durulacaktır. Diğer kama tipleri, farklı montaj ve fonksiyonel gereksinimler için mevcut olsalar da bu çalışmanın odak noktası prizmatik kama kanalının teknik resminin incelenmesidir.\r\n\r\n### Prizmatik A Tipi Kama Kanalı Teknik Resmi\r\n\r\n![silindir, tasarım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/a0a6f52baeb79b0f61717c0ace6dbd6f.png)\r\n\r\nBiçim 3.2 Kama kanalı.\r\n\r\nBiçim 3.2’de mil üzerinde açılmış bir kama kanalı gösterilmiştir. Kama standartlara uygun olarak çap 18-22 mm arası olan ölçülerde seçilmiştir. Yani kamanın genişliği ve yüksekliği 6 mm uzunluğu ise 16 mm’dir.\r\n\r\n![metin, diyagram, teknik çizim, paralel içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/f8938c1e52381fffcfe9bbf4219c454e.png)\r\n\r\nBiçim 3.3 Mil kama kanalı teknik resmi.\r\n\r\nMil üzerinde kama kanalının teknik resmi Biçim 3.3’ de verilmiştir. Mil resmi üzerinden sadece uzunluk ölçüsü verilmiş ardından da kama kanalı üzerinden kesit görünümü alınmıştır. Yükseklik ve genişlik ölçüleri kama kesit görünüş üzerine verilmiştir. Yükseklik ve genişlik ölçülerinin toleransları kama kanalı standartlarına uygun olarak uzunluk ölçüsünün toleransı ise **DIN 6885** toleranslarına göre verilmiştir.\r\n\r\nKAMA KANALI UZUNLUK ÖLÇÜSÜ +0,1 -0\r\n\r\n![metin, diyagram, paralel, çizgi içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/5e92e6a88024cc6550c6b5544fa6f2d3.png)\r\n\r\nBiçim 3.4 Delik kama kanalı teknik resmi.\r\n\r\nDeliklerin kama kanalı teknik resmi de millerinkinden pek farklı değildir. Toleranslar aynı biçimde verilir. Duruma göre dikey kesit alınabilir.\r\n\r\n## Segman\r\n\r\n![daire içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/a3655a3590f68519439fdf32f9379469.jpeg)\r\n\r\nBiçim 3.5 Segman örneği.\r\n\r\n### Segmanın Tanımı, Standartları ve İşlevi\r\n\r\nSegman (İngilizce: Circlip veya Retaining Ring), makine elemanlarını (örneğin rulmanlar, dişliler, burçlar) bir mil üzerinde veya bir delik (yuva) içerisinde eksenel olarak, yani mil ekseni boyunca kaymalarını önleyerek konumlandırmak ve sabitlemek için kullanılan, yay çeliğinden imal edilmiş, yarım daire formunda bir tespit elemanıdır.\r\n\r\nSegmanların temel işlevi, üzerine takıldıkları parçalar için bir \"yapay omuz\" (artificial shoulder) oluşturmaktır. Bu sayede, mile veya yuvaya bir fatura (shoulder) işlenmesine gerek kalmadan, daha ekonomik ve basit bir tasarımla parçaların eksenel hareketi sınırlandırılmış olur.\r\n\r\nSegmanlar, tıpkı kamalar gibi, belirli uluslararası standartlara göre üretilir ve seçilir. En yaygın kullanılan segman standartları DIN 471 (dış segmanlar için) ve DIN 472 (iç segmanlar için) standartlarıdır. Bu standartlar, segmanın tüm geometrik ölçülerini, malzeme özelliklerini ve takılacağı kanalın (yuvanın) ölçülerini tanımlar. Tasarım yapılırken, mil çapına veya delik çapına göre bu standart tablolardan uygun segman ve segman kanalı ölçüleri seçilir. Bu standardizasyon, imalat ve montaj süreçlerini büyük ölçüde kolaylaştırır.\r\n\r\nSegman standartları ve toleransları için şu web sitesine bakılabilir:\r\n\r\n<http://erbekrulman.com.tr/segman_emniyet_sekmanlari_din_471-sayfa_id-333-id-54476>\r\n\r\n### Segman Çeşitleri\r\n\r\nSegmanlar, montaj edildikleri yere göre temel olarak iki ana tipe ayrılır:\r\n\r\n-   **Dış Segmanlar (External Circlips - DIN 471):** Millerin üzerine takılmak üzere tasarlanmışlardır. Bir milin dış çevresine açılan \"segman kanalı\" adı verilen sığ bir yuvaya yerleştirilirler. Montajları ve demontajları, uçlarındaki deliklere özel bir segman pensesi takılarak segmanın dışa doğru esnetilmesiyle (açılmasıyla) gerçekleştirilir. Mil üzerine takılan bir rulmanın dışarı doğru kaymasını önlemek, dış segman için tipik bir kullanım alanıdır.\r\n-   **İç Segmanlar (Internal Circlips - DIN 472):** Deliklerin veya yuvaların (örneğin bir makine gövdesi veya bir dişli göbeği) iç yüzeyine takılmak üzere tasarlanmışlardır. Deliğin iç çevresine açılan segman kanalına yerleştirilirler. Montaj ve demontaj işlemleri, özel bir segman pensesiyle uçlarındaki deliklerden içe doğru sıkıştırılarak (kapatılarak) yapılır. Bir yuvaya yerleştirilmiş rulmanın yerinden çıkmasını engellemek, iç segman için yaygın bir örnektir.\r\n\r\nHer iki segman tipi için de bağlantının güvenilir olması, segmanın oturduğu segman kanalının ölçülerinin ve toleranslarının standartlara tam olarak uygun olmasına bağlıdır. Kanal genişliğinin veya derinliğinin yanlış olması, segmanın görevini tam olarak yerine getirememesine veya çalışma sırasında yerinden çıkmasına neden olabilir. Bu nedenle, teknik resimde segman kanallarının standartlara uygun şekilde gösterilmesi ve ölçülendirilmesi kritik bir öneme sahiptir.\r\n\r\n### İç Segman Teknik Resmi\r\n\r\n![daire, gümüş, tasarım, tekerlek içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/7f750b7fdbf14066b466e7ba067bc4ac.png)\r\n\r\nBiçim 3.6 İç segman kanalı 3d örnek.\r\n\r\n![metin, diyagram, taslak, çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/d2a8024e271cec45fd33749e52fd2844.png)\r\n\r\nBiçim 3.7 İç segman kanalı teknik resim örnek.\r\n\r\nBiçim 3.7’de iç segman kanalının teknik resim örneği verilmiştir. Delik için segman kanalı ölçüsü gösterilirken kesit alınabilir. Segman kanalının çapı gösterilir. Burada en önemli nokta segman kanalının parçanın neresinde olduğunu göstermektir. Bu ölçü rastgele bir yerden verilemez. Segman ne için kullanılacaksa, segmanın sabit tutacağı parçanın diğer tarafından ölçü verilir. Bu ölçü verilirken de segman kanalının arada kalan parçaya göre dış kısımda kalan duvarından ölçü verilir. Burada tasarımda dikkat edilmesi gerekilen bir nokta vardır. Segman kanalının ölçüsü şu formül ile verilir:\r\n\r\n$$\r\nS e g m a n \\  K a n a l \\imath n \\imath n \\  U z u n l u k \\  Ö l ç ü s ü = S e g m a n \\imath n \\  s a b i t l e y e c e ğ i \\  p a r ç a n \\imath n \\  u z u n l u ğ u + s e g m a n \\  k a l \\imath n l \\imath ğ \\imath\r\n$$\r\n\r\nYani segmanın sabitleyeceği parçanın ölçüsünün 23 mm olduğunu varsayalım. Segman kanalı kalınlığı ise 40 için 1,85 mm’dir. Segman kalınlığı ise yine 40 için 1,75 mm’dir. Segman kanalının dışta kalan duvarından ölçü verirken segman kanalının kalınlığı kadar değil de segman kalınlığı kadar ölçü verilir. Yani toplam ölçü $$2 3 + 1 , 7 5 = 2 4 , 7 5$$ olur. Segmanın istenilen parçayı sıkıştırabilmesi için bu ölçü verilir. Bu ölçü doğru verilmediği taktirde arada kalan 0,1 mm sıkıştırılması istenen parçayı yeteri kadar sıkıştırmayabilir. Hem çap hem de kalınlık ölçüleri için standartlara uygun toleranslar verilir.\r\n\r\n### Dış Segman Teknik Resmi\r\n\r\n![silindir, tasarım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/9d3c83198765f55fdef2d4eeccacb64d.png)\r\n\r\nBiçim 3.8 Dış segman kanalı 3d örnek.\r\n\r\n![metin, diyagram, paralel, plan içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/283e295056ed258172bb564beb388112.png)\r\n\r\nBiçim 3.9 Dış segman kanalı teknik resim örnek.\r\n\r\nBiçim 3.9’ da Dış segman kanalı teknik resim örneği verilmiştir. İç segmandaki kurallar burada da geçerlidir. Dış çap ölçüsü verilir. Burada en önemli nokta aynı iç segman kanalında olduğu gibi segman kanalının parçanın neresinde olduğunu göstermektir. Bu ölçü rastgele bir yerden verilemez. Segman ne için kullanılacaksa, segmanın sabit tutacağı parçanın diğer tarafından ölçü verilir. Bu ölçü verilirken de segman kanalının arada kalan parçaya göre dış kısımda kalan duvarından ölçü verilir. Bu ölçünün hesaplanması İç Segman Teknik Resmi bölümünde anlatılmıştır. Hem çap hem de kalınlık ölçüleri için standartlara uygun toleranslar verilir.\r\n\r\n# Alından Cıvata\r\n\r\nBazı millerde montaj için alından cıvata deliği açmak gerekebilir. Böyle bir durumda da millerin teknik resimlerinde ayrıntılar vardır.\r\n\r\n![ekran görüntüsü, silindir, tasarım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/29d9c3650adaf82851b2e6b8b844dfc5.png)\r\n\r\nBiçim 4.1 Alından cıvata deliği 3d örnek.\r\n\r\n![metin, diyagram, ekran görüntüsü, paralel içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/a0f22ca4f81bd50302915eee0fef1120.png)\r\n\r\nBiçim 4.2 Alından cıvata deliği teknik resim örnek.\r\n\r\nAlından cıvata deliğini teknik resimde gösterebilmek için kısmi kesit alınmalıdır. Kısmi kesitin boyutu fazla büyütülmemeli sadece cıvata deliğini gösterecek kadar olmalıdır. Kısmi kesit aldıktan sonra cıvatanın metrik vs. ölçüsü, diş boyu ve toplam boyu gösterilmelidir.\r\n\r\nMil çapı ölçüsü için doğru cıvata deliği açmanın da kuralları vardır. Önce cıvata metrik kaç olacağı seçilir. Bunun için mukavemet hesabı yapmak gereklidir. Mile gelecek eksenel ya da radyal yükler hesaplanır. Metrik seçildikten sonra cıvata deliği boyu seçilmelidir. Cıvata deliği boyunun standartları vardır ancak bazı durumlarda delik boyu uzun gelirse uygun biçimde standartların dışına çıkılabilir.\r\n\r\nBazı durumlarda milin torna tezgahına bağlanabilmesi için punta deliği açmak gereklidir. Punta deliği de cıvata deliği gibi kısmi kesit alınarak gösterilir.\r\n\r\n# Diş açma\r\n\r\nMillerde yaygın uygulamalardan birisi diş açmadır. Milin dış yüzeyine diş çekilir ve bu sayede çeşitli montaj imkanları edinilmiş olunur. Cıvatalar da aslında dışlarına diş çelikmiş millerdir.\r\n\r\n![](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/b42be3ee0257cedf8f1dd2848b8bd07f.png)\r\n\r\nBiçim 5.1 M20 diş açma 3d şematik görünüm.\r\n\r\n![metin, diyagram, paralel, dikdörtgen içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/b01a18c3517d123784d9637081fe3de6.png)\r\n\r\nBiçim 5.2 M20 diş açma teknik resim görünüm.\r\n\r\nTeknik resimde diş açmayı göstermek için önden görünüş yeterlidir. Metrik kaç olduğu ve diş uzunluğu ölçüleri verilmesi yeterlidir.\r\n\r\n# Dip boşaltma\r\n\r\n## Tanım ve Terminoloji\r\n\r\nDip boşaltma, teknik literatürde rahatlatma kanalı, feder yatağı veya uluslararası terminolojide \"Relief Groove\" / \"Undercut\" olarak da bilinen, bir mil üzerinde farklı çaplara sahip iki silindirik yüzeyin birleştiği fatura dibine (kesit değişimi köşesine) hassas bir şekilde işlenen geometrik bir kanaldır. Bu kanal, basit bir oluktan ziyade, birden çok mühendislik amacına hizmet eden kritik bir tasarım unsurudur.\r\n\r\nBu kanalların form ve boyutları genellikle **DIN 509** ya da **ISO 18388** gibi uluslararası standartlar ile tanımlanır. Standartlar, kanalın derinliği, genişliği ve radyusu gibi kritik ölçüleri mil çapı ve fatura yüksekliğine bağlı olarak belirler.\r\n\r\n## Dip Boşaltma Kanallarının Mühendislik Amaçları\r\n\r\nDip boşaltma kanallarının tasarıma dahil edilmesinin üç temel mühendislik sebebi bulunmaktadır:\r\n\r\n### Montaj Hassasiyetinin ve Yüzey Temasının Sağlanması\r\n\r\nBir mil üzerine rulman, dişli, conta veya başka bir makine elemanı monte edildiğinde, bu elemanın mil üzerindeki faturanın dikey yüzeyine tam olarak yaslanması (oturması) istenir. Ancak, tornalama gibi talaşlı imalat operasyonları doğası gereği fatura dibinde belirli bir köşe radyusu (fillet radius) bırakır. Monte edilecek parçanın iç köşe geometrisi ise genellikle keskin veya çok daha küçük bir radyus sahiptir.\r\n\r\nBu durumda dip boşaltma kanalı, imalattan kaynaklanan bu köşe radyusunu ortadan kaldıracak bir boşluk oluşturur. Bu sayede, monte edilen parçanın köşesi bu kanala denk gelir ve parçanın düzlemsel yüzeyi, faturanın dikey yüzeyine tam ve boşluksuz bir temas sağlar. Bu tam temas;\r\n\r\n-   Yükün düzgün bir şekilde aktarılmasını,\r\n-   Eksenel hizalanmanın ve konumlandırmanın hassas bir şekilde yapılmasını,\r\n-   Bileşenlerin öngörülen çalışma pozisyonunda olmasını garanti eder.\r\n\r\n### İmalat Süreçlerinin Kolaylaştırılması (Taşlama Taşı Çıkış Boşluğu)\r\n\r\nMillerin yataklama veya sızdırmazlık bölgeleri gibi hassas yüzeyleri genellikle taşlama (grinding) operasyonu ile son ölçülerine ve yüzey pürüzlülüğü değerlerine getirilir. Taşlama taşlarının kenarları, kırılganlığı azaltmak için her zaman belirli bir radyüse sahiptir ve bu nedenle dik bir faturanın dibine kadar sıfır yanaşarak taşlama yapamazlar.\r\n\r\nDip boşaltma kanalı, bu durumda taşlama taşı için bir çıkış boşluğu (grinding runout) görevi görür. Taş, silindirik yüzeyin sonuna geldiğinde bu boşluğa dalarak operasyonu tamamlar. Bu işlem;\r\n\r\n-   Taşlama taşının faturaya çarpmasını ve hasar görmesini engeller.\r\n-   Mil yüzeyinin fatura dibine kadar tam ve homojen bir şekilde taşlanabilmesini mümkün kılar.\r\n-   İstenen çap ve yüzey kalitesinin milin tüm çalışma yüzeyi boyunca elde edilmesini sağlar.\r\n\r\n### Gerilim Yığılmasının Kontrol Altına Alınması (Stress Relief)\r\n\r\nMillerde çapların değiştiği fatura dipleri, ani kesit daralması nedeniyle gerilim yığılması (stress concentration) için en kritik bölgelerdir. Özellikle değişken ve döngüsel yüklere maruz kalan miller, bu bölgelerden başlayan yorulma çatlakları (fatigue cracks) nedeniyle hasara uğrayabilirler.\r\n\r\nStandart bir köşe radyüsü gerilim yığılmasını bir miktar azaltsa da, özel olarak tasarlanmış bir dip boşaltma kanalı, gerilim akış çizgileri için çok daha pürüzsüz bir geçiş yolu sunar. Kanalın optimize edilmiş geometrisi (özellikle daha geniş bir dip radyüsü), gerilim yığılma faktörünü (Kt) önemli ölçüde düşürür. Bu sayede, parçanın dinamik yüklere karşı dayanımı ve yorulma ömrü artırılır.\r\n\r\n## Sonuç\r\n\r\nSonuç olarak, miller üzerindeki dip boşaltma kanalları; montaj doğruluğunu garanti eden, imalat operasyonlarını (özellikle taşlamayı) mümkün kılan ve parçanın yorulma ömrünü artırarak mekanik güvenilirliği sağlayan çok fonksiyonlu ve kritik tasarım unsurlarıdır. Tasarım aşamasında bu kanalların boyutlarının ve formunun, parçanın maruz kalacağı yüklere ve montaj gereksinimlerine göre ilgili standartlar (örn. DIN 509) dikkate alınarak seçilmesi büyük önem arz etmektedir.\r\n\r\n## Teknik Resim Örnek\r\n\r\n![silindir, levye, tasarım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/b47509f1595d4bcd9b335a4da14ce043.png)\r\n\r\nBiçim 6.1 Dip boşaltma 3d örnek.\r\n\r\n![metin, diyagram, teknik çizim, plan içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/179330463329042731a0ceea0b8bb58e.png)\r\n\r\nBiçim 6.2 Dip boşaltma teknik resim örnek.\r\n\r\nBiçim 6.2’ de dip boşaltma teknik resim örneği verilmiştir. Dip boşaltma göstermek için ön görünüşten bakmak yeterlidir. Ancak dip boşaltma çoğu zaman çok küçük olduğu için parçanın normal boyutlarında göstermek zor olabilir. Bunun için örnekte de göründüğü gibi detay görünüm alınabilir.\r\n\r\n# Toleranslar\r\n\r\nNerede hangi tolerans kullanılmalı?\r\n\r\n![](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/15f9875817b8a8fd88453000fd48c390.png)\r\n\r\n# Örnekler\r\n\r\n![metin, diyagram, taslak, çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/5449db095f7c5379d0a8c11981cb3bed.jpeg)\r\n\r\nBiçim 8.1 Örnek1\r\n\r\n![metin, diyagram, plan, teknik çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/fdf285c19472e80042645884701aea88.jpeg)\r\n\r\nBiçim 8.2 Örnek 2\r\n\r\n![metin, diyagram, teknik çizim, plan içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/358d0a979c609cc78e377243cd842371.jpeg)\r\n\r\nBiçim 8.3 Örnek 3\r\n\r\n![taslak, diyagram, metin, teknik çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/61363d2337f8056fc37fa3ebe057e35e.jpeg)\r\n\r\nBiçim 8.4 Örnek 4\r\n\r\n![metin, diyagram, çizim, taslak içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/794eda96f15979d47f55da0a6d92ba13.jpeg)\r\n\r\nBiçim 8.5 Örnek 5\r\n\r\n![diyagram, metin, taslak, çizim içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/e4f1383c38e5311810ecc4564a1dd450.jpeg)\r\n\r\nBiçim 8.6 Örnek 6\r\n\r\n![](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/2d2ec2aabe781355226c76edc1962a63.jpeg)\r\n\r\nBiçim 8.7 Örnek 7\r\n\r\n![diyagram, taslak, teknik çizim, plan içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/millerin-teknik-resminin-acilmasi/7789a41fb09e1d6ad1cd54f9b4662d82.png)\r\n\r\nBiçim 8.8 Örnek 8\r\n"
        }
    },
    {
        "id": 2,
        "title": "Saç Parçalar İçin Lazer Kesim Resmi (DWG) Hazırlama",
        "date": "2025-08-16",
        "category": "Projects",
        "desc": "bla bla bla ",
        "image": "/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/gorsel_2026-01-31_152127139.png",
        "link": "article.html?id=2",
        "content": "Lazerle kesim teknolojisi, sac metal imalatında sunduğu yüksek hassasiyet, hız ve esneklik ile modern üretimin vazgeçilmez bir parçası haline gelmiştir. Bilgisayar Destekli Tasarım (CAD) programlarında oluşturulan dijital modeller, bu teknoloji sayesinde dakikalar içinde hassas fiziksel parçalara dönüştürülebilmektedir. Ancak, bir tasarımcının bilgisayar ekranındaki mükemmel dijital model ile imalat sahasındaki lazer kesim makinesi arasında kritik bir köprü bulunur: imalat dosyası.\r\n\r\nBu dosyanın hatalı veya eksik hazırlanması, üretimde ciddi zaman kayıplarına, malzeme israfına (hurda), beklenmedik maliyetlere ve en önemlisi, tasarım amacından sapan hatalı parçaların üretilmesine yol açar.\r\n\r\nBu dokümanın amacı, mühendisler, tasarımcılar ve teknik ressamlar için sac parçaların lazer kesim dosyalarını hazırlama sürecini standardize etmek ve sıkça yapılan hataları önlemek amacıyla kapsamlı bir rehber sunmaktır. Burada anlatılan yöntemler, tasarımcı ile imalatçı arasındaki iletişimi en net ve hatasız seviyeye taşıyarak verimli bir iş akışı oluşturmayı hedefler.\r\n\r\nYazı boyunca, doğru dosya formatının seçimi ve teknik özellikleri, dosya içinde bulunması gereken kritik parça bilgileri, gereksiz geometrilerin temizlenmesi, kılavuz çekilecek delikler gibi özel imalat durumlarının ele alınması, 3B CAD modellerinden doğru dışa aktarma (export) yöntemleri, sonraki operasyonlar için referans markalama teknikleri ve son olarak tüm proje dosyalarının tek bir paftada profesyonelce nasıl sunulacağı adım adım incelenecektir.\r\n\r\n# Dosya Formatı\r\n\r\nLazer kesim makineleri, kesilecek parçaların geometrisini tanımlamak için vektör tabanlı çizim dosyalarını kullanır. Bu makinelerin CAM yazılımları, bu vektörleri yorumlayarak kesim kafasının izleyeceği takım yollarını oluşturur. Bu süreçte, endüstri standardı olarak kabul edilen ve en yaygın kullanılan iki temel dosya formatı öne çıkar: DWG ve DXF.\r\n\r\n**DWG (DraWinG):** Autodesk firmasının tescilli ve AutoCAD yazılımının yerel dosya formatıdır. İçerisinde katmanlar, çizgi kalınlıkları, bloklar, 3B veriler ve diğer zengin tasarım bilgilerini barındırabilir. Bu zengin içerik, dosya boyutunu artırabilir ve bazen lazer kesim yazılımları için gereksiz veri karmaşasına yol açabilir.\r\n\r\n**DXF (Drawing Exchange Format - Çizim Değişim Formatı):** Yine Autodesk tarafından, farklı CAD (Computer-Aided Design) yazılımları arasında 2B (iki boyutlu) ve 3B çizim verilerinin birlikte çalışabilirliğini sağlamak amacıyla geliştirilmiş evrensel bir formattır. Lazer kesim operasyonlarında genellikle sadece parçanın 2B dış ve iç konturlarına ihtiyaç duyulur. DXF formatı, bu temel geometrik bilgiyi sade ve temiz bir şekilde aktarabildiği için lazer kesim firmaları tarafından en çok tercih edilen ve en güvenilir bulunan formattır.\r\n\r\n**Tercih Edilen Format:** Tasarımınızı hangi CAD programında (örneğin SolidWorks, CATIA, Inventor, Siemens NX vb.) yaparsanız yapın, lazer kesim operasyonuna göndermeden önce dosyayı DXF formatında dışa aktarmanız en sorunsuz yöntemdir.\r\n\r\n# Dosya İçeriğinde Bulunması Gereken Bilgiler\r\n\r\n![metin, ekran görüntüsü, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/6b80c5637fc8dd598590cefe241725f7.png)\r\n\r\nSadece geometrinin yer aldığı bir çizim dosyası, imalat için tek başına yeterli değildir. Üretim sürecinde hataları önlemek, izlenebilirliği sağlamak ve lazer kesim operatörünün işini hızlandırmak amacıyla, her bir parça geometrisinin yanına veya altına özet bir bilgi bloğu eklenmelidir. Bu bilgiler, operatörün parçaları sac plaka üzerine dizerken doğru parametreleri seçmesine ve üretim planını hatasız yapmasına olanak tanır.\r\n\r\n**Bulunması Gereken Temel Bilgiler:**\r\n\r\nHer parça için aşağıdaki dört temel bilginin çizim dosyasında metin olarak yer alması kritik öneme sahiptir:\r\n\r\n**Parça Kodu / Adı:** Parçanın teknik resim veya montajdaki adıyla aynı olmalıdır. Bu, üretilen parçanın daha sonra montaj hattında veya stokta kolayca tanımlanmasını sağlar. (Örn: BRK-012-A, MOTOR_BAGLANTI_PLAKASI)\r\n\r\n**Malzeme Cinsi ve Kalitesi:** Kesilecek malzemenin türünü ve standardını net bir şekilde belirtir. Bu, doğru sac plakanın seçilmesi için zorunludur. (Örn: S235JR, ST37-2, 304 PASLANMAZ (SS), 5754 ALUMINYUM (ALU))\r\n\r\n**Sac Kalınlığı:** Lazerin odak ve güç ayarlarını doğrudan etkileyen en önemli parametrelerden biridir. Mutlaka birimiyle (örn: mm) belirtilmelidir. (Örn: 3 mm, 10 mm)\r\n\r\n**Miktar:** Operatörün, yerleştirme planlamasında o parçadan kaç adet keseceğini bilmesi için gereklidir. (Örn: 16 ADET)\r\n\r\nTüm bu metinsel bilgileri yazarken Türkçe karakter (ç, ğ, ı, ö, ş, ü) kullanılmaması önerilmektedir.\r\n\r\n# Çizim Temizliği: Sadece Kesilecek Konturlar Kalmalı\r\n\r\nLazer kesim makinesinin CAM yazılımı 'akıllı' bir yorumlayıcı değildir; dosyada gördüğü her bir çizgiyi, yayı ve vektörü, lazer kafasının izleyeceği bir takım yolu olarak kabul eder. Bu temel prensip nedeniyle, standart bir teknik resim dokümanında bulunan ancak kesim işlemiyle ilgisi olmayan tüm referans geometrileri dosyadan titizlikle temizlenmelidir.\r\n\r\nLazer kesim dosyası, parçanın 3B katı modelinden elde edilen sac açınım geometrisini içermelidir. Yani, parça bükme gibi operasyonlardan geçecekse, bu bükümlerin açılmış, düzlemsel haldeki net dış ve iç sınırları dosyada bulunmalıdır.\r\n\r\n**Dosyada Bulunmaması Gereken Öğeler:**\r\n\r\n**Ölçülendirmeler, Yüzey İşaretleri ve Toleranslar:** Bu bilgiler imalat resminde kalmalıdır. Lazer kesim dosyasında bulunmaları, makinenin bunları birer kesim çizgisi olarak algılamasına neden olabilir.\r\n\r\n**Eksen ve Merkez Çizgileri:** Deliklerin veya simetrik parçaların merkezini belirtmek için kullanılan bu çizgiler, eğer dosyada bırakılırsa makine tarafından kesilir. Bu, parçanın ortasında istenmeyen bir çizik veya kesik oluşması demektir.\r\n\r\n**Görünmez Çizgiler:** Parçanın arka yüzeyindeki veya içindeki detayları gösteren kesikli çizgiler, lazer kesim için anlamsızdır ve tamamen silinmelidir.\r\n\r\n**Teknik Resim Anteti ve Çerçevesi:** Her teknik resmin standardı olan antet ve sayfa çerçevesi, kesim dosyasında gereksizdir ve operatörün işini zorlaştırır.\r\n\r\n**Yardımcı Çizgiler ve Notlar:** Tasarım aşamasında kullanılan referans çizgileri veya \"Buraya kaynak yapılacak\" gibi metin notları temizlenmelidir.\r\n\r\n# Kılavuz Çekilecek Delikler ve Isıdan Etkilenen Bölge (HAZ)\r\n\r\n![metin, ekran görüntüsü, daire, diyagram içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/ae7aa47992dc32200951236a9d36a49a.png)\r\n\r\nLazerle kesim, son derece yoğun bir enerjinin çok küçük bir alana odaklanmasıyla gerçekleşen bir termal (ısıl) kesme prosesidir. Bu işlem sırasında metal, ergime ve buharlaşma sıcaklıklarının üzerine hızla ısıtılır. Kesim kenarı boyunca oluşan bu yüksek sıcaklık ve hemen ardından malzemenin kendi kütlesi tarafından hızla soğutulması (bu etki kendiliğinden su verme (self-quenching) olarak da bilinir), malzemenin metalurjik yapısını değiştirir. Bu yapısal değişime uğrayan dar bölgeye Isıdan Etkilenen Bölge (İEB) veya uluslararası literatürdeki adıyla Heat-Affected Zone (HAZ) denir.\r\n\r\nÖzellikle yeterli karbon oranına sahip çeliklerde (düşük karbonlu çeliklerde daha az belirgindir), bu etki, kesim yüzeyinde çok sert ve kırılgan olan martenzitik bir yapının oluşmasına neden olur.\r\n\r\n**Kılavuz Çekme Üzerindeki Etkisi:**\r\n\r\nLazerle kesilmiş bir deliğin kenarındaki bu sertleşmiş HAZ tabakası, daha sonra yapılacak olan kılavuz çekme (dişi vida açma) operasyonunu doğrudan ve olumsuz etkiler:\r\n\r\n**Aşırı Sertlik ve Takım Aşınması:** Sertleşmiş yüzey, kılavuzun kesici kenarlarının çok daha hızlı aşınmasına neden olur, bu da takım ömrünü ciddi şekilde kısaltır.\r\n\r\n**Kılavuz Kırılma Riski:** Artan kesme kuvveti gereksinimi, özellikle küçük çaplı kılavuzların delik içerisinde sıkışarak kırılma riskini önemli ölçüde artırır.\r\n\r\n**Bozuk Diş Profili:** Kılavuzun sert yüzeyde zorlanması, istenen kalitede ve toleransta bir vida diş profili elde etmeyi zorlaştırır.\r\n\r\n**Doğru Hazırlama Yöntemi: Merkez Markalama**\r\n\r\nBu olumsuzlukları tamamen ortadan kaldırmak için, vida dişi açılacak delikler lazerle nihai ölçüsünde kesilmez; bunun yerine merkezleri hassas bir şekilde lazerle işaretlenir.\r\n\r\n**Uygulama:** Çizim dosyasında (DXF), kılavuz çekilecek deliğin olduğu konuma, tam merkezini belirten küçük bir artı ‘+’ (merkez işareti ) veya alternatif olarak 1-2 mm çapında çok küçük bir daire konulur.\r\n\r\n**İşlem:** Bu işaret, lazer operatörü tarafından tam güçle kesilmez, düşük güçte bir markalama işlemiyle sac üzerine hafifçe kazınır. Bu iz, daha sonraki delme operasyonu için mükemmel bir punta görevi görür.\r\n\r\n**Sonuç:** Markalanan merkezden standart bir matkap ucu ile delik delinir. Delme işlemi termal bir süreç olmadığı için sertleşmiş bir HAZ bölgesi oluşturmaz. Bu temiz ve normal sertlikteki deliğe kılavuz çekme işlemi sorunsuz, hızlı ve güvenli bir şekilde yapılır.\r\n\r\n**Özetle:** Lazerle kesilecek bir parçada M8 vida dişi olması isteniyorsa, DXF dosyasına kılavuz çekme ön deliği olan Ø6.8 mm'lik bir daire çizilmemelidir. Bunun yerine, sadece deliğin merkezini gösteren bir '+' işareti konulmalı ve bu durum operatöre bildirilmelidir.\r\n\r\n# Solidworks ile DWG Oluşturma\r\n\r\n![metin, ekran görüntüsü, yazılım, multimedya yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/a0d575bce3ede3283b26be8695b4e75d.png)\r\n\r\nModern tasarım süreçlerinde parçalar genellikle SolidWorks, CATIA, Siemens NX, Inventor gibi parametrik 3B CAD yazılımlarında katı model olarak tasarlanır. Lazer kesim için gerekli olan 2B geometri, bu 3B modellerden elde edilir. Bu bölümde, endüstride yaygın olarak kullanılan SolidWorks programı üzerinden bir sac parçanın lazer kesime nasıl hazırlanacağı incelenecektir.\r\n\r\nDaha önce belirtildiği gibi, lazer kesim için en uyumlu ve evrensel format DXF'tir. SolidWorks'ten DXF çıktısı almanın iki temel yolu vardır ve bu yollardan bir tanesi, içerdiği riskler nedeniyle kesinlikle önerilmez.\r\n\r\n**Yöntem 1 (Önerilen):** Doğrudan Katı Modelin Sac Açınımından Dışa Aktarma\r\n\r\n**Yöntem 2 (Önerilmeyen):** Teknik Resim Dosyası (.SLDDRW) Üzerinden Dışa Aktarma\r\n\r\nBu yöntem, özellikle dikkatli olunmadığı takdirde ciddi üretim hatalarına yol açma potansiyeli taşır.\r\n\r\n**Temel Risk: ÖLÇEK:** Teknik resim sayfaları, büyük parçaları standart bir kâğıda (A4, A3 vb.) sığdırabilmek amacıyla sıklıkla küçültülmüş ölçeklerde (örn: 1:2, 1:5) veya küçük parçaları detaylandırmak için büyütülmüş ölçeklerde (örn: 2:1, 5:1) oluşturulur.\r\n\r\n**Hatanın Kaynağı:** Eğer bu ölçekli görünümden direkt olarak \"Farklı Kaydet -\\> DXF\" komutu kullanılırsa ve kaydetme ayarlarında ölçek 1:1 olarak özellikle değiştirilmezse, oluşturulan DXF dosyası da hatalı ölçekte olacaktır. Bu durum, parçanın yarı boyutunda veya iki katı boyutunda üretilmesi gibi fahiş ve maliyetli hatalara yol açar. Kullanıcının bu detayı unutma veya atlama riski çok yüksektir.\r\n\r\n**ÖNEMLİ: Son Kontrol ve Doğrulama**\r\n\r\nHangi yöntem kullanılırsa kullanılsın, oluşturulan DXF dosyası imalatçıya gönderilmeden önce mutlaka ücretsiz bir DXF/DWG görüntüleyici veya mevcut CAD programı ile tekrar açılmalıdır. Açılan dosya üzerinde, uzunluğu net olarak bilinen bir kenar (örneğin tasarımda 100 mm olması gereken bir uzunluk) ölçülerek dosyanın kesinlikle 1:1 ölçekte olduğu teyit edilmelidir. Bu basit kontrol, sizi büyük maliyetlerden kurtarabilir.\r\n\r\n# Referans Amaçlı Lazer Markalama\r\n\r\nLazer kesim makinesinin yetenekleri, malzemeyi tamamen kesip ayırmanın ötesine geçer. Lazer gücü, hızı ve odak noktası gibi parametreler hassas bir şekilde ayarlanarak, malzeme yüzeyinde kalıcı ve yüksek hassasiyette izler bırakmak mümkündür. Bu işleme markalama veya kazıma denir ve lazer kesim sonrası yapılacak operasyonlar için bir yol haritası oluşturur.\r\n\r\n**Kullanım Amacı ve Avantajları**\r\n\r\nParça üzerine CNC hassasiyetinde referanslar eklemek, sonraki imalat adımlarında büyük kolaylık sağlar:\r\n\r\n**Hassasiyeti Artırır:** Manuel ölçüm (metre, kumpas) ve işaretleme (markalama kalemi, çizecek) ihtiyacını ortadan kaldırarak insan hatası payını sıfırlar.\r\n\r\n**Hızı Artırır:** Sonraki operasyonlar (kaynak, montaj vb.) için gereken kurulum (setup) ve hizalama süresini önemli ölçüde kısaltır.\r\n\r\n**İzlenebilirliği Sağlar:** Parça üzerine parça kodu, revizyon numarası veya logo gibi bilgilerin kalıcı olarak işlenmesine olanak tanır.\r\n\r\n**Yaygın Markalama Uygulamaları**\r\n\r\n**Kaynak Konumları :** Ana parça üzerine kaynakla birleştirilecek diğer elemanların (profil, lama, cıvata somunu vb.) tam konumlarını ve oryantasyonunu belirten çizgiler markalanabilir. Bu sayede kaynakçı, parçayı doğrudan bu referans çizgilerinin üzerine yerleştirerek kaynağı doğru konumda ve açıda yapabilir.\r\n\r\n**Büküm Eksenleri:** Sac parçaların abkant preste büküleceği eksen çizgilerinin markalanması, operatörün parçayı doğru ve hızlı bir şekilde hizalamasını sağlar. Bu, endüstride çok yaygın ve verimliliği artıran bir uygulamadır.\r\n\r\n**Montaj Referansları:** Parça üzerine takılacak diğer bileşenlerin (sensör, etiket, mekanik elemanlar) yerlerini gösteren işaretler konulabilir.\r\n\r\n**Delik Merkezleri:** Kılavuz çekilecek delikler için kullanılan merkez ‘+’ işareti de aslında bir markalama işlemidir **(Bkz. Başlık 4)**.\r\n\r\n# Lazer Kesim Dosyalarını Birleştirme\r\n\r\nBir makine veya projenin imalatı, genellikle birden fazla ve bazen onlarca farklı sac parçanın kesilmesini gerektirir. Bu parçaların her birini ayrı bir dosya olarak göndermek yerine, tüm proje bileşenlerini organize bir şekilde tek bir dosyada birleştirmek, hem sizin hem de lazer kesim firmasının iş akışını önemli ölçüde iyileştirir.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/c29656dbcc6fbb361dc744165af13d66.png)\r\n",
        "tr": {
            "title": "Saç Parçalar İçin Lazer Kesim Resmi (DWG) Hazırlama",
            "desc": "bla bla bla ",
            "content": "Lazerle kesim teknolojisi, sac metal imalatında sunduğu yüksek hassasiyet, hız ve esneklik ile modern üretimin vazgeçilmez bir parçası haline gelmiştir. Bilgisayar Destekli Tasarım (CAD) programlarında oluşturulan dijital modeller, bu teknoloji sayesinde dakikalar içinde hassas fiziksel parçalara dönüştürülebilmektedir. Ancak, bir tasarımcının bilgisayar ekranındaki mükemmel dijital model ile imalat sahasındaki lazer kesim makinesi arasında kritik bir köprü bulunur: imalat dosyası.\r\n\r\nBu dosyanın hatalı veya eksik hazırlanması, üretimde ciddi zaman kayıplarına, malzeme israfına (hurda), beklenmedik maliyetlere ve en önemlisi, tasarım amacından sapan hatalı parçaların üretilmesine yol açar.\r\n\r\nBu dokümanın amacı, mühendisler, tasarımcılar ve teknik ressamlar için sac parçaların lazer kesim dosyalarını hazırlama sürecini standardize etmek ve sıkça yapılan hataları önlemek amacıyla kapsamlı bir rehber sunmaktır. Burada anlatılan yöntemler, tasarımcı ile imalatçı arasındaki iletişimi en net ve hatasız seviyeye taşıyarak verimli bir iş akışı oluşturmayı hedefler.\r\n\r\nYazı boyunca, doğru dosya formatının seçimi ve teknik özellikleri, dosya içinde bulunması gereken kritik parça bilgileri, gereksiz geometrilerin temizlenmesi, kılavuz çekilecek delikler gibi özel imalat durumlarının ele alınması, 3B CAD modellerinden doğru dışa aktarma (export) yöntemleri, sonraki operasyonlar için referans markalama teknikleri ve son olarak tüm proje dosyalarının tek bir paftada profesyonelce nasıl sunulacağı adım adım incelenecektir.\r\n\r\n# Dosya Formatı\r\n\r\nLazer kesim makineleri, kesilecek parçaların geometrisini tanımlamak için vektör tabanlı çizim dosyalarını kullanır. Bu makinelerin CAM yazılımları, bu vektörleri yorumlayarak kesim kafasının izleyeceği takım yollarını oluşturur. Bu süreçte, endüstri standardı olarak kabul edilen ve en yaygın kullanılan iki temel dosya formatı öne çıkar: DWG ve DXF.\r\n\r\n**DWG (DraWinG):** Autodesk firmasının tescilli ve AutoCAD yazılımının yerel dosya formatıdır. İçerisinde katmanlar, çizgi kalınlıkları, bloklar, 3B veriler ve diğer zengin tasarım bilgilerini barındırabilir. Bu zengin içerik, dosya boyutunu artırabilir ve bazen lazer kesim yazılımları için gereksiz veri karmaşasına yol açabilir.\r\n\r\n**DXF (Drawing Exchange Format - Çizim Değişim Formatı):** Yine Autodesk tarafından, farklı CAD (Computer-Aided Design) yazılımları arasında 2B (iki boyutlu) ve 3B çizim verilerinin birlikte çalışabilirliğini sağlamak amacıyla geliştirilmiş evrensel bir formattır. Lazer kesim operasyonlarında genellikle sadece parçanın 2B dış ve iç konturlarına ihtiyaç duyulur. DXF formatı, bu temel geometrik bilgiyi sade ve temiz bir şekilde aktarabildiği için lazer kesim firmaları tarafından en çok tercih edilen ve en güvenilir bulunan formattır.\r\n\r\n**Tercih Edilen Format:** Tasarımınızı hangi CAD programında (örneğin SolidWorks, CATIA, Inventor, Siemens NX vb.) yaparsanız yapın, lazer kesim operasyonuna göndermeden önce dosyayı DXF formatında dışa aktarmanız en sorunsuz yöntemdir.\r\n\r\n# Dosya İçeriğinde Bulunması Gereken Bilgiler\r\n\r\n![metin, ekran görüntüsü, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/6b80c5637fc8dd598590cefe241725f7.png)\r\n\r\nSadece geometrinin yer aldığı bir çizim dosyası, imalat için tek başına yeterli değildir. Üretim sürecinde hataları önlemek, izlenebilirliği sağlamak ve lazer kesim operatörünün işini hızlandırmak amacıyla, her bir parça geometrisinin yanına veya altına özet bir bilgi bloğu eklenmelidir. Bu bilgiler, operatörün parçaları sac plaka üzerine dizerken doğru parametreleri seçmesine ve üretim planını hatasız yapmasına olanak tanır.\r\n\r\n**Bulunması Gereken Temel Bilgiler:**\r\n\r\nHer parça için aşağıdaki dört temel bilginin çizim dosyasında metin olarak yer alması kritik öneme sahiptir:\r\n\r\n**Parça Kodu / Adı:** Parçanın teknik resim veya montajdaki adıyla aynı olmalıdır. Bu, üretilen parçanın daha sonra montaj hattında veya stokta kolayca tanımlanmasını sağlar. (Örn: BRK-012-A, MOTOR_BAGLANTI_PLAKASI)\r\n\r\n**Malzeme Cinsi ve Kalitesi:** Kesilecek malzemenin türünü ve standardını net bir şekilde belirtir. Bu, doğru sac plakanın seçilmesi için zorunludur. (Örn: S235JR, ST37-2, 304 PASLANMAZ (SS), 5754 ALUMINYUM (ALU))\r\n\r\n**Sac Kalınlığı:** Lazerin odak ve güç ayarlarını doğrudan etkileyen en önemli parametrelerden biridir. Mutlaka birimiyle (örn: mm) belirtilmelidir. (Örn: 3 mm, 10 mm)\r\n\r\n**Miktar:** Operatörün, yerleştirme planlamasında o parçadan kaç adet keseceğini bilmesi için gereklidir. (Örn: 16 ADET)\r\n\r\nTüm bu metinsel bilgileri yazarken Türkçe karakter (ç, ğ, ı, ö, ş, ü) kullanılmaması önerilmektedir.\r\n\r\n# Çizim Temizliği: Sadece Kesilecek Konturlar Kalmalı\r\n\r\nLazer kesim makinesinin CAM yazılımı 'akıllı' bir yorumlayıcı değildir; dosyada gördüğü her bir çizgiyi, yayı ve vektörü, lazer kafasının izleyeceği bir takım yolu olarak kabul eder. Bu temel prensip nedeniyle, standart bir teknik resim dokümanında bulunan ancak kesim işlemiyle ilgisi olmayan tüm referans geometrileri dosyadan titizlikle temizlenmelidir.\r\n\r\nLazer kesim dosyası, parçanın 3B katı modelinden elde edilen sac açınım geometrisini içermelidir. Yani, parça bükme gibi operasyonlardan geçecekse, bu bükümlerin açılmış, düzlemsel haldeki net dış ve iç sınırları dosyada bulunmalıdır.\r\n\r\n**Dosyada Bulunmaması Gereken Öğeler:**\r\n\r\n**Ölçülendirmeler, Yüzey İşaretleri ve Toleranslar:** Bu bilgiler imalat resminde kalmalıdır. Lazer kesim dosyasında bulunmaları, makinenin bunları birer kesim çizgisi olarak algılamasına neden olabilir.\r\n\r\n**Eksen ve Merkez Çizgileri:** Deliklerin veya simetrik parçaların merkezini belirtmek için kullanılan bu çizgiler, eğer dosyada bırakılırsa makine tarafından kesilir. Bu, parçanın ortasında istenmeyen bir çizik veya kesik oluşması demektir.\r\n\r\n**Görünmez Çizgiler:** Parçanın arka yüzeyindeki veya içindeki detayları gösteren kesikli çizgiler, lazer kesim için anlamsızdır ve tamamen silinmelidir.\r\n\r\n**Teknik Resim Anteti ve Çerçevesi:** Her teknik resmin standardı olan antet ve sayfa çerçevesi, kesim dosyasında gereksizdir ve operatörün işini zorlaştırır.\r\n\r\n**Yardımcı Çizgiler ve Notlar:** Tasarım aşamasında kullanılan referans çizgileri veya \"Buraya kaynak yapılacak\" gibi metin notları temizlenmelidir.\r\n\r\n# Kılavuz Çekilecek Delikler ve Isıdan Etkilenen Bölge (HAZ)\r\n\r\n![metin, ekran görüntüsü, daire, diyagram içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/ae7aa47992dc32200951236a9d36a49a.png)\r\n\r\nLazerle kesim, son derece yoğun bir enerjinin çok küçük bir alana odaklanmasıyla gerçekleşen bir termal (ısıl) kesme prosesidir. Bu işlem sırasında metal, ergime ve buharlaşma sıcaklıklarının üzerine hızla ısıtılır. Kesim kenarı boyunca oluşan bu yüksek sıcaklık ve hemen ardından malzemenin kendi kütlesi tarafından hızla soğutulması (bu etki kendiliğinden su verme (self-quenching) olarak da bilinir), malzemenin metalurjik yapısını değiştirir. Bu yapısal değişime uğrayan dar bölgeye Isıdan Etkilenen Bölge (İEB) veya uluslararası literatürdeki adıyla Heat-Affected Zone (HAZ) denir.\r\n\r\nÖzellikle yeterli karbon oranına sahip çeliklerde (düşük karbonlu çeliklerde daha az belirgindir), bu etki, kesim yüzeyinde çok sert ve kırılgan olan martenzitik bir yapının oluşmasına neden olur.\r\n\r\n**Kılavuz Çekme Üzerindeki Etkisi:**\r\n\r\nLazerle kesilmiş bir deliğin kenarındaki bu sertleşmiş HAZ tabakası, daha sonra yapılacak olan kılavuz çekme (dişi vida açma) operasyonunu doğrudan ve olumsuz etkiler:\r\n\r\n**Aşırı Sertlik ve Takım Aşınması:** Sertleşmiş yüzey, kılavuzun kesici kenarlarının çok daha hızlı aşınmasına neden olur, bu da takım ömrünü ciddi şekilde kısaltır.\r\n\r\n**Kılavuz Kırılma Riski:** Artan kesme kuvveti gereksinimi, özellikle küçük çaplı kılavuzların delik içerisinde sıkışarak kırılma riskini önemli ölçüde artırır.\r\n\r\n**Bozuk Diş Profili:** Kılavuzun sert yüzeyde zorlanması, istenen kalitede ve toleransta bir vida diş profili elde etmeyi zorlaştırır.\r\n\r\n**Doğru Hazırlama Yöntemi: Merkez Markalama**\r\n\r\nBu olumsuzlukları tamamen ortadan kaldırmak için, vida dişi açılacak delikler lazerle nihai ölçüsünde kesilmez; bunun yerine merkezleri hassas bir şekilde lazerle işaretlenir.\r\n\r\n**Uygulama:** Çizim dosyasında (DXF), kılavuz çekilecek deliğin olduğu konuma, tam merkezini belirten küçük bir artı ‘+’ (merkez işareti ) veya alternatif olarak 1-2 mm çapında çok küçük bir daire konulur.\r\n\r\n**İşlem:** Bu işaret, lazer operatörü tarafından tam güçle kesilmez, düşük güçte bir markalama işlemiyle sac üzerine hafifçe kazınır. Bu iz, daha sonraki delme operasyonu için mükemmel bir punta görevi görür.\r\n\r\n**Sonuç:** Markalanan merkezden standart bir matkap ucu ile delik delinir. Delme işlemi termal bir süreç olmadığı için sertleşmiş bir HAZ bölgesi oluşturmaz. Bu temiz ve normal sertlikteki deliğe kılavuz çekme işlemi sorunsuz, hızlı ve güvenli bir şekilde yapılır.\r\n\r\n**Özetle:** Lazerle kesilecek bir parçada M8 vida dişi olması isteniyorsa, DXF dosyasına kılavuz çekme ön deliği olan Ø6.8 mm'lik bir daire çizilmemelidir. Bunun yerine, sadece deliğin merkezini gösteren bir '+' işareti konulmalı ve bu durum operatöre bildirilmelidir.\r\n\r\n# Solidworks ile DWG Oluşturma\r\n\r\n![metin, ekran görüntüsü, yazılım, multimedya yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/a0d575bce3ede3283b26be8695b4e75d.png)\r\n\r\nModern tasarım süreçlerinde parçalar genellikle SolidWorks, CATIA, Siemens NX, Inventor gibi parametrik 3B CAD yazılımlarında katı model olarak tasarlanır. Lazer kesim için gerekli olan 2B geometri, bu 3B modellerden elde edilir. Bu bölümde, endüstride yaygın olarak kullanılan SolidWorks programı üzerinden bir sac parçanın lazer kesime nasıl hazırlanacağı incelenecektir.\r\n\r\nDaha önce belirtildiği gibi, lazer kesim için en uyumlu ve evrensel format DXF'tir. SolidWorks'ten DXF çıktısı almanın iki temel yolu vardır ve bu yollardan bir tanesi, içerdiği riskler nedeniyle kesinlikle önerilmez.\r\n\r\n**Yöntem 1 (Önerilen):** Doğrudan Katı Modelin Sac Açınımından Dışa Aktarma\r\n\r\n**Yöntem 2 (Önerilmeyen):** Teknik Resim Dosyası (.SLDDRW) Üzerinden Dışa Aktarma\r\n\r\nBu yöntem, özellikle dikkatli olunmadığı takdirde ciddi üretim hatalarına yol açma potansiyeli taşır.\r\n\r\n**Temel Risk: ÖLÇEK:** Teknik resim sayfaları, büyük parçaları standart bir kâğıda (A4, A3 vb.) sığdırabilmek amacıyla sıklıkla küçültülmüş ölçeklerde (örn: 1:2, 1:5) veya küçük parçaları detaylandırmak için büyütülmüş ölçeklerde (örn: 2:1, 5:1) oluşturulur.\r\n\r\n**Hatanın Kaynağı:** Eğer bu ölçekli görünümden direkt olarak \"Farklı Kaydet -\\> DXF\" komutu kullanılırsa ve kaydetme ayarlarında ölçek 1:1 olarak özellikle değiştirilmezse, oluşturulan DXF dosyası da hatalı ölçekte olacaktır. Bu durum, parçanın yarı boyutunda veya iki katı boyutunda üretilmesi gibi fahiş ve maliyetli hatalara yol açar. Kullanıcının bu detayı unutma veya atlama riski çok yüksektir.\r\n\r\n**ÖNEMLİ: Son Kontrol ve Doğrulama**\r\n\r\nHangi yöntem kullanılırsa kullanılsın, oluşturulan DXF dosyası imalatçıya gönderilmeden önce mutlaka ücretsiz bir DXF/DWG görüntüleyici veya mevcut CAD programı ile tekrar açılmalıdır. Açılan dosya üzerinde, uzunluğu net olarak bilinen bir kenar (örneğin tasarımda 100 mm olması gereken bir uzunluk) ölçülerek dosyanın kesinlikle 1:1 ölçekte olduğu teyit edilmelidir. Bu basit kontrol, sizi büyük maliyetlerden kurtarabilir.\r\n\r\n# Referans Amaçlı Lazer Markalama\r\n\r\nLazer kesim makinesinin yetenekleri, malzemeyi tamamen kesip ayırmanın ötesine geçer. Lazer gücü, hızı ve odak noktası gibi parametreler hassas bir şekilde ayarlanarak, malzeme yüzeyinde kalıcı ve yüksek hassasiyette izler bırakmak mümkündür. Bu işleme markalama veya kazıma denir ve lazer kesim sonrası yapılacak operasyonlar için bir yol haritası oluşturur.\r\n\r\n**Kullanım Amacı ve Avantajları**\r\n\r\nParça üzerine CNC hassasiyetinde referanslar eklemek, sonraki imalat adımlarında büyük kolaylık sağlar:\r\n\r\n**Hassasiyeti Artırır:** Manuel ölçüm (metre, kumpas) ve işaretleme (markalama kalemi, çizecek) ihtiyacını ortadan kaldırarak insan hatası payını sıfırlar.\r\n\r\n**Hızı Artırır:** Sonraki operasyonlar (kaynak, montaj vb.) için gereken kurulum (setup) ve hizalama süresini önemli ölçüde kısaltır.\r\n\r\n**İzlenebilirliği Sağlar:** Parça üzerine parça kodu, revizyon numarası veya logo gibi bilgilerin kalıcı olarak işlenmesine olanak tanır.\r\n\r\n**Yaygın Markalama Uygulamaları**\r\n\r\n**Kaynak Konumları :** Ana parça üzerine kaynakla birleştirilecek diğer elemanların (profil, lama, cıvata somunu vb.) tam konumlarını ve oryantasyonunu belirten çizgiler markalanabilir. Bu sayede kaynakçı, parçayı doğrudan bu referans çizgilerinin üzerine yerleştirerek kaynağı doğru konumda ve açıda yapabilir.\r\n\r\n**Büküm Eksenleri:** Sac parçaların abkant preste büküleceği eksen çizgilerinin markalanması, operatörün parçayı doğru ve hızlı bir şekilde hizalamasını sağlar. Bu, endüstride çok yaygın ve verimliliği artıran bir uygulamadır.\r\n\r\n**Montaj Referansları:** Parça üzerine takılacak diğer bileşenlerin (sensör, etiket, mekanik elemanlar) yerlerini gösteren işaretler konulabilir.\r\n\r\n**Delik Merkezleri:** Kılavuz çekilecek delikler için kullanılan merkez ‘+’ işareti de aslında bir markalama işlemidir **(Bkz. Başlık 4)**.\r\n\r\n# Lazer Kesim Dosyalarını Birleştirme\r\n\r\nBir makine veya projenin imalatı, genellikle birden fazla ve bazen onlarca farklı sac parçanın kesilmesini gerektirir. Bu parçaların her birini ayrı bir dosya olarak göndermek yerine, tüm proje bileşenlerini organize bir şekilde tek bir dosyada birleştirmek, hem sizin hem de lazer kesim firmasının iş akışını önemli ölçüde iyileştirir.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/c29656dbcc6fbb361dc744165af13d66.png)\r\n"
        },
        "en": {
            "title": "Preparing Laser Cutting Illustrations (DWG) for Hair Pieces",
            "desc": "bla bla bla",
            "content": "Lazerle kesim teknolojisi, sac metal imalatında sunduğu yüksek hassasiyet, hız ve esneklik ile modern üretimin vazgeçilmez bir parçası haline gelmiştir. Bilgisayar Destekli Tasarım (CAD) programlarında oluşturulan dijital modeller, bu teknoloji sayesinde dakikalar içinde hassas fiziksel parçalara dönüştürülebilmektedir. Ancak, bir tasarımcının bilgisayar ekranındaki mükemmel dijital model ile imalat sahasındaki lazer kesim makinesi arasında kritik bir köprü bulunur: imalat dosyası.\r\n\r\nBu dosyanın hatalı veya eksik hazırlanması, üretimde ciddi zaman kayıplarına, malzeme israfına (hurda), beklenmedik maliyetlere ve en önemlisi, tasarım amacından sapan hatalı parçaların üretilmesine yol açar.\r\n\r\nBu dokümanın amacı, mühendisler, tasarımcılar ve teknik ressamlar için sac parçaların lazer kesim dosyalarını hazırlama sürecini standardize etmek ve sıkça yapılan hataları önlemek amacıyla kapsamlı bir rehber sunmaktır. Burada anlatılan yöntemler, tasarımcı ile imalatçı arasındaki iletişimi en net ve hatasız seviyeye taşıyarak verimli bir iş akışı oluşturmayı hedefler.\r\n\r\nYazı boyunca, doğru dosya formatının seçimi ve teknik özellikleri, dosya içinde bulunması gereken kritik parça bilgileri, gereksiz geometrilerin temizlenmesi, kılavuz çekilecek delikler gibi özel imalat durumlarının ele alınması, 3B CAD modellerinden doğru dışa aktarma (export) yöntemleri, sonraki operasyonlar için referans markalama teknikleri ve son olarak tüm proje dosyalarının tek bir paftada profesyonelce nasıl sunulacağı adım adım incelenecektir.\r\n\r\n# Dosya Formatı\r\n\r\nLazer kesim makineleri, kesilecek parçaların geometrisini tanımlamak için vektör tabanlı çizim dosyalarını kullanır. Bu makinelerin CAM yazılımları, bu vektörleri yorumlayarak kesim kafasının izleyeceği takım yollarını oluşturur. Bu süreçte, endüstri standardı olarak kabul edilen ve en yaygın kullanılan iki temel dosya formatı öne çıkar: DWG ve DXF.\r\n\r\n**DWG (DraWinG):** Autodesk firmasının tescilli ve AutoCAD yazılımının yerel dosya formatıdır. İçerisinde katmanlar, çizgi kalınlıkları, bloklar, 3B veriler ve diğer zengin tasarım bilgilerini barındırabilir. Bu zengin içerik, dosya boyutunu artırabilir ve bazen lazer kesim yazılımları için gereksiz veri karmaşasına yol açabilir.\r\n\r\n**DXF (Drawing Exchange Format - Çizim Değişim Formatı):** Yine Autodesk tarafından, farklı CAD (Computer-Aided Design) yazılımları arasında 2B (iki boyutlu) ve 3B çizim verilerinin birlikte çalışabilirliğini sağlamak amacıyla geliştirilmiş evrensel bir formattır. Lazer kesim operasyonlarında genellikle sadece parçanın 2B dış ve iç konturlarına ihtiyaç duyulur. DXF formatı, bu temel geometrik bilgiyi sade ve temiz bir şekilde aktarabildiği için lazer kesim firmaları tarafından en çok tercih edilen ve en güvenilir bulunan formattır.\r\n\r\n**Tercih Edilen Format:** Tasarımınızı hangi CAD programında (örneğin SolidWorks, CATIA, Inventor, Siemens NX vb.) yaparsanız yapın, lazer kesim operasyonuna göndermeden önce dosyayı DXF formatında dışa aktarmanız en sorunsuz yöntemdir.\r\n\r\n# Dosya İçeriğinde Bulunması Gereken Bilgiler\r\n\r\n![metin, ekran görüntüsü, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/6b80c5637fc8dd598590cefe241725f7.png)\r\n\r\nSadece geometrinin yer aldığı bir çizim dosyası, imalat için tek başına yeterli değildir. Üretim sürecinde hataları önlemek, izlenebilirliği sağlamak ve lazer kesim operatörünün işini hızlandırmak amacıyla, her bir parça geometrisinin yanına veya altına özet bir bilgi bloğu eklenmelidir. Bu bilgiler, operatörün parçaları sac plaka üzerine dizerken doğru parametreleri seçmesine ve üretim planını hatasız yapmasına olanak tanır.\r\n\r\n**Bulunması Gereken Temel Bilgiler:**\r\n\r\nHer parça için aşağıdaki dört temel bilginin çizim dosyasında metin olarak yer alması kritik öneme sahiptir:\r\n\r\n**Parça Kodu / Adı:** Parçanın teknik resim veya montajdaki adıyla aynı olmalıdır. Bu, üretilen parçanın daha sonra montaj hattında veya stokta kolayca tanımlanmasını sağlar. (Örn: BRK-012-A, MOTOR_BAGLANTI_PLAKASI)\r\n\r\n**Malzeme Cinsi ve Kalitesi:** Kesilecek malzemenin türünü ve standardını net bir şekilde belirtir. Bu, doğru sac plakanın seçilmesi için zorunludur. (Örn: S235JR, ST37-2, 304 PASLANMAZ (SS), 5754 ALUMINYUM (ALU))\r\n\r\n**Sac Kalınlığı:** Lazerin odak ve güç ayarlarını doğrudan etkileyen en önemli parametrelerden biridir. Mutlaka birimiyle (örn: mm) belirtilmelidir. (Örn: 3 mm, 10 mm)\r\n\r\n**Miktar:** Operatörün, yerleştirme planlamasında o parçadan kaç adet keseceğini bilmesi için gereklidir. (Örn: 16 ADET)\r\n\r\nTüm bu metinsel bilgileri yazarken Türkçe karakter (ç, ğ, ı, ö, ş, ü) kullanılmaması önerilmektedir.\r\n\r\n# Çizim Temizliği: Sadece Kesilecek Konturlar Kalmalı\r\n\r\nLazer kesim makinesinin CAM yazılımı 'akıllı' bir yorumlayıcı değildir; dosyada gördüğü her bir çizgiyi, yayı ve vektörü, lazer kafasının izleyeceği bir takım yolu olarak kabul eder. Bu temel prensip nedeniyle, standart bir teknik resim dokümanında bulunan ancak kesim işlemiyle ilgisi olmayan tüm referans geometrileri dosyadan titizlikle temizlenmelidir.\r\n\r\nLazer kesim dosyası, parçanın 3B katı modelinden elde edilen sac açınım geometrisini içermelidir. Yani, parça bükme gibi operasyonlardan geçecekse, bu bükümlerin açılmış, düzlemsel haldeki net dış ve iç sınırları dosyada bulunmalıdır.\r\n\r\n**Dosyada Bulunmaması Gereken Öğeler:**\r\n\r\n**Ölçülendirmeler, Yüzey İşaretleri ve Toleranslar:** Bu bilgiler imalat resminde kalmalıdır. Lazer kesim dosyasında bulunmaları, makinenin bunları birer kesim çizgisi olarak algılamasına neden olabilir.\r\n\r\n**Eksen ve Merkez Çizgileri:** Deliklerin veya simetrik parçaların merkezini belirtmek için kullanılan bu çizgiler, eğer dosyada bırakılırsa makine tarafından kesilir. Bu, parçanın ortasında istenmeyen bir çizik veya kesik oluşması demektir.\r\n\r\n**Görünmez Çizgiler:** Parçanın arka yüzeyindeki veya içindeki detayları gösteren kesikli çizgiler, lazer kesim için anlamsızdır ve tamamen silinmelidir.\r\n\r\n**Teknik Resim Anteti ve Çerçevesi:** Her teknik resmin standardı olan antet ve sayfa çerçevesi, kesim dosyasında gereksizdir ve operatörün işini zorlaştırır.\r\n\r\n**Yardımcı Çizgiler ve Notlar:** Tasarım aşamasında kullanılan referans çizgileri veya \"Buraya kaynak yapılacak\" gibi metin notları temizlenmelidir.\r\n\r\n# Kılavuz Çekilecek Delikler ve Isıdan Etkilenen Bölge (HAZ)\r\n\r\n![metin, ekran görüntüsü, daire, diyagram içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/ae7aa47992dc32200951236a9d36a49a.png)\r\n\r\nLazerle kesim, son derece yoğun bir enerjinin çok küçük bir alana odaklanmasıyla gerçekleşen bir termal (ısıl) kesme prosesidir. Bu işlem sırasında metal, ergime ve buharlaşma sıcaklıklarının üzerine hızla ısıtılır. Kesim kenarı boyunca oluşan bu yüksek sıcaklık ve hemen ardından malzemenin kendi kütlesi tarafından hızla soğutulması (bu etki kendiliğinden su verme (self-quenching) olarak da bilinir), malzemenin metalurjik yapısını değiştirir. Bu yapısal değişime uğrayan dar bölgeye Isıdan Etkilenen Bölge (İEB) veya uluslararası literatürdeki adıyla Heat-Affected Zone (HAZ) denir.\r\n\r\nÖzellikle yeterli karbon oranına sahip çeliklerde (düşük karbonlu çeliklerde daha az belirgindir), bu etki, kesim yüzeyinde çok sert ve kırılgan olan martenzitik bir yapının oluşmasına neden olur.\r\n\r\n**Kılavuz Çekme Üzerindeki Etkisi:**\r\n\r\nLazerle kesilmiş bir deliğin kenarındaki bu sertleşmiş HAZ tabakası, daha sonra yapılacak olan kılavuz çekme (dişi vida açma) operasyonunu doğrudan ve olumsuz etkiler:\r\n\r\n**Aşırı Sertlik ve Takım Aşınması:** Sertleşmiş yüzey, kılavuzun kesici kenarlarının çok daha hızlı aşınmasına neden olur, bu da takım ömrünü ciddi şekilde kısaltır.\r\n\r\n**Kılavuz Kırılma Riski:** Artan kesme kuvveti gereksinimi, özellikle küçük çaplı kılavuzların delik içerisinde sıkışarak kırılma riskini önemli ölçüde artırır.\r\n\r\n**Bozuk Diş Profili:** Kılavuzun sert yüzeyde zorlanması, istenen kalitede ve toleransta bir vida diş profili elde etmeyi zorlaştırır.\r\n\r\n**Doğru Hazırlama Yöntemi: Merkez Markalama**\r\n\r\nBu olumsuzlukları tamamen ortadan kaldırmak için, vida dişi açılacak delikler lazerle nihai ölçüsünde kesilmez; bunun yerine merkezleri hassas bir şekilde lazerle işaretlenir.\r\n\r\n**Uygulama:** Çizim dosyasında (DXF), kılavuz çekilecek deliğin olduğu konuma, tam merkezini belirten küçük bir artı ‘+’ (merkez işareti ) veya alternatif olarak 1-2 mm çapında çok küçük bir daire konulur.\r\n\r\n**İşlem:** Bu işaret, lazer operatörü tarafından tam güçle kesilmez, düşük güçte bir markalama işlemiyle sac üzerine hafifçe kazınır. Bu iz, daha sonraki delme operasyonu için mükemmel bir punta görevi görür.\r\n\r\n**Sonuç:** Markalanan merkezden standart bir matkap ucu ile delik delinir. Delme işlemi termal bir süreç olmadığı için sertleşmiş bir HAZ bölgesi oluşturmaz. Bu temiz ve normal sertlikteki deliğe kılavuz çekme işlemi sorunsuz, hızlı ve güvenli bir şekilde yapılır.\r\n\r\n**Özetle:** Lazerle kesilecek bir parçada M8 vida dişi olması isteniyorsa, DXF dosyasına kılavuz çekme ön deliği olan Ø6.8 mm'lik bir daire çizilmemelidir. Bunun yerine, sadece deliğin merkezini gösteren bir '+' işareti konulmalı ve bu durum operatöre bildirilmelidir.\r\n\r\n# Solidworks ile DWG Oluşturma\r\n\r\n![metin, ekran görüntüsü, yazılım, multimedya yazılımı içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/a0d575bce3ede3283b26be8695b4e75d.png)\r\n\r\nModern tasarım süreçlerinde parçalar genellikle SolidWorks, CATIA, Siemens NX, Inventor gibi parametrik 3B CAD yazılımlarında katı model olarak tasarlanır. Lazer kesim için gerekli olan 2B geometri, bu 3B modellerden elde edilir. Bu bölümde, endüstride yaygın olarak kullanılan SolidWorks programı üzerinden bir sac parçanın lazer kesime nasıl hazırlanacağı incelenecektir.\r\n\r\nDaha önce belirtildiği gibi, lazer kesim için en uyumlu ve evrensel format DXF'tir. SolidWorks'ten DXF çıktısı almanın iki temel yolu vardır ve bu yollardan bir tanesi, içerdiği riskler nedeniyle kesinlikle önerilmez.\r\n\r\n**Yöntem 1 (Önerilen):** Doğrudan Katı Modelin Sac Açınımından Dışa Aktarma\r\n\r\n**Yöntem 2 (Önerilmeyen):** Teknik Resim Dosyası (.SLDDRW) Üzerinden Dışa Aktarma\r\n\r\nBu yöntem, özellikle dikkatli olunmadığı takdirde ciddi üretim hatalarına yol açma potansiyeli taşır.\r\n\r\n**Temel Risk: ÖLÇEK:** Teknik resim sayfaları, büyük parçaları standart bir kâğıda (A4, A3 vb.) sığdırabilmek amacıyla sıklıkla küçültülmüş ölçeklerde (örn: 1:2, 1:5) veya küçük parçaları detaylandırmak için büyütülmüş ölçeklerde (örn: 2:1, 5:1) oluşturulur.\r\n\r\n**Hatanın Kaynağı:** Eğer bu ölçekli görünümden direkt olarak \"Farklı Kaydet -\\> DXF\" komutu kullanılırsa ve kaydetme ayarlarında ölçek 1:1 olarak özellikle değiştirilmezse, oluşturulan DXF dosyası da hatalı ölçekte olacaktır. Bu durum, parçanın yarı boyutunda veya iki katı boyutunda üretilmesi gibi fahiş ve maliyetli hatalara yol açar. Kullanıcının bu detayı unutma veya atlama riski çok yüksektir.\r\n\r\n**ÖNEMLİ: Son Kontrol ve Doğrulama**\r\n\r\nHangi yöntem kullanılırsa kullanılsın, oluşturulan DXF dosyası imalatçıya gönderilmeden önce mutlaka ücretsiz bir DXF/DWG görüntüleyici veya mevcut CAD programı ile tekrar açılmalıdır. Açılan dosya üzerinde, uzunluğu net olarak bilinen bir kenar (örneğin tasarımda 100 mm olması gereken bir uzunluk) ölçülerek dosyanın kesinlikle 1:1 ölçekte olduğu teyit edilmelidir. Bu basit kontrol, sizi büyük maliyetlerden kurtarabilir.\r\n\r\n# Referans Amaçlı Lazer Markalama\r\n\r\nLazer kesim makinesinin yetenekleri, malzemeyi tamamen kesip ayırmanın ötesine geçer. Lazer gücü, hızı ve odak noktası gibi parametreler hassas bir şekilde ayarlanarak, malzeme yüzeyinde kalıcı ve yüksek hassasiyette izler bırakmak mümkündür. Bu işleme markalama veya kazıma denir ve lazer kesim sonrası yapılacak operasyonlar için bir yol haritası oluşturur.\r\n\r\n**Kullanım Amacı ve Avantajları**\r\n\r\nParça üzerine CNC hassasiyetinde referanslar eklemek, sonraki imalat adımlarında büyük kolaylık sağlar:\r\n\r\n**Hassasiyeti Artırır:** Manuel ölçüm (metre, kumpas) ve işaretleme (markalama kalemi, çizecek) ihtiyacını ortadan kaldırarak insan hatası payını sıfırlar.\r\n\r\n**Hızı Artırır:** Sonraki operasyonlar (kaynak, montaj vb.) için gereken kurulum (setup) ve hizalama süresini önemli ölçüde kısaltır.\r\n\r\n**İzlenebilirliği Sağlar:** Parça üzerine parça kodu, revizyon numarası veya logo gibi bilgilerin kalıcı olarak işlenmesine olanak tanır.\r\n\r\n**Yaygın Markalama Uygulamaları**\r\n\r\n**Kaynak Konumları :** Ana parça üzerine kaynakla birleştirilecek diğer elemanların (profil, lama, cıvata somunu vb.) tam konumlarını ve oryantasyonunu belirten çizgiler markalanabilir. Bu sayede kaynakçı, parçayı doğrudan bu referans çizgilerinin üzerine yerleştirerek kaynağı doğru konumda ve açıda yapabilir.\r\n\r\n**Büküm Eksenleri:** Sac parçaların abkant preste büküleceği eksen çizgilerinin markalanması, operatörün parçayı doğru ve hızlı bir şekilde hizalamasını sağlar. Bu, endüstride çok yaygın ve verimliliği artıran bir uygulamadır.\r\n\r\n**Montaj Referansları:** Parça üzerine takılacak diğer bileşenlerin (sensör, etiket, mekanik elemanlar) yerlerini gösteren işaretler konulabilir.\r\n\r\n**Delik Merkezleri:** Kılavuz çekilecek delikler için kullanılan merkez ‘+’ işareti de aslında bir markalama işlemidir **(Bkz. Başlık 4)**.\r\n\r\n# Lazer Kesim Dosyalarını Birleştirme\r\n\r\nBir makine veya projenin imalatı, genellikle birden fazla ve bazen onlarca farklı sac parçanın kesilmesini gerektirir. Bu parçaların her birini ayrı bir dosya olarak göndermek yerine, tüm proje bileşenlerini organize bir şekilde tek bir dosyada birleştirmek, hem sizin hem de lazer kesim firmasının iş akışını önemli ölçüde iyileştirir.\r\n\r\n![ekran görüntüsü, metin, multimedya yazılımı, yazılım içeren bir resim Yapay zeka tarafından oluşturulmuş içerik yanlış olabilir.](/static/uploads/Projects/2025/sac-parcalar-icin-lazer-kesim-resmi-dwg-hazirlama/c29656dbcc6fbb361dc744165af13d66.png)\r\n"
        }
    }
]